{
  "type": "article",
  "date": "2025-11-29",
  "title": "Fall of the World Trade Center",
  "content": "<h2>Uncovering the Divine Drama of the Fall of the World Trade Center</h2>\n\n<p>Tyre was one of the two greatest cities in the world. As great in that day as N.Y. or London of our day. Tyre was situated midway between the east and the west, and at the junction of three continents, they carried on the trade of the world. The Mediterranean became the mere highway of their commerce. They passed the Strait of Gibraltar on one hand, and reached India on the other. They settled Cyprus, Sicily, and Sardinia. In Spain they founded Gades (now Cadiz); and in Africa, Utica and Carthage, the latter destined to be in time the dreaded rival of Rome.</p>\n<p>They planted depots on the Persian Gulf and the Red Sea. They obtained tin from The British Isles, amber from the Baltic, silver from Tarshish (southern Spain) and gold from southeastern Arabia. They carried on vast mining operations, and were marvelous workers in ivory, pottery, and the metals, so that their bronzes and painted vases became the models of early Grecian art. Sidon was noted for its glass working, in which the blowpipe, lathe, and graver were used. The costly purple dye of Tyre, obtained in minute drops from shellfish, was famous, the rarest and most beautiful shade being worn only by kings. For years the armed forces of other nations had attacked this proud city but always unsuccessful.</p>\n<p>Very soon after this prophecy there was a 13-year siege by Nebuchadnezzar. (See Josephus) Nebuchadnezzar took the city, demolished the mainland. The people fled to the island located ½ mile off shore. Cf. 27:4; 28:2. The mainland became known as Old Tyre and the island as New Tyre. Nebuchadnezzar made himself master of Tyre, after a siege of thirteen years continuance, and utterly destroyed the place, that is, the city which was on the continent; the ruins of which were afterwards called Palae Tyrus, or Old Tyre.</p>\n<p>But, before it came to this extremity, the inhabitants had removed most of their effects into an island about half a mile distant from the shore, and there built them a new city. And therefore, when Neabuchadnezzar entered that, which he had so long besieged, he found little there wherewith to reward his soldiers in the spoil of the place, which they had so long labored to take; and therefore wreaking his anger upon the buildings, and the few inhabitants who were left in them, he razed the whole town to the ground, and slew all he found therein. After this it never more recovered it former glory; but the city on the island became the Tyre that was afterward so famous by that name; the other on the continent never arising any higher than to become a village by the name of Old Tyre, as was before said. Prideaux’s Connection 1676 Page 127.</p>\n<p>Today, a small new town called Sur in a different location out in the Peninsula and inhabited by a few fisherman. It is erroneously designated as Tyre by some maps, but is not Tyre. It is not on the sight of Ancient Tyre. Ancient Tyre has never been rebuilt. It was predicted that Tyre would be forgotten for 70 years. Jer. 25:11,12. “This whole country will become a desolate wasteland, and these nations will serve the king of Babylon seventy years. But when the seventy years are fulfilled, I will punish the king of Babylon and his nation, the land of the Babylonians, for their guilt,\" declares the LORD, \"and will make it desolate forever.”</p>\n<p>She served the Babylonians for 70 years afterwards she rebuilt Tyre on the Island. Isa. 23:15-17 “At that time Tyre will be forgotten for seventy years, the span of a king's life. But at the end of these seventy years, it will happen to Tyre as in the song of the prostitute: \"Take up a harp, walk through the city, O prostitute forgotten; play the harp well, sing many a song, so that you will be remembered.\" At the end of seventy years, the LORD will deal with Tyre. She will return to her hire as a prostitute and will ply her trade with all the kingdoms on the face of the earth.”</p>\n<p>In the year 606 B.C. King Nebuchadnezzar had invaded the nation of Judah. The Jews were conquered and taken captive to Babylon between 606 and 580 BC. The people of Tyre were looking with greedy eyes upon Judah, and they were making plans on going down and taking part of the spoil now that their rival king had invaded and conquered it.</p>\n<p>250 years later, Alexander the Great accomplished the reduction of Tyre. He built a causeway 200 feet wide and ½ mile long to the island. Thus turning the island into a peninsula scaled the wall and conquered the people. After a siege of 7 months the city was captured, 8,000 citizens were slaughtered, 2,000 crucified and 30,000 sold into slavery. Alexander performed a feet of military ingenuity by building a 2,000 ft, mole in the sea. To safeguard operations, mobile protective shields, so called ‘tortoises’ had to be employed. Despite this the construction was greatly hindered by and incessant hail of missiles.</p>\n<p>Meantime engineers on shore were building mobile protective towers many stories high. They were the highest siege towers ever used in the history of war. A drawbridge on front enabled a surprise attack to be made on the enemy’s wall. Each of them was one hundred and sixty feet high. When these monsters were prepared they were rolled toward the walls of Tyre. The impregnable Tyre met with fate at Alexander’s hand Josephus places the settlement of Tyre 240 years before the building of Solomon’s Temple.</p>\n<p>Pliney, who wrote when its boundaries could still be traced, computes the circuit of Palae-Tyrus and the island together at nineteen Roman miles. Tyre offered a qualified surrender to Alexander the Great, which did not satisfy the haughty Macedonian, and he instantly laid siege to the city. Having no adequate fleet with which to reach the island-town, he resolved to carry a causeway across the channel, which separated the island from Old Tyre, on the mainland, and he demolished the buildings of the latter to provide materials for the work. It was an undertaking of immense magnitude and difficulty, and the ingenious Tyreians found many modes of interfering with it. They succeeded in destroying the mole when half of it had been built; but Alexander, with obstinate perseverance, began his work anew, on a larger scale than before. He also collected a strong fleet of war-galleys, from Cyprus and from the Phoenicians who had submitted to him, with which the opposition of the enemy was checked and his own operations advanced. (History for Ready Reference 1895 Vol 5 p. 3159-3160)</p>\n<p>The prophets not only foretold the overthrow of old Tyre, but also of this new city, built, as it were, “in the midst of the sea.” Ezek 27:32 “As they wail and mourn over you, they will take up a lament concerning you: ‘Who was ever silenced like Tyre, surrounded by the sea?’\" Isaiah makes it clear that Tyre was located on an island when he says: “Howl ye inhabitants of the isle.” Isa 23:6 “Cross over to Tarshish; wail, you people of the island.”</p>\n<p>Zechariah says that Tyre heaped up gold and silver like dirt on the streets and that she was a sea power and would be consumed by fire. Zech 9:3,4 “Tyre has built herself a stronghold; she has heaped up silver like dust, and gold like the dirt of the streets. But the Lord will take away her possessions and destroy her power on the sea, and she will be consumed by fire.” This new city was truly a strong hold, for not only was her walls 150 feet in height but she was located on an island a half mile from shore making it impossible for other nations to attack her.</p>\n<p>Ezekiel also plainly predicts, that the second destruction of Tyre should be by fire. Ezek 28:18. By your many sins and dishonest trade you have desecrated your sanctuaries. So I made a fire come out from you, and it consumed you, and I reduced you to ashes on the ground in the sight of all who were watching. “Accordingly, Alexander the Great besieged and took the city, and set it on fire. Alexander’s Evidences of Christianity, 1836 p 155 (Professor at Princeton Seminary)</p>\n<p>Cotovicus, a Dutch traveler, who visited Syria in 1598, writes, “that this city so often restored after being overthrown, now at length appears to be utterly ruined; so that it has ceased to be any longer a city, and only some inconsiderable vestiges of her former ruins are now visible. If you except a few arches and baths, and some ruined walls, and collapsed towers, and mere rubbish, there is now nothing of Tyre to be discerned.” Quoted in Alexander’s Evidences of Christianity, 1836 p. 156</p>\n<p>“This city, standing in the sea, on a peninsula, at a distance, promises something very magnificent; but when you come nearer, you find no similitude of that glory for which it was so renowned in ancient times, and which the prophet Ezekiel describes in chapters 26,27,28 of his prophecy. On the north side, it has an old ungarrisoned Turkish castle, besides which you see nothing but a mere Babel of broken walls, pillars, vaults, etc. there being not so much as one entire house left; its present inhabitants only a few poor wretches, harboring themselves in the vaults, and subsisting chiefly on fishing, who seem to be preserved in this place, by divine Providence, as a visible argument how God has fulfilled his word concerning Tyre, that it should be ‘as the top of a rock, a place for fishers to dry their nets on.’” Quoted in Alexander’s Evidences of Christianity, 1836 p. 157</p>\n<p>Now for my commentary on the destruction of Tyre according to the Scriptures in Ezekiel chapters 26, 27 and 28.</p>\n\n<h3>Ezekiel 26:1</h3>\n<blockquote class=\"primary-scripture\">In the eleventh year, on the first day of the month, the word of the LORD came to me:</blockquote>\n<p>It was on Feb. 3rd 585 B.C. when Ezekiel received a message from the Sovereign Lord! “Son of Man,” Tyre thinks that she is going to be heir to Judea. She gloats by saying “Aha” now I will control the trade route instead of Judea. The message continues to tell of the destruction of Tyre by Nebuchadnezzar.</p>\n\n<h3>Ezekiel 26:2</h3>\n<blockquote class=\"primary-scripture\">\"Son of man, because Tyre has said of Jerusalem, 'Aha! The gate to the nations is broken, and its doors have swung open to me; now that she lies in ruins I will prosper,'</blockquote>\n<p>Since Jerusalem is in ruins by the Babylonians she will be able to plunder Judea. They think that they will grow fat on her ruin.</p>\n\n<h3>Ezekiel 26:3</h3>\n<blockquote class=\"primary-scripture\">therefore this is what the Sovereign LORD says: I am against you, O Tyre, and I will bring many nations against you, like the sea casting up its waves.</blockquote>\n<p>The Sovereign Lord says He is coming after him and that he will bring nations against Tyre like waves of the Sea. Other nations had brought their forces against Tyre but were always unsuccessful.</p>\n\n<h3>Ezekiel 26:4</h3>\n<blockquote class=\"primary-scripture\">They will destroy the walls of Tyre and pull down her towers; I will scrape away her rubble and make her a bare rock.</blockquote>\n<p>According to the Sovereign Lord they are going to tear down her walls and take a sledgehammer to her towers and leave nothing but a bare rock where fishermen will dry their nets. The Babylonians besieged Tyre for 13 years and finally broke through her stronghold and began their destruction. But Tyre had fled, along with all her riches to an island a half-mile off shore. The Babylonians had no way of reaching them. As a reward for carrying out the siege the Sovereign Lord tell Nebuchadnezzar that he will give him Egypt as a reward. “Therefore this is what the Sovereign LORD says: I am going to give Egypt to Nebuchadnezzar king of Babylon, and he will carry off its wealth. He will loot and plunder the land as pay for his army. I have given him Egypt as a reward for his efforts because he and his army did it for me, declares the Sovereign LORD.” Ezekiel 29:19,20</p>\n\n<h3>Ezekiel 26:5</h3>\n<blockquote class=\"primary-scripture\">Out in the sea she will become a place to spread fishnets, for I have spoken, declares the Sovereign LORD. She will become plunder for the nations,</blockquote>\n<p>Furthermore, he will leave the place uninhabited and a place to be plundered. The Sovereign Lord says she will be nothing more than a bare rock off shore where fishing nets will be spread to dry. This part of the prophecy will not be fulfilled for another 250 years when Alexander the Great accomplished the reduction of Tyre. He will scrape up the remains of old buildings and build a causeway 200 feet wide to the Island and then destroy New Tyre. Off shore she built a new stronghold with walls 150 feet in height. Tyre went into captivity for 70 years and afterwards returned to rebuild on the island.</p>\n\n<h3>Ezekiel 26:6</h3>\n<blockquote class=\"primary-scripture\">and her settlements on the mainland will be ravaged by the sword. Then they will know that I am the LORD.</blockquote>\n<p>Notice how the word of God mentions mainland and island. All her subdivisions, villages, and sister towns will be destroyed by the sword and when it happens they will know that it was of God. This was all accomplished by the army of Nebuchadnezzar.</p>\n\n<h3>Ezekiel 26:7</h3>\n<blockquote class=\"primary-scripture\">\"For this is what the Sovereign LORD says: From the north I am going to bring against Tyre Nebuchadnezzar king of Babylon, king of kings, with horses and chariots, with horsemen and a great army.</blockquote>\n<p>The Sovereign Lord speaks with authority and certainty: He declares that King Nebuchadnezzar will come with his cavalry, war chariots, and soldiers. The mainland was completely destroyed by Nebuchadnezzar and her people exiled for 70 years.</p>\n\n<h3>Ezekiel 26:8</h3>\n<blockquote class=\"primary-scripture\">He will ravage your settlements on the mainland with the sword; he will set up siege works against you, build a ramp up to your walls and raise his shields against you.</blockquote>\n<p>The Lord declares that he will destroy her townships, build ramps against her walls, and her mainland will fall by the sword. Every word of the Sovereign Lord has been fulfilled regarding this prophecy. I have already stated in my introduction that Alexander the Great built siege towers with a drawbridge 160 feet tall. He rolled it down the causeway and up to the wall. The drawbridge opened on top of the wall and the soldiers overpowered the guards.</p>\n\n<h3>Ezekiel 26:9</h3>\n<blockquote class=\"primary-scripture\">He will direct the blows of his battering rams against your walls and demolish your towers with his weapons.</blockquote>\n<p>Your walls will fall victim to the battering rams and he will break down your towers. When the siege was over the mainland was destroyed. They killed or carried captive the remaining inhabitants. Pliney calculated the circuit of the city at 19 Roman miles. The Babylonians destroyed all of her high walls and homes and stores.</p>\n\n<h3>Ezekiel 26:10</h3>\n<blockquote class=\"primary-scripture\">His horses will be so many that they will cover you with dust. Your walls will tremble at the noise of the war horses, wagons and chariots when he enters your gates as men enter a city whose walls have been broken through.</blockquote>\n<p>The Sovereign Lord says that they will pass thru your broken gates and you will choke on the dust and your walls will shake from the vibration of the war chariots and the battle cry.</p>\n\n<h3>Ezekiel 26:11</h3>\n<blockquote class=\"primary-scripture\">The hoofs of his horses will trample all your streets; he will kill your people with the sword, and your strong pillars will fall to the ground.</blockquote>\n<p>They will throw a chain around your pillars and hook a team of horses to them and they will collapse. Your people will be slain by the sword. The butcherer of Baghdad will butcher you.</p>\n\n<h3>Ezekiel 26:12</h3>\n<blockquote class=\"primary-scripture\">They will plunder your wealth and loot your merchandise; they will break down your walls and demolish your fine houses and throw your stones, timber and rubble into the sea.</blockquote>\n<p>Your homes inhabited by the rich and famous will be burnt to the ground, and what remains of your goods will be carted off to Babylon. During the 13-year siege the Tyreanians sent women and children and the larger part of their wealth to other nations. The Babylonians were disappointed to find little or no loot inside the city. However, God rewarded them by giving them Egypt.</p>\n\n<h3>Ezekiel 26:13</h3>\n<blockquote class=\"primary-scripture\">I will put an end to your noisy songs, and the music of your harps will be heard no more.</blockquote>\n<p>Your bars, your opera houses, your places of entertainment will all be destroyed.</p>\n\n<h3>Ezekiel 26:14</h3>\n<blockquote class=\"primary-scripture\">I will make you a bare rock, and you will become a place to spread fishnets. You will never be rebuilt, for I the LORD have spoken, declares the Sovereign LORD.</blockquote>\n<p>He again affirms that they will be like a bare rock and further declares that they will never be rebuilt and all that will be left is a place to dry your fishing nets. To this day Tyre has never been rebuilt and it never will be rebuilt.</p>\n\n<h3>Ezekiel 26:15</h3>\n<blockquote class=\"primary-scripture\">\"This is what the Sovereign LORD says to Tyre: Will not the coastlands tremble at the sound of your fall, when the wounded groan and the slaughter takes place in you?</blockquote>\n<p>The towns located along the coast and the islands will tremble when they hear the screaming of her people and the report of the wholesale slaughter they will be heart stricken.</p>\n\n<h3>Ezekiel 26:16</h3>\n<blockquote class=\"primary-scripture\">Then all the princes of the coast will step down from their thrones and lay aside their robes and take off their embroidered garments. Clothed with terror, they will sit on the ground, trembling every moment, appalled at you.</blockquote>\n<p>He will bring every ruler down to the ground trembling; they will cast off their royal apparel and will be dressed in terror and dismay. They will not be able to stop trembling, they will be terrified and horror struck. The neighboring towns submitted to Babylonian and Grecian rule.</p>\n\n<h3>Ezekiel 26:17</h3>\n<blockquote class=\"primary-scripture\">Then they will take up a lament concerning you and say to you: \" 'How you are destroyed, O city of renown, peopled by men of the sea! You were a power on the seas, you and your citizens; you put your terror on all who lived there.</blockquote>\n<p>They will be like mourner at a funeral listening to the funeral dirge. They will bemoan the fact that they were the world’s sea power and no nation on earth was able to destroy them.</p>\n\n<h3>Ezekiel 26:18</h3>\n<blockquote class=\"primary-scripture\">Now the coastlands tremble on the day of your fall; the islands in the sea are terrified at your collapse.'</blockquote>\n<p>Here is their lament: Oh famous city…we had the greatest navel power…we struck terror around the world…how could this happen to us?</p>\n\n<h3>Ezekiel 26:19</h3>\n<blockquote class=\"primary-scripture\">\"This is what the Sovereign LORD says: When I make you a desolate city, like cities no longer inhabited, and when I bring the ocean depths over you and its vast waters cover you,</blockquote>\n<p>The Sovereign Lord says that they will sink to the bottom. The city will no longer be inhabited. Today their seaport is gone and much of ancient Tyre is under water. Her ships went the bottom of the ocean.</p>\n\n<h3>Ezekiel 26:20</h3>\n<blockquote class=\"primary-scripture\">then I will bring you down with those who go down to the pit, to the people of long ago. I will make you dwell in the earth below, as in ancient ruins, with those who go down to the pit, and you will not return or take your place in the land of the living.</blockquote>\n<p>Tyre, you are headed for the grave! You are going to everlasting ruins. Check it out for yourself! That group of people is not among the living.</p>\n\n<h3>Ezekiel 26:21</h3>\n<blockquote class=\"primary-scripture\">I will bring you to a horrible end and you will be no more. You will be sought, but you will never again be found, declares the Sovereign LORD.\"</blockquote>\n<p>Tyre, you are headed for the grave! You are going to everlasting ruins. They will sift thru your garbage dumps and seek to understand how you lived. They will draw a map of where you lived but no one will be living there. Today all that can be found are a few arches and baths, and some ruined walls, and collapsed towers and rubbish, there is nothing of value left at Tyre.</p>\n\n<h3>Ezekiel 27:1</h3>\n<blockquote class=\"primary-scripture\">The word of the LORD came to me:</blockquote>\n<p>Ezekiel receives another message from God.</p>\n\n<h3>Ezekiel 27:2</h3>\n<blockquote class=\"primary-scripture\">\"Son of man, take up a lament concerning Tyre.</blockquote>\n<p>The Eternal tell him to sing a funeral song. We preachers are called upon to preach a funeral but in that part of the world they often sang a dirge.</p>\n\n<h3>Ezekiel 27:3</h3>\n<blockquote class=\"primary-scripture\">Say to Tyre, situated at the gateway to the sea, merchant of peoples on many coasts, 'This is what the Sovereign LORD says: \" 'You say, O Tyre, \"I am perfect in beauty.\"</blockquote>\n<p>You are to sing this song about Tyre, the world trade center, located at the gateway to the sea. This ancient seaport was located on the Mediterranean and was carrying on a worldwide trade. Her merchants were wealthy and in their own words “I am perfect in beauty.” It must have been a home of the rich and famous.</p>\n\n<h3>Ezekiel 27:4</h3>\n<blockquote class=\"primary-scripture\">Your domain was on the high seas; your builders brought your beauty to perfection.</blockquote>\n<p>Ezekiel, here is your song! Tell them that it is from the Sovereign Lord. Your harbors extend into the sea and you imported and exported from many isles. You employed the best craftsman to build your homes and businesses. When Solomon was about to build the temple he sent the following message to the king of Tyre: “\"Send me, therefore, a man skilled to work in gold and silver, bronze and iron, and in purple, crimson and blue yarn, and experienced in the art of engraving, to work in Judah and Jerusalem with my skilled craftsmen, whom my father David provided.” 2 Chron. 2:7</p>\n\n<h3>Ezekiel 27:5</h3>\n<blockquote class=\"primary-scripture\">They made all your timbers of pine trees from Senir; they took a cedar from Lebanon to make a mast for you.</blockquote>\n<p>The planking for your ships was made of Cyprus and pine was used for the timbers because of its strength. The mast that held the main sail was from a cedar tree in Lebanon. Goods and materials were being shipped to Tyre from 40 countries or cities. Senir was the Amorite name of Mt.Hermon and Lebanon was located at the end of the Mediterranean.</p>\n\n<h3>Ezekiel 27:6</h3>\n<blockquote class=\"primary-scripture\">Of oaks from Bashan they made your oars; of cypress wood from the coasts of Cyprus  they made your deck, inlaid with ivory.</blockquote>\n<p>Hand carved oars came from the oaks of Bashan and oarlocks made from bronze. Your decks were elegant; they were made of Cyprus and inlaid with ivory. Bashan was located East and Northeast of the Sea of Galilee in ancient Palestine. Cyprus is an island South of turkey and was colonized by the Phoenicians.</p>\n\n<h3>Ezekiel 27:7</h3>\n<blockquote class=\"primary-scripture\">Fine embroidered linen from Egypt was your sail and served as your banner; your awnings were of blue and purple from the coasts of Elishah.</blockquote>\n<p>Your sails were made of embroidered silk from Egypt. Egypt was famous for embroidered linen. Purple and scarlet awning covered your main cabin so the Captain of the ship would be protected from the scorching sun. Egypt was a country in N.E. Africa.</p>\n\n<h3>Ezekiel 27:8</h3>\n<blockquote class=\"primary-scripture\">Men of Sidon and Arvad were your oarsmen; your skilled men, O Tyre, were aboard as your seamen.</blockquote>\n<p>Your oarsmen who rowed the ship out of the harbor thru the straits to the ocean were from Sidon and Arvad. These men were slaves whom they paid no salary for their work. Your pilots were older skilled captains who had proved their sea worthiness. Up the coast from Tyre was Sidon, its modern name is Saida.</p>\n\n<h3>Ezekiel 27:9</h3>\n<blockquote class=\"primary-scripture\">Veteran craftsmen of Gebal were on board as shipwrights to caulk your seams. All the ships of the sea and their sailors came alongside to trade for your wares.</blockquote>\n<p>You had the best craftsman waterproofing the ship. Ships were lined up coming into your harbor from every port in the world loaded with merchandise. This was the largest seaport of ancient times carrying on trade not only by sea but also by caravan routes all the way to India. Gebal was a seaport of Phoenicia, 25 miles N. of Beirut. It was noted for expert stone masonry and shipbuilding.</p>\n\n<h3>Ezekiel 27:10</h3>\n<blockquote class=\"primary-scripture\">\" 'Men of Persia, Lydia and Put served as soldiers in your army. They hung their shields and helmets on your walls, bringing you splendor.</blockquote>\n<p>You hired “solders of fortune” to guard your city and harbors. These solders had come from Persia, Lydia, and Libya. Persia is now Iran, Lydia was an ancient kingdom in W. Asia Minor.</p>\n\n<h3>Ezekiel 27:11</h3>\n<blockquote class=\"primary-scripture\">Men of Arvad and Helech manned your walls on every side; men of Gammad were in your towers. They hung their shields around your walls; they brought your beauty to perfection.</blockquote>\n<p>Men of Arvad and as far away as Cilicia were guards in the towers on to of the walls. Arvad was a small island off the coast of Syria and about 40 miles N. of Tripoli. Helech was probably Cilicia, an area in S.E. Turkey. Gammad meant Valiant men or brave warriors.</p>\n\n<h3>Ezekiel 27:12</h3>\n<blockquote class=\"primary-scripture\">\" 'Tarshish did business with you because of your great wealth of goods; they exchanged silver, iron, tin and lead for your merchandise.</blockquote>\n<p>Your buyers located in Spain shipped you silver, iron, tin and lead and in return you shipped merchandise to them.</p>\n\n<h3>Ezekiel 27:13</h3>\n<blockquote class=\"primary-scripture\">'Greece, Tubal and Meshech traded with you; they exchanged slaves and articles of bronze for your wares.</blockquote>\n<p>You bought slaves and bronze dishes from the merchants of Greece, Tubal, and Meshech. Anyone in need of a slave could purchase one in the slave market at Tyre. Bronze is the only metal that will last where salt water is present. Therefore, all the lights, oarlocks, bolts, navigational equipment, nails and miscellaneous hardware on the ships or located in the harbors were made of bronze. The capital of Greece was Athens and Greece consisted of many islands in the Aegean, Ionian, and Mediterranean seas.</p>\n\n<h3>Ezekiel 27:14</h3>\n<blockquote class=\"primary-scripture\">\" 'Men of Beth Togarmah exchanged work horses, war horses and mules for your merchandise.</blockquote>\n<p>Armenian feudal Lords supplied you with horses, horsemen and mules. A barter type of trade was carried on so that caravans would come loaded with goods and leave loaded with goods from other countries that came through the port of Tyre. Togarmah was a city in E. Asia Minor (Armenia)</p>\n\n<h3>Ezekiel 27:15</h3>\n<blockquote class=\"primary-scripture\">\" 'The men of Rhodes traded with you, and many coastlands were your customers; they paid you with ivory tusks and ebony.</blockquote>\n<p>The men of Dedan (Rhodes) traded with you. The coastlines and islands were a source of your commerce. Places in which you done business gave you ivory tusks and ebony. The famous lighthouse of Rhodes was one of the 7 wonders of the world.</p>\n\n<h3>Ezekiel 27:16</h3>\n<blockquote class=\"primary-scripture\">\" ‘Aram did business with you because of your many products; they exchanged turquoise, purple fabric, embroidered work, fine linen, coral and rubies for your merchandise.</blockquote>\n<p>Syria was another of your merchants. They traded turquoise, purple dyes, fine linen, and jewelry.</p>\n\n<h3>Ezekiel 27:17</h3>\n<blockquote class=\"primary-scripture\">\" 'Judah and Israel traded with you; they exchanged wheat from Minnith and confections, honey, oil and balm for your wares.</blockquote>\n<p>Judah and Israel traded you wheat, wax, olive oil, and honey. Farmers from Israel shipped their produce up to Tyre. Minnith was a city in Isarel once belonged to the Amorites.</p>\n\n<h3>Ezekiel 27:18</h3>\n<blockquote class=\"primary-scripture\">\" 'Damascus, because of your many products and great wealth of goods, did business with you in wine from Helbon and wool from Zahar.</blockquote>\n<p>Damascus traded you white wool and choice wine. Helbon wine was supposed to be the world’s best wine. Helbon was a village in Syria.</p>\n\n<h3>Ezekiel 27:19</h3>\n<blockquote class=\"primary-scripture\">\" 'Danites and Greeks from Uzal bought your merchandise; they exchanged wrought iron, cassia and calamus for your wares.</blockquote>\n<p>Danites and Greeks traded you wrought iron, sugarcane, cinnamon and spices. Danites were from the tribe of Dan. Uzal is now Yemen it was located on the Tygris river and was famous for sword blades.</p>\n\n<h3>Ezekiel 27:20</h3>\n<blockquote class=\"primary-scripture\">\" 'Dedan traded in saddle blankets with you.</blockquote>\n<p>Dedan traded their expensive saddle blankets with you. By now you are beginning to see that Tyre was a world import and export city. Dedan is Ethopia.</p>\n\n<h3>Ezekiel 27:21</h3>\n<blockquote class=\"primary-scripture\">\" 'Arabia and all the princes of Kedar were your customers; they did business with you in lambs, rams and goats.</blockquote>\n<p>The Arabians sold you rams, lambs and goats. These animals would furnish a supply of meat plus some to be resold. These would all be sold to world traders at the livestock sales. Arabia was a nomadic tribe that raised sheep and goats in the Northern part of the Arabian desert.</p>\n\n<h3>Ezekiel 27:22</h3>\n<blockquote class=\"primary-scripture\">\" 'The merchants of Sheba and Raamah traded with you; for your merchandise they exchanged the finest of all kinds of spices and precious stones, and gold.</blockquote>\n<p>The merchants of Sheba (Africa) and their trading company sold you the finest spices and all kinds of precious stones. The spices would be sold in the stores and the jewelers would sell rings and bracelets and charms made from these gems. Raamah was a place in Arabia near the Persian gulf.</p>\n\n<h3>Ezekiel 27:23</h3>\n<blockquote class=\"primary-scripture\">\" 'Haran, Canneh and Eden and merchants of Sheba, Asshur and Kilmad traded with you.</blockquote>\n<p>Six trading companies from the area of Haran traded their goods. Haran was a city in Mesopotamia. Canneh was a city in Assyria and Eden was a city on the Euphrates and Tygris (Isa. 37:12). Asshur also known as Nineveh.</p>\n\n<h3>Ezekiel 27:24</h3>\n<blockquote class=\"primary-scripture\">In your marketplace they traded with you beautiful garments, blue fabric, embroidered work and multicolored rugs with cords twisted and tightly knotted.</blockquote>\n<p>Among the things traded by the Haran group of merchants were chests, clothing, and fine carpets.</p>\n\n<h3>Ezekiel 27:25</h3>\n<blockquote class=\"primary-scripture\">\" 'The ships of Tarshish serve as carriers for your wares. You are filled with heavy cargo in the heart of the sea.</blockquote>\n<p>A fleet of ships from Tarshish (Spain) came filled to the brim with merchandise and left with a load of cargo to other seaports.</p>\n\n<h3>Ezekiel 27:26</h3>\n<blockquote class=\"primary-scripture\">Your oarsmen take you out to the high seas. But the east wind will break you to pieces in the heart of the sea.</blockquote>\n<p>This sea-going trade capital was headed for disaster. Alexander will come from the East. 250 years after this prophecy, Alexander the Great accomplished the reduction of Tyre. He built a causeway 200 feet wide and ½ mile long to the island. Thus turning the island into a peninsula scaled the wall and conquered the people. After a siege of 7 months the city was captured, 8,000 citizens were slaughtered, 2,000 crucified and 30,000 sold into slavery. Alexander performed a feet of military ingenuity by building a 2,000 ft, mole in the sea. To safeguard operations, mobile protective shields, so called ‘tortoises’ had to be employed. Despite this the construction was greatly hindered by and incessant hail of missiles. Meantime engineers on shore were building mobile protective towers many stories high. They were the highest siege towers ever used in the history of war. A drawbridge on front enabled a surprise attack to be made on the enemy’s wall. Each of them was one hundred and sixty feet high. When these monsters were prepared they were rolled toward the walls of Tyre. The impregnable Tyre met with fate at Alexander’s hand. According to prophecy Tyre was to be “broken in the heart of the sea.” When Alexander arrived Tyre was not on land but in the heart of the sea. Was there ever a prophecy fulfilled with such accuracy and detail.</p>\n\n<h3>Ezekiel 27:27</h3>\n<blockquote class=\"primary-scripture\">Your wealth, merchandise and wares, your mariners, seamen and shipwrights, your merchants and all your soldiers, and everyone else on board will sink into the heart of the sea on the day of your shipwreck.</blockquote>\n<p>Imports, exports, sailors, wealth, cargo, crew, captains and caulkers were headed for the bottom of the sea. When Alexander the Great finished the reduction of Tyre nothing was left standing. His army burned, plundered and pillaged the city and sunk their boats. They even destroyed the port.</p>\n\n<h3>Ezekiel 27:28</h3>\n<blockquote class=\"primary-scripture\">The shorelands will quake when your seamen cry out.</blockquote>\n<p>The whole countryside was shaken with terror. Men’s hearts were failing them for fear.</p>\n\n<h3>Ezekiel 27:29</h3>\n<blockquote class=\"primary-scripture\">All who handle the oars will abandon their ships; the mariners and all the seamen will stand on the shore.</blockquote>\n<p>The rowers, the pilots, and all the sailors come ashore because the trade has come to a sudden halt.</p>\n\n<h3>Ezekiel 27:30</h3>\n<blockquote class=\"primary-scripture\">They will raise their voice and cry bitterly over you; they will sprinkle dust on their heads and roll in ashes.</blockquote>\n<p>These men cried and pulled their hair and wept and rolled in the dust.</p>\n\n<h3>Ezekiel 27:31</h3>\n<blockquote class=\"primary-scripture\">They will shave their heads because of you and will put on sackcloth. They will weep over you with anguish of soul and with bitter mourning.</blockquote>\n<p>So enraged were they that they even tore out their hair. They put on sackcloth, but it was too little too late!</p>\n\n<h3>Ezekiel 27:32</h3>\n<blockquote class=\"primary-scripture\">As they wail and mourn over you, they will take up a lament concerning you: \"Who was ever silenced like Tyre, surrounded by the sea?\"</blockquote>\n<p>They were not only out of work but their homes were destroyed and their lives were in jeopardy. Now they are pictured as singing this sad funeral song. “Was there ever such a city as Tyre, now silent at the bottom of the sea? Every day their conversation was about the world trade center, they were still talking about it generations later.</p>\n\n<h3>Ezekiel 27:33</h3>\n<blockquote class=\"primary-scripture\">When your merchandise went out on the seas, you satisfied many nations; with your great wealth and your wares you enriched the kings of the earth.</blockquote>\n<p>When your warehouses were loaded on ships and sent to other ports you enriched kings and all who could afford your exports. Nations were glad to import and export with you. The economy of Tyre and other nations was enriched.</p>\n\n<h3>Ezekiel 27:34</h3>\n<blockquote class=\"primary-scripture\">Now you are shattered by the sea in the depths of the waters; your wares and all your company have gone down with you.</blockquote>\n<p>Alexander the Great broke down the 150 feet high walls, or as the Scripture says “shattered by the sea in the depths of the water.” By the time he finished destroying the city and massacring her people nothing was left except a place to dry fishing nets.</p>\n\n<h3>Ezekiel 27:35</h3>\n<blockquote class=\"primary-scripture\">All who live in the coastlands are appalled at you; their kings shudder with horror and their faces are distorted with fear.</blockquote>\n<p>Their countenance has changed, they are horrified and appalled and are aghast at their fate, this people was so panic-stricken that it showed it on their face. Doom has come to the people of Tyre. Alexander will capture 40,000 citizens of Tyre, 8,000 citizens will be slaughtered, 2,000 will be crucified and 30,000 will be sold as slaves. Is it any wonder that the scripture says that their kings shudder with horror and faces are distorted with fear.</p>\n\n<h3>Ezekiel 27:36</h3>\n<blockquote class=\"primary-scripture\">The merchants among the nations hiss at you; you have come to a horrible end and will be no more.' \"</blockquote>\n<p>The people of Tyre have ceased to be and they shall be no more forever.</p>\n\n<h3>Ezekiel 28:1</h3>\n<blockquote class=\"primary-scripture\">The word of the LORD came to me:</blockquote>\n<p>God had a special message for this One and Only. This arrogant King thought of himself as God.</p>\n\n<h3>Ezekiel 28:2</h3>\n<blockquote class=\"primary-scripture\">\"Son of man, say to the ruler of Tyre, 'This is what the Sovereign Lord says:   \" 'In the pride of your heart you say, \"I am a god; I sit on the throne of a god in the heart of the seas.\" But you are a man and not a god, though you think you are as wise as a god.</blockquote>\n<p>In his haughtiness and pride he claims that he is god and is seated on a throne in Tyre. In a similar way the popes of the Catholic Church claims that they are God. Pope Leo X111 said: “We hold upon this earth the place of God Almighty.” (Leo X111 Ency, 304).</p>\n\n<h3>Ezekiel 28:3</h3>\n<blockquote class=\"primary-scripture\">Are you wiser than Daniel? Is no secret hidden from you?</blockquote>\n<p>This king becomes arrogant and claims that he is as wise as Daniel.</p>\n\n<h3>Ezekiel 28:4</h3>\n<blockquote class=\"primary-scripture\">By your wisdom and understanding you have gained wealth for yourself and amassed gold and silver in your treasuries.</blockquote>\n<p>God is going to use some irony. This type of satire will show how ridiculous his claim is. The prophet Zechariah said that the king of Tyre had amassed gold and silver like dirt on the street. Zech. 9:3,4</p>\n\n<h3>Ezekiel 28:5</h3>\n<blockquote class=\"primary-scripture\">By your great skill in trading you have increased your wealth, and because of your wealth your heart has grown proud.</blockquote>\n<p>There seems to be little doubt that he had amassed a fortune. Although he had lined his coffers with gold and silver he let it “go to his head”. This egotistical fool was proud of his accomplishments and now he claims he is God.</p>\n\n<h3>Ezekiel 28:6</h3>\n<blockquote class=\"primary-scripture\">\" 'Therefore this is what the Sovereign LORD says:  \" 'Because you think you are wise, as wise as a god,</blockquote>\n<p>Therefore, God is going to give him an evaluation. The Sovereign Lord is the one who is going to conduct the investigation and scrutinize his character.</p>\n\n<h3>Ezekiel 28:7</h3>\n<blockquote class=\"primary-scripture\">I am going to bring foreigners against you, the most ruthless of nations; they will draw their swords against your beauty and wisdom and pierce your shining splendor.</blockquote>\n<p>God is saying, just “wait and see!” I will bring a ruthless nation against you and then we will see if you are as wise as Daniel and as strong as God. The kings of Tyre had outwitted the Babylonians by moving their possessions off shore and building a fortified city on an island where they would be secure from any army on earth. Little did they know the ingenuity of Alexander the Great.</p>\n\n<h3>Ezekiel 28:8</h3>\n<blockquote class=\"primary-scripture\">They will bring you down to the pit, and you will die a violent death in the heart of the seas.</blockquote>\n<p>This army will bring you down to the grave. You will die in your island home pierced and wounded. The word that was pronounced by the prophet was fulfilled according to the specifications of the Sovereign Lord.</p>\n\n<h3>Ezekiel 28:9</h3>\n<blockquote class=\"primary-scripture\">Will you then say, \"I am a god,\" in the presence of those who kill you? You will be but a man, not a god, in the hands of those who slay you.</blockquote>\n<p>When you come face to face with barbarous soldiers see if your claim to be God will affect them. They will kill you without mercy.</p>\n\n<h3>Ezekiel 28:10</h3>\n<blockquote class=\"primary-scripture\">You will die the death of the uncircumcised at the hands of foreigners. I have spoken, declares the Sovereign LORD .' \"</blockquote>\n<p>The uncircumcised, not Jews, but foreigner will kill you. God says, “You are goanna die.” Every student of the word of God knows that when the Sovereign Lord declares something that it will not fail.</p>\n\n<h3>Ezekiel 28:11</h3>\n<blockquote class=\"primary-scripture\">The word of the LORD came to me:</blockquote>\n<p>The prophet keeps telling us that this “word” was directly from God. The Bible is unlike any book ever written. Holy men of God spake as they were moved by the Holy Ghost.</p>\n\n<h3>Ezekiel 28:12</h3>\n<blockquote class=\"primary-scripture\">\"Son of man, take up a lament concerning the king of Tyre and say to him: 'This what the Sovereign LORD says: \" 'You were the model of perfection, full of wisdom and perfect in beauty.</blockquote>\n<p>Now the prophet is instructed to taunt the king with more banter. He mocks him with the following jibe. In this taunt the prophet is merely stating the evaluation that the king had placed on himself.</p>\n\n<h3>Ezekiel 28:13</h3>\n<blockquote class=\"primary-scripture\">You were in Eden, the garden of God; every precious stone adorned you: ruby, topaz and emerald, chrysolite, onyx and jasper, sapphire, turquoise and beryl. Your settings and mountings  were made of gold; on the day you were created they were prepared.</blockquote>\n<p>We sometimes say yea ‘sure you was’! The king fancies himself as reincarnated as though he had been in Eden. This eccentric old fool has such an outlandish view of himself that God is going to show what a laughingstock he really is. He has the 9 precious stones that were on the high priest breastplate, and fancies himself as an Eden sentry guard.</p>\n\n<h3>Ezekiel 28:14</h3>\n<blockquote class=\"primary-scripture\">You were anointed as a guardian cherub, for so I ordained you. You were on the holy mount of God; you walked among the fiery stones.</blockquote>\n<p>Yes, sure you have been with the creator…yes you had access to the mountain of God and walked on beads of coals…It will be amusing when you meet face to face with your enemies. These claims that are made by the king are whimsical and ludicrous.</p>\n\n<h3>Ezekiel 28:15</h3>\n<blockquote class=\"primary-scripture\">You were blameless in your ways from the day you were created till wickedness was found in you.</blockquote>\n<p>God thru the prophet is still mocking the king who thinks of himself as perfect. As though he has been reincarnated from some angelic being in Eden’s garden.</p>\n\n<h3>Ezekiel 28:16</h3>\n<blockquote class=\"primary-scripture\">Through your widespread trade you were filled with violence, and you sinned. So I drove you in disgrace from the mount of God, and I expelled you, O guardian cherub, from among the fiery stones.</blockquote>\n<p>Wealth, greed, covetousness had led to violence and a multitude of sins, so now he is going to lose his kingdom. In scripture a mountain is often used to represent a kingdom. Like Nebuchadnezzar of old he is weighed in the balance and found light as a feather. He fancied himself as a cherub with a throne like Jehovah but all this was merely make believe. His ruin is certain and the last verse of the lament will give us the end of this bigoted, pompous, opinionated king.</p>\n\n<h3>Ezekiel 28:17</h3>\n<blockquote class=\"primary-scripture\">Your heart became proud on account of your beauty, and you corrupted your wisdom because of your splendor. So I threw you to the earth; I made a spectacle of you before kings.</blockquote>\n<p>He thought of himself as the world’s best looking man. He had a proud heart; his depraved heart blinded his mind. The song says that he is going down for the count. Kings from all the other countries will hear of his demise. This entire chapter and the two preceding it are about Tyre. This is not about someone getting thrown out of heaven but rather a king losing his life as the great city of Tyre is razed and burned.</p>\n\n<h3>Ezekiel 28:18</h3>\n<blockquote class=\"primary-scripture\">By your many sins and dishonest trade you have desecrated your sanctuaries. So I made a fire come out from you, and it consumed you, and I reduced you to ashes on the ground in the sight of all who were watching.</blockquote>\n<p>His sins and iniquities had come about with dishonest trade and the guilt had desecrated his sanctuaries. Note that he had desecrated his own sanctuaries. Not the sanctuaries of God. This verse declares that he was rotten thru and thru. Therefore, a fire will consume and devour him. Alexander the Great set his palace on fire and burned the king to the ground. He was cremated or as the scripture declares ‘reduced to ashes.’</p>\n\n<h3>Ezekiel 28:19</h3>\n<blockquote class=\"primary-scripture\">All the nations who knew you are appalled at you; you have come to a horrible end and will be no more.' \"</blockquote>\n<p>All the nations from port to port were appalled at the fate of this king. This terror stricken king was to come to an end and be no more. Note: If these verses relate to the devil then this verse declares that the devil is no more. Such theology is nothing more than high-octane nonsense.</p>",
  "faq": [
    {
      "question": "How was the prophecy against Tyre in Ezekiel fulfilled?",
      "answer": "The prophecy was fulfilled in two stages: Nebuchadnezzar destroyed the mainland city after a 13-year siege, and later Alexander the Great built a causeway to the island city, destroying it completely and scraping it clean like a 'bare rock'."
    },
    {
      "question": "What does the 'King of Tyre' represent in Ezekiel 28?",
      "answer": "The commentary interprets the King of Tyre as a historical human ruler consumed by pride, claiming to be a god. It argues against the view that this passage primarily describes Satan's fall, focusing instead on the judgment of human arrogance."
    },
    {
      "question": "Why is Tyre compared to a 'World Trade Center'?",
      "answer": "Tyre was the commercial hub of the ancient world, situated at the junction of three continents. It controlled vast trade routes and amassed immense wealth, making it a symbol of global commerce and economic power."
    },
    {
      "question": "What happened to the city of Tyre after its destruction?",
      "answer": "According to the commentary and historical accounts, ancient Tyre was never rebuilt to its former glory. The site became a place for fishermen to spread their nets, standing as a permanent testimony to the accuracy of biblical prophecy."
    }
  ],
  "structuredData": [
    {
      "@context": "https://schema.org",
      "@type": "Article",
      "headline": "Uncovering the Divine Drama of the Fall of the World Trade Center",
      "description": "Explore the detailed fulfillment of prophecies against Tyre in Ezekiel 26-28. Discover how Nebuchadnezzar and Alexander the Great brought down this ancient commercial superpower.",
      "author": {
        "@type": "Person",
        "name": "Lewis P. Hussell"
      },
      "about": [
        {
          "@type": "Place",
          "name": "Tyre",
          "description": "An ancient Phoenician port city and commercial center, the subject of Ezekiel's judgment.",
          "sameAs": "https://en.wikipedia.org/wiki/Tyre,_Lebanon"
        },
        {
          "@type": "Person",
          "name": "Alexander the Great",
          "description": "The Macedonian king who fulfilled the prophecy by building a causeway to destroy the island city of Tyre.",
          "sameAs": "https://en.wikipedia.org/wiki/Alexander_the_Great"
        },
        {
          "@type": "Person",
          "name": "Nebuchadnezzar II",
          "description": "The Babylonian king who besieged and destroyed the mainland city of Tyre.",
          "sameAs": "https://en.wikipedia.org/wiki/Nebuchadnezzar_II"
        },
        {
          "@type": "CreativeWork",
          "name": "Ezekiel"
        }
      ],
      "keywords": "Fall of Tyre prophecy, Ezekiel 26 commentary, Alexander the Great Tyre causeway, King of Tyre Ezekiel 28, Nebuchadnezzar siege of Tyre"
    },
    {
      "@context": "https://schema.org",
      "@type": "FAQPage",
      "mainEntity": [
        {
          "@type": "Question",
          "name": "How was the prophecy against Tyre in Ezekiel fulfilled?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The prophecy was fulfilled in two stages: Nebuchadnezzar destroyed the mainland city after a 13-year siege, and later Alexander the Great built a causeway to the island city, destroying it completely and scraping it clean like a 'bare rock'."
          }
        },
        {
          "@type": "Question",
          "name": "What does the 'King of Tyre' represent in Ezekiel 28?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The commentary interprets the King of Tyre as a historical human ruler consumed by pride, claiming to be a god. It argues against the view that this passage primarily describes Satan's fall, focusing instead on the judgment of human arrogance."
          }
        },
        {
          "@type": "Question",
          "name": "Why is Tyre compared to a 'World Trade Center'?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "Tyre was the commercial hub of the ancient world, situated at the junction of three continents. It controlled vast trade routes and amassed immense wealth, making it a symbol of global commerce and economic power."
          }
        },
        {
          "@type": "Question",
          "name": "What happened to the city of Tyre after its destruction?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "According to the commentary and historical accounts, ancient Tyre was never rebuilt to its former glory. The site became a place for fishermen to spread their nets, standing as a permanent testimony to the accuracy of biblical prophecy."
          }
        }
      ]
    }
  ],
  "metaDescription": "Explore the detailed fulfillment of prophecies against Tyre in Ezekiel 26-28. Discover how Nebuchadnezzar and Alexander the Great brought down this ancient commercial superpower.",
  "keywords": [
    "Fall of Tyre prophecy",
    "Ezekiel 26 commentary",
    "Alexander the Great Tyre causeway",
    "King of Tyre Ezekiel 28",
    "Nebuchadnezzar siege of Tyre",
    "Tyre world trade center"
  ]
}