{
  "book_name": "Isaiah",
  "chapter_number": "59",
  "title": "The Divine Intercessor and the Covenant of Spirit",
  "content": "<p>God’s hand was not too short nor was he hard of hearing. They had shut God out of their life and their sins had separated them from God. Their hands were dripping with blood. Their tongue was coated with lies and obscenities. They were foul mouthed and their evil deeds were like sparks that set the straw on fire. In the courts a fair trial was impossible─they bred harm and gave birth to misery.</p>\n<p>The prophet likens them to hatching snake eggs and weaving cobwebs of rottenness. They spun their evil plans like weaving a garment─theirs was a fabric of iniquity and violence. Ruin and destruction was their trademark. The leaders had wrecked and ruined their country. Their behavior was as twisted as a barbed wire fence. In their oppression they were growling like a bear and moaning like a dove─expecting justice and judgment, and redress, in the courts was as elusive as a flea on a dog’s back.</p>\n<p>Guilt was high as a mountain from this seed of evildoers. Treachery, revolt, lies, oppression was the norm. Truth was stumbling in the market place and honesty was kept out of the courts. No truth, no honesty, no mercy, and no knowledge of God in the land─the prophets had said that an honest person couldn’t be found.</p>\n<p>Evil had arose on the horizon like a raging storm and none of the leaders had intervened─so God stepped in and intervened. He put on his suit of armor─put salvation on his head─wrapped himself in jealous anger, and takes on this miserable group of sinners. Raging with fury and wreaking with anger our high God takes on the renegades. God anointed Cyrus and commissioned him to destroy Babylon. When they returned from captivity God’s spirit was with them─he put his word in their minds─it was a lamp to their feet, and a light to their path─it was to remain with them and their seed forever.</p>\n\n<h2>Unveiling the Divine Intercessor and the Covenant of Spirit</h2>\n\n<h3>Isaiah 59:1</h3>\n<blockquote class=\"primary-scripture\">Behold, the LORD's hand is not shortened, that it cannot save; neither his ear heavy, that it cannot hear:</blockquote>\n<p>God’s hand is not too short to reach out and save you. His ear is not filled with wax─he can still hear.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 50:2</strong> Wherefore, when I came, was there no man? when I called, was there none to answer? Is my hand shortened at all, that it cannot redeem? or have I no power to deliver? behold, at my rebuke I dry up the sea, I make the rivers a wilderness: their fish stinketh, because there is no water, and dieth for thirst.</li>\n<li>Read: <strong>Num 11:23; Jer 32:17</strong></li>\n</ul>\n\n<h3>Isaiah 59:2</h3>\n<blockquote class=\"primary-scripture\">But your iniquities have separated between you and your God, and your sins have hid his face from you, that he will not hear.</blockquote>\n<p>Israel had turned to other gods and their sins had caused God to turn from them.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Deu 31:17-18</strong> Then my anger shall be kindled against them in that day, and I will forsake them, and I will hide my face from them, and they shall be devoured, and many evils and troubles shall befall them; so that they will say in that day, Are not these evils come upon us, because our God is not among us? And I will surely hide my face in that day for all the evils which they shall have wrought, in that they are turned unto other gods.</li>\n</ul>\n\n<h3>Isaiah 59:3</h3>\n<blockquote class=\"primary-scripture\">For your hands are defiled with blood, and your fingers with iniquity; your lips have spoken lies, your tongue hath muttered perverseness.</blockquote>\n<p>Their hands were dripping with blood, and their fingers were filthy with guilt. Their tongue was smeared with lies and obscenities.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 1:15</strong> And when ye spread forth your hands, I will hide mine eyes from you: yea, when ye make many prayers, I will not hear: your hands are full of blood.</li>\n<li><strong>Jer 9:3-5</strong> And they bend their tongues like their bow for lies: but they are not valiant for the truth upon the earth; for they proceed from evil to evil, and they know not me, saith the LORD. Take ye heed every one of his neighbour, and trust ye not in any brother: for every brother will utterly supplant, and every neighbour will walk with slanders. And they will deceive every one his neighbour, and will not speak the truth: they have taught their tongue to speak lies, and weary themselves to commit iniquity.</li>\n</ul>\n\n<h3>Isaiah 59:4</h3>\n<blockquote class=\"primary-scripture\">None calleth for justice, nor any pleadeth for truth: they trust in vanity, and speak lies; they conceive mischief, and bring forth iniquity.</blockquote>\n<p>A fair trial was impossible─lawsuits based on lies. They spent their time on plotting evil deeds─they bred harm and gave birth to misery.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Eze 22:29-31</strong> The people of the land have used oppression, and exercised robbery, and have vexed the poor and needy: yea, they have oppressed the stranger wrongfully. And I sought for a man among them, that should make up the hedge, and stand in the gap before me for the land, that I should not destroy it: but I found none. Therefore have I poured out mine indignation upon them; I have consumed them with the fire of my wrath: their own way have I recompensed upon their heads, saith the Lord GOD.</li>\n<li><strong>Psa 62:4</strong> They only consult to cast him down from his excellency: they delight in lies: they bless with their mouth, but they curse inwardly. Selah.</li>\n</ul>\n\n<h3>Isaiah 59:5</h3>\n<blockquote class=\"primary-scripture\">They hatch cockatrice' eggs, and weave the spider's web: he that eateth of their eggs dieth, and that which is crushed breaketh out into a viper.</blockquote>\n<p>They hatch snake eggs and weave cobwebs. They were rotten eggs and brought forth only rottenness. They spin evil plans that span deadly actions.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 14:29</strong> Rejoice not thou, whole Palestina, because the rod of him that smote thee is broken: for out of the serpent's root shall come forth a cockatrice, and his fruit shall be a fiery flying serpent.</li>\n<li><strong>Mat 3:7</strong> But when he saw many of the Pharisees and Sadducees come to his baptism, he said unto them, O generation of vipers, who hath warned you to flee from the wrath to come?</li>\n<li><strong>Mat 12:34</strong> O generation of vipers, how can ye, being evil, speak good things? for out of the abundance of the heart the mouth speaketh.</li>\n</ul>\n\n<h3>Isaiah 59:6</h3>\n<blockquote class=\"primary-scripture\">Their webs shall not become garments, neither shall they cover themselves with their works: their works are works of iniquity, and the act of violence is in their hands.</blockquote>\n<p>They spent their time figuring out how to short change someone─they spun evil plans like a garment─the fabric they wore was the fabric of inequity─their hands were busy with deeds of violence─they had spider webs of plots to catch innocent victims.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Job 8:14</strong> Whose hope shall be cut off, and whose trust shall be a spider's web.</li>\n<li><strong>Isa 64:6</strong> But we are all as an unclean thing, and all our righteousnesses are as filthy rags; and we all do fade as a leaf; and our iniquities, like the wind, have taken us away.</li>\n<li><strong>Gen 6:11</strong> The earth also was corrupt before God, and the earth was filled with violence.</li>\n</ul>\n\n<h3>Isaiah 59:7</h3>\n<blockquote class=\"primary-scripture\">Their feet run to evil, and they make haste to shed innocent blood: their thoughts are thoughts of iniquity; wasting and destruction are in their paths.</blockquote>\n<p>Everything they did left a trail of blood and violence─ruin and destruction was their trademark.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Pro 1:16</strong> For their feet run to evil, and make haste to shed blood.</li>\n<li><strong>Eze 9:9</strong> Then said he unto me, The iniquity of the house of Israel and Judah is exceeding great, and the land is full of blood, and the city full of perverseness: for they say, The LORD hath forsaken the earth, and the LORD seeth not.</li>\n<li><strong>Eze 22:6</strong> Behold, the princes of Israel, every one were in thee to their power to shed blood.</li>\n</ul>\n\n<h3>Isaiah 59:8</h3>\n<blockquote class=\"primary-scripture\">The way of peace they know not; and there is no judgment in their goings: they have made them crooked paths: whosoever goeth therein shall not know peace.</blockquote>\n<p>They run headlong into crime─they were a wreck and ruin crew. Their track record was ruin-ruin-ruin. Anyone who follows their example won’t experience peace either. Their behavior was as twisted as the coils of a bed spring.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Pro 3:17</strong> Her ways are ways of pleasantness, and all her paths are peace.</li>\n<li><strong>Jer 5:1</strong> Run ye to and fro through the streets of Jerusalem, and see now, and know, and seek in the broad places thereof, if ye can find a man, if there be any that executeth judgment, that seeketh the truth; and I will pardon it.</li>\n<li><strong>Isa 48:22</strong> There is no peace, saith the LORD, unto the wicked.</li>\n</ul>\n\n<h3>Isaiah 59:9</h3>\n<blockquote class=\"primary-scripture\">Therefore is judgment far from us, neither doth justice overtake us: we wait for light, but behold obscurity; for brightness, but we walk in darkness.</blockquote>\n<p>No wonder they waited for light but found only darkness. They walked only in gloom─wrongs were never righted─no redress at the courts, because justice was hiding in the shadows.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Lam 5:16-17</strong> The crown is fallen from our head: woe unto us, that we have sinned! For this our heart is faint; for these things our eyes are dim.</li>\n<li><strong>Jer 14:19</strong> Hast thou utterly rejected Judah? hath thy soul lothed Zion? why hast thou smitten us, and there is no healing for us? we looked for peace, and there is no good; and for the time of healing, and behold trouble!</li>\n</ul>\n\n<h3>Isaiah 59:10</h3>\n<blockquote class=\"primary-scripture\">We grope for the wall like the blind, and we grope as if we had no eyes: we stumble at noon day as in the night; we are in desolate places as dead men.</blockquote>\n<p>Groping like a blind man with a cane dragging along the wall─stumbling at midday like it was midnight. You act like a corpse instead of vigorous young men. They were living in a dark hole of injustice.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Deu 28:29</strong> And thou shalt grope at noonday, as the blind gropeth in darkness, and thou shalt not prosper in thy ways: and thou shalt be only oppressed and spoiled evermore, and no man shall save thee.</li>\n<li><strong>Lam 3:6</strong> He hath set me in dark places, as they that be dead of old.</li>\n</ul>\n\n<h3>Isaiah 59:11</h3>\n<blockquote class=\"primary-scripture\">We roar all like bears, and mourn sore like doves: we look for judgment, but there is none; for salvation, but it is far off from us.</blockquote>\n<p>In their oppression they growled like bears, and moaned like doves; expecting justice and judgment─hoping somehow to be righted but it was all in vain─we look for redress but it remains as elusive as a flea on a dog’s back.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Hos 7:14</strong> And they have not cried unto me with their heart, when they howled upon their beds: they assemble themselves for corn and wine, and they rebel against me.</li>\n<li><strong>Isa 38:14</strong> Like a crane or a swallow, so did I chatter: I did mourn as a dove: mine eyes fail with looking upward: O LORD, I am oppressed; undertake for me.</li>\n<li><strong>Jer 9:1</strong> Oh that my head were waters, and mine eyes a fountain of tears, that I might weep day and night for the slain of the daughter of my people!</li>\n</ul>\n\n<h3>Isaiah 59:12</h3>\n<blockquote class=\"primary-scripture\">For our transgressions are multiplied before thee, and our sins testify against us: for our transgressions are with us; and as for our iniquities, we know them;</blockquote>\n<p>They knew that their sins had come before God and were multiplied─these acts of rebellion were beyond counting─guilt kept mounting and shame was on every side. Isaiah calls them “the seed of evildoers.”</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Dan 9:5-8</strong> We have sinned, and have committed iniquity, and have done wickedly, and have rebelled, even by departing from thy precepts and from thy judgments: Neither have we hearkened unto thy servants the prophets, which spake in thy name to our kings, our princes, and our fathers, and to all the people of the land. O Lord, righteousness belongeth unto thee, but unto us confusion of faces, as at this day; to the men of Judah, and to the inhabitants of Jerusalem, and unto all Israel, that are near, and that are far off, through all the countries whither thou hast driven them, because of their trespass that they have trespassed against thee. O Lord, to us belongeth confusion of face, to our kings, to our princes, and to our fathers, because we have sinned against thee.</li>\n</ul>\n\n<h3>Isaiah 59:13</h3>\n<blockquote class=\"primary-scripture\">In transgressing and lying against the LORD, and departing away from our God, speaking oppression and revolt, conceiving and uttering from the heart words of falsehood.</blockquote>\n<p>They had denied the LORD their God and were guilty of rebellion, treachery, revolt, and oppression. They conceived lies in their hearts.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 32:6</strong> For the vile person will speak villany, and his heart will work iniquity, to practise hypocrisy, and to utter error against the LORD, to make empty the soul of the hungry, and he will cause the drink of the thirsty to fail.</li>\n<li><strong>Psa 78:36</strong> Nevertheless they did flatter him with their mouth, and they lied unto him with their tongues.</li>\n<li><strong>Jer 9:5</strong> And they will deceive every one his neighbour, and will not speak the truth: they have taught their tongue to speak lies, and weary themselves to commit iniquity.</li>\n</ul>\n\n<h3>Isaiah 59:14</h3>\n<blockquote class=\"primary-scripture\">And judgment is turned away backward, and justice standeth afar off: for truth is fallen in the street, and equity cannot enter.</blockquote>\n<p>The wise man Solomon tells what he seen in the courts of his kingdom, “I saw under the sun the place of judgment that wickedness was there. And the place of righteousness that iniquity was there.” Ecc. 3:16. Justice was rebuffed and flouted─truth was stumbling in the market place─honesty was kept out of the courts. The place where one would expect righteousness was outlawed─equity was dead in the streets. Honesty was sidelined and good was missing in action─if you opposed the leaders you would be beaten and robbed.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 5:23</strong> Which justify the wicked for reward, and take away the righteousness of the righteous from him!</li>\n<li><strong>Psa 82:2-5</strong> How long will ye judge unjustly, and accept the persons of the wicked? Selah. Defend the poor and fatherless: do justice to the afflicted and needy. Deliver the poor and needy: rid them out of the hand of the wicked. They know not, neither will they understand; they walk on in darkness: all the foundations of the earth are out of course.</li>\n<li><strong>Ecc 3:16</strong> And moreover I saw under the sun the place of judgment, that wickedness was there; and the place of righteousness, that iniquity was there.</li>\n</ul>\n\n<h3>Isaiah 59:15</h3>\n<blockquote class=\"primary-scripture\">Yea, truth faileth; and he that departeth from evil maketh himself a prey: and the LORD saw it, and it displeased him that there was no judgment.</blockquote>\n<p>No truth, no honesty, no mercy, no knowledge of God in the land. Perhaps the prophet Jeremiah says it best, “if you can find a man, if there be any that executeth judgment, that seeketh the truth; and I will pardon it.” God seen that there was no steps being taken to correct this injustice.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Jer 5:1</strong> Run ye to and fro through the streets of Jerusalem, and see now, and know, and seek in the broad places thereof, if ye can find a man, if there be any that executeth judgment, that seeketh the truth; and I will pardon it.</li>\n<li><strong>Hos 4:1</strong> Hear the word of the LORD, ye children of Israel: for the LORD hath a controversy with the inhabitants of the land, because there is no truth, nor mercy, nor knowledge of God in the land.</li>\n</ul>\n\n<h3>Isaiah 59:16</h3>\n<blockquote class=\"primary-scripture\">And he saw that there was no man, and wondered that there was no intercessor: therefore his arm brought salvation unto him; and his righteousness, it sustained him.</blockquote>\n<p>Evil had arose on the horizon like a raging storm and not a soul around to correct the condition. God saw that no one intervened─no one stepped up to the plate. The situation was appalling yet no one intervened. So, God stepped in and intervened.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 64:7</strong> And there is none that calleth upon thy name, that stirreth up himself to take hold of thee: for thou hast hid thy face from us, and hast consumed us, because of our iniquities.</li>\n<li><strong>Eze 22:30</strong> And I sought for a man among them, that should make up the hedge, and stand in the gap before me for the land, that I should not destroy it: but I found none.</li>\n</ul>\n\n<h3>Isaiah 59:17</h3>\n<blockquote class=\"primary-scripture\">For he put on righteousness as a breastplate, and an helmet of salvation upon his head; and he put on the garments of vengeance for clothing, and was clad with zeal as a cloak.</blockquote>\n<p>God put on his best suit and took on the fight. He put on righteousness like a suit of armor─he wrapped himself in jealous anger─and put a wrap of passion on his shoulders and in his mighty power he takes on this miserable group of sinners.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 11:5</strong> And righteousness shall be the girdle of his loins, and faithfulness the girdle of his reins.</li>\n<li><strong>Job 29:14</strong> I put on righteousness, and it clothed me: my judgment was as a robe and a diadem.</li>\n<li><strong>Joh 2:17</strong> And his disciples remembered that it was written, The zeal of thine house hath eaten me up.</li>\n</ul>\n\n<h3>Isaiah 59:18</h3>\n<blockquote class=\"primary-scripture\">According to their deeds, accordingly he will repay, fury to his adversaries, recompence to his enemies; to the islands he will repay recompence.</blockquote>\n<p>Raging in his fury God is going to repay his adversaries. He is reeking with anger and reprisals are in the works. This high God of ours is going to bring retribution to his enemies─no one will be too far off to avoid his due.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 63:6</strong> And I will tread down the people in mine anger, and make them drunk in my fury, and I will bring down their strength to the earth.</li>\n<li><strong>Isa 49:26</strong> And I will feed them that oppress thee with their own flesh; and they shall be drunken with their own blood, as with sweet wine: and all flesh shall know that I the LORD am thy Saviour and thy Redeemer, the mighty One of Jacob.</li>\n<li><strong>Lam 4:11</strong> The LORD hath accomplished his fury; he hath poured out his fierce anger, and hath kindled a fire in Zion, and it hath devoured the foundations thereof.</li>\n</ul>\n\n<h3>Isaiah 59:19</h3>\n<blockquote class=\"primary-scripture\">So shall they fear the name of the LORD from the west, and his glory from the rising of the sun. When the enemy shall come in like a flood, the Spirit of the LORD shall lift up a standard against him.</blockquote>\n<p>When God sent Cyrus and knocked off Babylon it sent shock waves to all the nations─Cyrus came like a raging floodtide─the spirit of the LORD was in Cyrus and spurred him on like a Texas tornado.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 49:12</strong> Behold, these shall come from far: and, lo, these from the north and from the west; and these from the land of Sinim. Read: <strong>Isa 66:18-20</strong></li>\n</ul>\n\n<h3>Isaiah 59:20</h3>\n<blockquote class=\"primary-scripture\">And the Redeemer shall come to Zion, and unto them that turn from transgression in Jacob, saith the LORD.</blockquote>\n<p>God says that he is coming to Zion and all who turn from their transgressions will be delivered by their redeemer.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Oba 1:17-21</strong> But upon mount Zion shall be deliverance, and there shall be holiness; and the house of Jacob shall possess their possessions. And the house of Jacob shall be a fire, and the house of Joseph a flame, and the house of Esau for stubble, and they shall kindle in them, and devour them; and there shall not be any remaining of the house of Esau; for the LORD hath spoken it. And they of the south shall possess the mount of Esau; and they of the plain the Philistines: and they shall possess the fields of Ephraim, and the fields of Samaria: and Benjamin shall possess Gilead. And the captivity of this host of the children of Israel shall possess that of the Canaanites, even unto Zarephath; and the captivity of Jerusalem, which is in Sepharad, shall possess the cities of the south. And saviours shall come up on mount Zion to judge the mount of Esau; and the kingdom shall be the LORD'S.</li>\n</ul>\n\n<h3>Isaiah 59:21</h3>\n<blockquote class=\"primary-scripture\">As for me, this is my covenant with them, saith the LORD; My spirit that is upon thee, and my words which I have put in thy mouth, shall not depart out of thy mouth, nor out of the mouth of thy seed, nor out of the mouth of thy seed's seed, saith the LORD, from henceforth and for ever.</blockquote>\n<p>When they returned from captivity God’s spirit was upon them─he put his word in their mouth─this word was a lamp to their feet and a light to their path. They were to live by every word that came from the mouth of God─it was to remain with them and their seed forever.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Eze 37:24-26</strong> And David my servant shall be king over them; and they all shall have one shepherd: they shall also walk in my judgments, and observe my statutes, and do them. And they shall dwell in the land that I have given unto Jacob my servant, wherein your fathers have dwelt; and they shall dwell therein, even they, and their children, and their children's children for ever: and my servant David shall be their prince for ever. Moreover I will make a covenant of peace with them; it shall be an everlasting covenant with them: and I will place them, and multiply them, and will set my sanctuary in the midst of them for evermore.</li>\n</ul>",
  "faq": [
    {
      "question": "What imagery is used to describe the people's evil plans?",
      "answer": "The commentary likens their plans to hatching cockatrice (snake) eggs and weaving spider webs, signifying that their works produce only rottenness and violence."
    },
    {
      "question": "Why did God intervene personally according to the text?",
      "answer": "God intervened because He saw that truth was stumbling in the marketplace and there was no intercessor to correct the injustice, so His own arm brought salvation."
    },
    {
      "question": "How is God described when He prepares for vengeance?",
      "answer": "He is described as putting on a suit of armor: righteousness as a breastplate, salvation as a helmet, garments of vengeance for clothing, and zeal as a cloak."
    },
    {
      "question": "Who was commissioned to destroy Babylon?",
      "answer": "God anointed Cyrus and commissioned him to destroy Babylon, spurring him on like a 'Texas tornado' to execute judgment."
    }
  ],
  "structuredData": [
    {
      "@context": "https://schema.org",
      "@type": "Article",
      "headline": "The Divine Intercessor and the Covenant of Spirit",
      "description": "God’s hand is not short, but sin separated Him from the people. With truth fallen in the streets and no intercessor found, the Lord put on armor to bring salvation.",
      "author": {
        "@type": "Person",
        "name": "Lewis P. Hussell"
      },
      "about": [
        {
          "@type": "Person",
          "name": "Cyrus",
          "description": "Anointed by God to destroy Babylon and act as a raging floodtide against the enemy.",
          "sameAs": "https://en.wikipedia.org/wiki/Cyrus_the_Great"
        },
        {
          "@type": "Place",
          "name": "Zion",
          "description": "The location where the Redeemer shall come to deliver those who turn from transgression.",
          "sameAs": "https://en.wikipedia.org/wiki/Zion"
        },
        {
          "@type": "Concept",
          "name": "Intercessor",
          "description": "The role God assumes when He sees that no man is available to correct injustice.",
          "sameAs": "https://en.wikipedia.org/wiki/Intercession"
        },
        {
          "@type": "Thing",
          "name": "Covenant",
          "description": "God's promise that His spirit and word will remain with the people and their seed forever.",
          "sameAs": "https://en.wikipedia.org/wiki/Covenant_(biblical)"
        },
        {
          "@type": "CreativeWork",
          "name": "Isaiah"
        },
        {
          "@type": "CreativeWork",
          "name": "Chapter 59"
        }
      ],
      "keywords": "God as divine intercessor, Sin as separation from God, God's suit of armor, Truth fallen in the street, Covenant of Spirit and Word, Weaving spider's webs of iniquity, Cyrus as God's raging floodtide"
    },
    {
      "@context": "https://schema.org",
      "@type": "FAQPage",
      "mainEntity": [
        {
          "@type": "Question",
          "name": "What imagery is used to describe the people's evil plans?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The commentary likens their plans to hatching cockatrice (snake) eggs and weaving spider webs, signifying that their works produce only rottenness and violence."
          }
        },
        {
          "@type": "Question",
          "name": "Why did God intervene personally according to the text?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "God intervened because He saw that truth was stumbling in the marketplace and there was no intercessor to correct the injustice, so His own arm brought salvation."
          }
        },
        {
          "@type": "Question",
          "name": "How is God described when He prepares for vengeance?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "He is described as putting on a suit of armor: righteousness as a breastplate, salvation as a helmet, garments of vengeance for clothing, and zeal as a cloak."
          }
        },
        {
          "@type": "Question",
          "name": "Who was commissioned to destroy Babylon?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "God anointed Cyrus and commissioned him to destroy Babylon, spurring him on like a 'Texas tornado' to execute judgment."
          }
        }
      ]
    },
    {
      "@context": "https://schema.org",
      "@type": "BreadcrumbList",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://4thewordofgod.com/"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Commentaries",
          "item": "https://4thewordofgod.com/commentaries/"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Isaiah",
          "item": "https://4thewordofgod.com/commentaries/isaiah"
        },
        {
          "@type": "ListItem",
          "position": 4,
          "name": "Chapter 59",
          "item": "https://4thewordofgod.com/commentaries/isaiah/59"
        }
      ]
    }
  ],
  "metaDescription": "God’s hand is not short, but sin separated Him from the people. With truth fallen in the streets and no intercessor found, the Lord put on armor to bring salvation.",
  "keywords": [
    "God as divine intercessor",
    "Sin as separation from God",
    "God's suit of armor",
    "Truth fallen in the street",
    "Covenant of Spirit and Word",
    "Weaving spider's webs of iniquity",
    "Cyrus as God's raging floodtide"
  ],
  "previous_chapter": "isaiah_58",
  "next_chapter": "isaiah_60"
}