{
  "book_name": "Isaiah",
  "chapter_number": "28",
  "title": "The Sure Foundation and the Covenant with Death",
  "content": "<p>The prophet has a word for these beer-bellied winesops&#9472;someone tough is going to flatten their city. Priest and prophet alike were staggering under the influence&#9472;so besot with wine and strong drink that they can&#8217;t think straight or talk sense&#9472;living in their vomit they mock the prophet as a father trying to teach his children to talk. They are warned about being mockers and then he turns to the Stone that will be laid in Zion. The leaders of Zion will make a covenant with Hell and an agreement with death&#9472;all of this will be annulled by the Resurrection of Jesus. Keep reading for more information.</p>\n\n<h2>Examining the Sure Foundation and Covenant with Death</h2>\n\n<h3>Isaiah 28:1</h3>\n<blockquote class=\"primary-scripture\">Woe to the crown of pride, to the drunkards of Ephraim, whose glorious beauty is a fading flower, which are on the head of the fat valleys of them that are overcome with wine!</blockquote>\n<p>Ancient Samaria was situated on the top of a hill, and surrounded with a rich valley, and then a circle of other hills around it, looking down from the hill top to the surrounding valleys it looked like a wreath of flowers. Whoredoom and men lying drunk in the streets was an everyday occurrence.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Hos 6:10:</strong> I have seen an horrible thing in the house of Israel: there <em>is</em> the whoredom of Ephraim, Israel is defiled.</li>\n<li><strong>Hos 4:11:</strong> Whoredom and wine and new wine take away the heart.</li>\n<li><strong>Amo 2:8:</strong> And they lay <em>themselves</em> down upon clothes laid to pledge by every altar, and they drink the wine of the condemned <em>in</em> the house of their god.</li>\n</ul>\n\n<h3>Isaiah 28:2</h3>\n<blockquote class=\"primary-scripture\">Behold, the Lord hath a mighty and strong one, which as a tempest of hail and a destroying storm, as a flood of mighty waters overflowing, shall cast down to the earth with the hand.</blockquote>\n<p>The Lord is going to send his agent (Assyria) to batter down the city of Samaria&#9472;it will be like a mighty hailstorm or a surging flood&#9472;He will send a hurricane of havoc and their crown will fall from their head&#9472;when God finishes with them they will be beaten to the ground.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 9:9-12:</strong> And all the people shall know, <em>even</em> Ephraim and the inhabitant of Samaria, that say in the pride and stoutness of heart, The bricks are fallen down, but we will build with hewn stones: the sycomores are cut down, but we will change <em>them into</em> cedars. Therefore the LORD shall set up the adversaries of Rezin against him, and join his enemies together; The Syrians before, and the Philistines behind; and they shall devour Israel with open mouth. For all this his anger is not turned away, but his hand <em>is</em> stretched out still.</li>\n</ul>\n\n<h3>Isaiah 28:3</h3>\n<blockquote class=\"primary-scripture\">The crown of pride, the drunkards of Ephraim, shall be trodden under feet:</blockquote>\n<p>When Assyria finishes with them they will be hurled to the ground and tromped on by her mighty armed forces.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Lam 1:15:</strong> The Lord hath trodden under foot all my mighty <em>men</em> in the midst of me: he hath called an assembly against me to crush my young men: the Lord hath trodden the virgin, the daughter of Judah, <em>as</em> in a winepress.</li>\n<li><strong>Heb 10:29:</strong> Of how much sorer punishment, suppose ye, shall he be thought worthy, who hath trodden under foot the Son of God, and hath counted the blood of the covenant, wherewith he was sanctified, an unholy thing, and hath done despite unto the Spirit of grace?</li>\n</ul>\n\n<h3>Isaiah 28:4</h3>\n<blockquote class=\"primary-scripture\">And the glorious beauty, which is on the head of the fat valley, shall be a fading flower, and as the hasty fruit before the summer; which when he that looketh upon it seeth, while it is yet in his hand he eateth it up.</blockquote>\n<p>Samaria will look like a fading rose in late fall&#9472;her lush valleys and farm land will all be snatched away like an early fig is gobbled up before the season comes.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Mic 7:1:</strong> Woe is me! for I am as when they have gathered the summer fruits, as the grapegleanings of the vintage: <em>there is</em> no cluster to eat: my soul desired the firstripe fruit.</li>\n<li><strong>Hos 9:10,11,16</strong></li>\n</ul>\n\n<h3>Isaiah 28:5</h3>\n<blockquote class=\"primary-scripture\">In that day shall the LORD of hosts be for a crown of glory, and for a diadem of beauty, unto the residue of his people,</blockquote>\n<p>To the people who are left God himself will be their crown of glory&#9472;a royal diadem in his hand. The once forsaken land will be called Beulah land&#9472;the land will be married. Generations later when the Gentiles were called and kings saw the righteousness of God and his people were called by a new name (Christians) this scripture met its fulfillment. See Isaiah sixty two for a full description.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 62:3-4:</strong> Thou shalt also be a crown of glory in the hand of the LORD, and a royal diadem in the hand of thy God. Thou shalt no more be termed Forsaken; neither shall thy land any more be termed Desolate: but thou shalt be called Hephzibah, and thy land Beulah: for the LORD delighteth in thee, and thy land shall be married.</li>\n</ul>\n\n<h3>Isaiah 28:6</h3>\n<blockquote class=\"primary-scripture\">And for a spirit of judgment to him that sitteth in judgment, and for strength to them that turn the battle to the gate.</blockquote>\n<p>He will give those who sit in the halls of justice a longing for justice and the brave and courageous soldiers who fight the battle and turn the tide in their favor at the gate or entrance to the city.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 32:15-16:</strong> Until the spirit be poured upon us from on high, and the wilderness be a fruitful field, and the fruitful field be counted for a forest. Then judgment shall dwell in the wilderness, and righteousness remain in the fruitful field.</li>\n<li><strong>Num 11:17; 1Ki 3:28</strong></li>\n</ul>\n\n<h3>Isaiah 28:7</h3>\n<blockquote class=\"primary-scripture\">But they also have erred through wine, and through strong drink are out of the way; the priest and the prophet have erred through strong drink, they are swallowed up of wine, they are out of the way through strong drink; they err in vision, they stumble in judgment.</blockquote>\n<p>Priest&#9472;prophet&#9472;judges have erred through strong drink&#9472;they are overpowered by alcohol&#9472;they stagger in their vomit&#9472;befuddled with liquor they make stupid errors and mistakes. These rulers were &#8220;out of the game&#8221; they were like an impotent old man unfit to rule. They were so swallowed up of wine that they were paralyzed and unqualified to rule.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 56:12:</strong> Come ye, <em>say they,</em> I will fetch wine, and we will fill ourselves with strong drink; and to morrow shall be as this day, <em>and</em> much more abundant.</li>\n<li><strong>Lev 10:9-10:</strong> Do not drink wine nor strong drink, thou, nor thy sons with thee, when ye go into the tabernacle of the congregation, lest ye die: <em>it shall be</em> a statute for ever throughout your generations: And that ye may put difference between holy and unholy, and between unclean and clean; princes eat in due season, for strength, and not for drunkenness!</li>\n<li><strong>Eze 44:21:</strong> Neither shall any priest drink wine, when they enter into the inner court.</li>\n<li><strong>Hos 4:11:</strong> Whoredom and wine and new wine take away the heart.</li>\n<li><strong>Mic 2:11:</strong> If a man walking in the spirit and falsehood do lie, <em>saying,</em> I will prophesy unto thee of wine and of strong drink; he shall even be the prophet of this people.</li>\n<li><strong>Psa 107:27:</strong> They reel to and fro, and stagger like a drunken man, and are at their wits' end.</li>\n</ul>\n\n<h3>Isaiah 28:8</h3>\n<blockquote class=\"primary-scripture\">For all tables are full of vomit and filthiness, so that there is no place clean.</blockquote>\n<p>Priest has vomited on the sacred tables and judges in their chambers&#9472;the smell and stench of vomit is everywhere.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Jer 48:26:</strong> Make ye him drunken: for he magnified <em>himself</em> against the LORD: Moab also shall wallow in his vomit, and he also shall be in derision.</li>\n<li><strong>Hab 2:15-16</strong></li>\n</ul>\n\n<h3>Isaiah 28:9</h3>\n<blockquote class=\"primary-scripture\">Whom shall he teach knowledge? and whom shall he make to understand doctrine? them that are weaned from the milk, and drawn from the breasts.</blockquote>\n<p>These drunkards mock Isaiah by asking him if he thinks that they are babies just weaned from the milk&#9472;a child was weaned between the ages of two and five.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>1Pe 2:2:</strong> As newborn babes, desire the sincere milk of the word, that ye may grow thereby:</li>\n<li><strong>Mat 11:25:</strong> At that time Jesus answered and said, I thank thee, O Father, Lord of heaven and earth, because thou hast hid these things from the wise and prudent, and hast revealed them unto babes.</li>\n</ul>\n\n<h3>Isaiah 28:10</h3>\n<blockquote class=\"primary-scripture\">For precept must be upon precept, precept upon precept; line upon line, line upon line; here a little, and there a little:</blockquote>\n<p>Just like a teaching a child&#9472;over and over again&#9472;Da,da,da,da,blah,blah,blah,blah. That&#8217;s a good girl&#8230;that&#8217;s a good boy. Here a little, and there a little.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Jer 25:3-8:</strong> From the thirteenth year of Josiah the son of Amon king of Judah, even unto this day, that <em>is</em> the three and twentieth year, the word of the LORD hath come unto me, and I have spoken unto you, rising early and speaking; but ye have not hearkened. And the LORD hath sent unto you all his servants the prophets, rising early and sending <em>them;</em> but ye have not hearkened, nor inclined your ear to hear. They said, Turn ye again now every one from his evil way, and from the evil of your doings, and dwell in the land that the LORD hath given unto you and to your fathers for ever and ever: And go not after other gods to serve them, and to worship them, and provoke me not to anger with the works of your hands; and I will do you no hurt. Yet ye have not hearkened unto me, saith the LORD; that ye might provoke me to anger with the works of your hands to your own hurt. Therefore thus saith the LORD of hosts; Because ye have not heard my words,</li>\n</ul>\n\n<h3>Isaiah 28:11</h3>\n<blockquote class=\"primary-scripture\">For with stammering lips and another tongue will he speak to this people.</blockquote>\n<p>When they hear the Assyrian oppressors speaking it will sound like a baby talking to them&#9472;one syllable at a time&#9472;just like a parent trying to teach their children to understand.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Deu 28:49:</strong> The LORD shall bring a nation against thee from far, from the end of the earth, <em>as swift</em> as the eagle flieth; a nation whose tongue thou shalt not understand;</li>\n<li><strong>Jer 5:15; 1Co 14:21</strong></li>\n</ul>\n\n<h3>Isaiah 28:12</h3>\n<blockquote class=\"primary-scripture\">To whom he said, This is the rest wherewith ye may cause the weary to rest; and this is the refreshing: yet they would not hear.</blockquote>\n<p>He had told them that this is the place for weary souls to rest&#9472;they wouldn&#8217;t listen&#9472;they could have laid their burdens down and had rest in Beulah land but they wouldn&#8217;t hearken.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>2Ch 14:11:</strong> And Asa cried unto the LORD his God, and said, LORD, <em>it is</em> nothing with thee to help, whether with many, or with them that have no power: help us, O LORD our God; for we rest on thee, and in thy name we go against this multitude. O LORD, thou <em>art</em> our God; let not man prevail against thee.</li>\n<li><strong>Jer 6:16; Psa 81:11</strong></li>\n</ul>\n\n<h3>Isaiah 28:13</h3>\n<blockquote class=\"primary-scripture\">But the word of the LORD was unto them precept upon precept, precept upon precept; line upon line, line upon line; here a little, and there a little; that they might go, and fall backward, and be broken, and snared, and taken.</blockquote>\n<p>They didn&#8217;t like the word of God from their religious teachers so now they are getting a form of discipline from their foreign oppressors who will be teaching them their form of morals.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Hos 8:12:</strong> I have written to him the great things of my law, <em>but</em> they were counted as a strange thing.</li>\n<li><strong>Jer 23:36-39; Isa 6:9-10; Rom 11:9</strong></li>\n</ul>\n\n<h3>Isaiah 28:14</h3>\n<blockquote class=\"primary-scripture\">Wherefore hear the word of the LORD, ye scornful men, that rule this people which is in Jerusalem.</blockquote>\n<p>They were not only drunkards and fools but they are scornful men who mock the word of God&#9472;they have nothing but disdain and contempt for religion.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Pro 29:8:</strong> Scornful men bring a city into a snare: but wise <em>men</em> turn away wrath.</li>\n<li><strong>Hos 7:5:</strong> In the day of our king the princes have made <em>him</em> sick with bottles of wine; he stretched out his hand with scorners.</li>\n<li><strong>Isa 1:10; Pro 1:22; Act 13:41</strong></li>\n</ul>\n\n<h3>Isaiah 28:15</h3>\n<blockquote class=\"primary-scripture\">Because ye have said, We have made a covenant with death, and with hell are we at agreement; when the overflowing scourge shall pass through, it shall not come unto us: for we have made lies our refuge, and under falsehood have we hid ourselves:</blockquote>\n<p>They had made a bargain with death&#9472;sold themselves to the Devil&#9472;but the overflowing scourge (Assyria) will pass through&#9472;their cover-up would be exposed. It looked like they had covered all the bases&#9472;thought of everything&#9472;sought the best advice of the experts&#9472;all set&#9472;hid from everything except God!</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Jer 5:31:</strong> The prophets prophesy falsely, and the priests bear rule by their means; and my people love <em>to have it</em> so: and what will ye do in the end thereof?</li>\n<li><strong>Jer 14:13:</strong> Then said I, Ah, Lord GOD! behold, the prophets say unto them, Ye shall not see the sword, neither shall ye have famine; but I will give you assured peace in this place.</li>\n<li><strong>Jer 44:17; Eze 8:12; Eze 13:22; Amo 2:4</strong></li>\n</ul>\n\n<h3>Isaiah 28:16</h3>\n<blockquote class=\"primary-scripture\">Therefore thus saith the Lord GOD, Behold, I lay in Zion for a foundation a stone, a tried stone, a precious corner stone, a sure foundation: he that believeth shall not make haste.</blockquote>\n<p>In answer to all of this the Lord says that a granite corner stone&#8212;the sure foundation of justice and faith will be laid in Zion and all who believe in it shall not be ashamed. If you trust in Jesus your life won&#8217;t topple. Trusting in a shantytown of lies and evolution will result in a flash flood washing you into destruction.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Psa 118:22:</strong> The stone <em>which</em> the builders refused is become the head <em>stone</em> of the corner.</li>\n<li><strong>Mat 21:42:</strong> Jesus saith unto them, Did ye never read in the scriptures, The stone which the builders rejected, the same is become the head of the corner: this is the Lord's doing, and it is marvellous in our eyes?</li>\n<li><strong>Act 4:11-12:</strong> This is the stone which was set at nought of you builders, which is become the head of the corner.</li>\n<li><strong>1Co 3:11:</strong> For other foundation can no man lay than that is laid, which is Jesus Christ.</li>\n<li><strong>Eph 2:20; 1Pe 2:6</strong></li>\n</ul>\n\n<h3>Isaiah 28:17</h3>\n<blockquote class=\"primary-scripture\">Judgment also will I lay to the line, and righteousness to the plummet: and the hail shall sweep away the refuge of lies, and the waters shall overflow the hiding place.</blockquote>\n<p>Jesus uses a level and a plum line to straighten things out&#9472;he is sweeping away the refuge of lies that people have trusted in and exposed their hiding place. Justice is his measuring tape which is squared and true. If you trust in him your life will not be shaken.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>2Ki 21:13:</strong> And I will stretch over Jerusalem the line of Samaria, and the plummet of the house of Ahab: and I will wipe Jerusalem as <em>a man</em> wipeth a dish, wiping <em>it,</em> and turning <em>it</em> upside down.</li>\n<li><strong>Amo 7:7:</strong> Thus he shewed me: and, behold, the Lord stood upon a wall <em>made</em> by a plumbline, with a plumbline in his hand.</li>\n</ul>\n\n<h3>Isaiah 28:18</h3>\n<blockquote class=\"primary-scripture\">And your covenant with death shall be disannulled, and your agreement with hell shall not stand; when the overflowing scourge shall pass through, then ye shall be trodden down by it.</blockquote>\n<p>Here are some things that were to occur before the foundation stone was laid. 1. They were to make a covenant with death. 2. Their agreement with hell (sheol A.S.V.) shall not stand. 3. They were to make lies their refuge. 4. They would hide under falsehood. Let&#8217;s take a look at what happened when they made a bargain with death and how it was cancelled&#8212;how it was swept away like a flash flood. The Jews covenanted with Judas to betray Jesus. Mt. 26:15. They bore false witness before the Roman Governor. Mt. 26:59. They gave money to the soldiers to tell that the body of Jesus had been stolen. Mt 28:12. Hell&#8217;s agreement was disannulled the third day on resurrection morning. Mt. 28:6. The overflowing scourge passed through like a flood washing away a house.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Dan 11:6:</strong> And in the end of years they shall join themselves together; for the king's daughter of the south shall come to the king of the north to make an agreement: but she shall not retain the power of the arm; neither shall he stand, nor his arm: but she shall be given up, and they that brought her, and he that begat her, and he that strengthened her in <em>these</em> times.</li>\n<li><strong>Isa 7:7; Isa 8:10</strong></li>\n</ul>\n\n<h3>Isaiah 28:19</h3>\n<blockquote class=\"primary-scripture\">From the time that it goeth forth it shall take you: for morning by morning shall it pass over, by day and by night: and it shall be a vexation only to understand the report.</blockquote>\n<p>After the resurrection it was sheer panic&#9472;every report that came sent them into a tail-storm. Morning and night they lived in a reign of terror. Tremors and shaking when they saw dead men walking the streets&#9472;the earthquake and sun going down at noontime&#9472;they were awe-stricken at the temple curtain being rent from top to bottom&#9472;miracles, healings, and Pentecost reports sent shock-waves and distress like a nightmare throughout Jerusalem.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>1Sa 3:11:</strong> And the LORD said to Samuel, Behold, I will do a thing in Israel, at which both the ears of every one that heareth it shall tingle.</li>\n<li><strong>2Ki 21:12-13:</strong> Therefore thus saith the LORD God of Israel, Behold, I <em>am</em> bringing <em>such</em> evil upon Jerusalem and Judah, that whosoever heareth of it, both his ears shall tingle. And I will stretch over Jerusalem the line of Samaria, and the plummet of the house of Ahab: and I will wipe Jerusalem as <em>a man</em> wipeth a dish, wiping <em>it,</em> and turning <em>it</em> upside down.</li>\n<li><strong>Hab 3:16:</strong> When I heard, my belly trembled; my lips quivered at the voice: rottenness entered into my bones, and I trembled in myself, that I might rest in the day of trouble: when he cometh up unto the people, he will invade them with his troops.</li>\n<li><strong>Luk 21:26</strong></li>\n</ul>\n\n<h3>Isaiah 28:20</h3>\n<blockquote class=\"primary-scripture\">For the bed is shorter than that a man can stretch himself on it: and the covering narrower than that he can wrap himself in it.</blockquote>\n<p>No place to rest&#9472;no place to hide. Their cover-up was falling apart&#9472;they had wrapped themselves in prevarication and varnished the truth regarding the resurrection and in their perfidy trumped up a story about the body being stolen&#9472;the prophet&#8217;s picture of a bed too short and the cover too narrow is the best one-liner you will ever hear.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 59:5-6:</strong> They hatch cockatrice' eggs, and weave the spider's web: he that eateth of their eggs dieth, and that which is crushed breaketh out into a viper. Their webs shall not become garments, neither shall they cover themselves with their works: their works <em>are</em> works of iniquity, and the act of violence <em>is</em> in their hands.</li>\n<li><strong>Isa 66:4:</strong> I also will choose their delusions, and will bring their fears upon them; because when I called, none did answer; when I spake, they did not hear: but they did evil before mine eyes, and chose <em>that</em> in which I delighted not.</li>\n</ul>\n\n<h3>Isaiah 28:21</h3>\n<blockquote class=\"primary-scripture\">For the LORD shall rise up as in mount Perazim, he shall be wroth as in the valley of Gibeon, that he may do his work, his strange work; and bring to pass his act, his strange act.</blockquote>\n<p>The work of judgment and punishment against his own people is called a strange work. God broke forth as a breach of waters at Perazim and destroyed David&#8217;s enemies and again with a sound in the tops of the mulberry trees at Gibeon. (2Sam. 5:20; 1 Chron. 14:15). The laying of the foundation in Zion and the resurrection of Jesus from the dead is called a strange work and a strange act.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>2Sa 5:20:</strong> And David came to Baalperazim, and David smote them there, and said, The LORD hath broken forth upon mine enemies before me, as the breach of waters. Therefore he called the name of that place Baalperazim.</li>\n<li><strong>Jos 10:10-12</strong></li>\n</ul>\n\n<h3>Isaiah 28:22</h3>\n<blockquote class=\"primary-scripture\">Now therefore be ye not mockers, lest your bands be made strong: for I have heard from the Lord GOD of hosts a consumption, even determined upon the whole earth.</blockquote>\n<p>If these rulers don&#8217;t stop their scoffing God will tighten the bands stronger and if this doesn&#8217;t produce results then he has issued a warrant of destruction against the whole earth&#9472;it will be an international disaster.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>2Ch 36:16:</strong> But they mocked the messengers of God, and despised his words, and misused his prophets, until the wrath of the LORD arose against his people, till <em>there was</em> no remedy.</li>\n<li><strong>Jer 15:17; Jer 15:17; Act 13:40-41</strong></li>\n</ul>\n\n<h3>Isaiah 28:23</h3>\n<blockquote class=\"primary-scripture\">Give ye ear, and hear my voice; hearken, and hear my speech.</blockquote>\n<p>We need to listen carefully to the prophet&#8217;s message&#9472;underline it&#9472;underscore it&#9472;highlight it&#9472;and above all understand and believe it.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 1:2:</strong> Hear, O heavens, and give ear, O earth: for the LORD hath spoken, I have nourished and brought up children, and they have rebelled against me.</li>\n<li><strong>Rev 2:7:</strong> He that hath an ear, let him hear what the Spirit saith unto the churches; To him that overcometh will I give to eat of the tree of life, which is in the midst of the paradise of God.</li>\n</ul>\n\n<h3>Isaiah 28:24</h3>\n<blockquote class=\"primary-scripture\">Doth the plowman plow all day to sow? doth he open and break the clods of his ground?</blockquote>\n<p>This is a rhetorical question&#9472;the answer is implied in the question. Is the farmer plowing and plowing and plowing all day continually and never harrowing and planting the seeds?</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Jer 4:3:</strong> For thus saith the LORD to the men of Judah and Jerusalem, Break up your fallow ground, and sow not among thorns.</li>\n<li><strong>Hos 10:11-12:</strong> And Ephraim <em>is as</em> an heifer <em>that is</em> taught, <em>and</em> loveth to tread out <em>the corn;</em> but I passed over upon her fair neck: I will make Ephraim to ride; Judah shall plow, <em>and</em> Jacob shall break his clods. Sow to yourselves in righteousness, reap in mercy; break up your fallow ground: for <em>it is</em> time to seek the LORD, till he come and rain righteousness upon you.</li>\n</ul>\n\n<h3>Isaiah 28:25</h3>\n<blockquote class=\"primary-scripture\">When he hath made plain the face thereof, doth he not cast abroad the fitches, and scatter the cummin, and cast in the principal wheat and the appointed barley and the rie in their place?</blockquote>\n<p>Does the farmer not scatter some of the seeds and plant others in rows? If the farmer knows to do all this then why is it that my people do not know how to break up the fallow ground and sow righteousness and seek the Lord?</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Exo 9:31-32:</strong> And the flax and the barley was smitten: for the barley <em>was</em> in the ear, and the flax <em>was</em> bolled. But the wheat and the rie were not smitten: for they <em>were</em> not grown up.</li>\n</ul>\n\n<h3>Isaiah 28:26</h3>\n<blockquote class=\"primary-scripture\">For his God doth instruct him to discretion, and doth teach him.</blockquote>\n<p>God had instructed man from Eden&#8217;s garden how to plant a field and raise crops, so also had he taught man moral and spiritual responsibility. He has even written eternity upon our heart so that none are without responsibility.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Job 35:11:</strong> Who teacheth us more than the beasts of the earth, and maketh us wiser than the fowls of heaven?</li>\n<li><strong>Dan 1:17:</strong> As for these four children, God gave them knowledge and skill in all learning and wisdom: and Daniel had understanding in all visions and dreams.</li>\n</ul>\n\n<h3>Isaiah 28:27</h3>\n<blockquote class=\"primary-scripture\">For the fitches are not threshed with a threshing instrument, neither is a cart wheel turned about upon the cummin; but the fitches are beaten out with a staff, and the cummin with a rod.</blockquote>\n<p>Different grains require a different mode of threshing. Nuts require the shell to be removed by crushing while strawberries require handing delicately.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Amo 1:3:</strong> Thus saith the LORD; For three transgressions of Damascus, and for four, I will not turn away <em>the punishment</em> thereof; because they have threshed Gilead with threshing instruments of iron:</li>\n</ul>\n\n<h3>Isaiah 28:28</h3>\n<blockquote class=\"primary-scripture\">Bread corn is bruised; because he will not ever be threshing it, nor break it with the wheel of his cart, nor bruise it with his horsemen.</blockquote>\n<p>We know that some grains require a grinding wheel and other grains require little or no grinding.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Amo 1:3:</strong> Thus saith the LORD; For three transgressions of Damascus, and for four, I will not turn away <em>the punishment</em> thereof; because they have threshed Gilead with threshing instruments of iron:</li>\n<li><strong>Joh 12:24:</strong> Verily, verily, I say unto you, Except a corn of wheat fall into the ground and die, it abideth alone: but if it die, it bringeth forth much fruit.</li>\n</ul>\n\n<h3>Isaiah 28:29</h3>\n<blockquote class=\"primary-scripture\">This also cometh forth from the LORD of hosts, which is wonderful in counsel, and excellent in working.</blockquote>\n<p>This counsel or advice is from the Lord who has given the farmer wisdom. He has taught us the how, when and where regarding crops.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Job 5:9:</strong> Which doeth great things and unsearchable; marvellous things without number:</li>\n<li><strong>Job 37:23:</strong> <em>Touching</em> the Almighty, we cannot find him out: <em>he is</em> excellent in power, and in judgment, and in plenty of justice: he will not afflict.</li>\n</ul>",
  "faq": [
    {
      "question": "Who is the 'mighty and strong one' mentioned in verse 2?",
      "answer": "The commentary identifies the Lord's agent as Assyria, sent to batter down Samaria like a hailstorm and beat them to the ground."
    },
    {
      "question": "How does the commentary interpret the 'covenant with death' being disannulled?",
      "answer": "It specifically links the annulment to the Resurrection of Jesus on the third day, stating that the agreement with hell was cancelled and swept away like a flash flood."
    },
    {
      "question": "What is the meaning of the 'bed is shorter' metaphor in verse 20?",
      "answer": "It describes the rulers' failed cover-up regarding the resurrection; their lies (such as the body being stolen) were insufficient to hide the truth, offering no place to rest."
    },
    {
      "question": "What is the 'strange work' of God described in verse 21?",
      "answer": "The commentary defines it as the work of judgment against His own people, as well as the laying of the foundation in Zion and the resurrection of Jesus."
    }
  ],
  "structuredData": [
    {
      "@context": "https://schema.org",
      "@type": "Article",
      "headline": "The Sure Foundation and the Covenant with Death",
      "description": "The prophet warns these beer-bellied winesops: their crown of pride is a fading flower. Only the Stone in Zion stands when the covenant with death is annulled.",
      "author": {
        "@type": "Person",
        "name": "Lewis P. Hussell"
      },
      "about": [
        {
          "@type": "Thing",
          "name": "Stone in Zion",
          "description": "The sure foundation and precious cornerstone laid by God, interpreted as Jesus.",
          "sameAs": "https://en.wikipedia.org/wiki/Cornerstone"
        },
        {
          "@type": "Thing",
          "name": "Covenant with Death",
          "description": "A metaphorical agreement made by the rulers of Jerusalem to hide under falsehoods.",
          "sameAs": null
        },
        {
          "@type": "Place",
          "name": "Samaria",
          "description": "Described as the crown of pride and a fading flower, situated on a hill surrounded by rich valleys.",
          "sameAs": "https://en.wikipedia.org/wiki/Samaria_(ancient_city)"
        },
        {
          "@type": "CreativeWork",
          "name": "Isaiah"
        },
        {
          "@type": "CreativeWork",
          "name": "Chapter 28"
        }
      ],
      "keywords": "covenant with death disannulled, Isaiah 28 and the resurrection of Jesus, sure foundation stone is Jesus Christ, God's strange work is the resurrection, refuge of lies and resurrection cover-up, Isaiah 28 covenant with Judas, drunkards of Ephraim explained"
    },
    {
      "@context": "https://schema.org",
      "@type": "FAQPage",
      "mainEntity": [
        {
          "@type": "Question",
          "name": "Who is the 'mighty and strong one' mentioned in verse 2?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The commentary identifies the Lord's agent as Assyria, sent to batter down Samaria like a hailstorm and beat them to the ground."
          }
        },
        {
          "@type": "Question",
          "name": "How does the commentary interpret the 'covenant with death' being disannulled?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "It specifically links the annulment to the Resurrection of Jesus on the third day, stating that the agreement with hell was cancelled and swept away like a flash flood."
          }
        },
        {
          "@type": "Question",
          "name": "What is the meaning of the 'bed is shorter' metaphor in verse 20?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "It describes the rulers' failed cover-up regarding the resurrection; their lies (such as the body being stolen) were insufficient to hide the truth, offering no place to rest."
          }
        },
        {
          "@type": "Question",
          "name": "What is the 'strange work' of God described in verse 21?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The commentary defines it as the work of judgment against His own people, as well as the laying of the foundation in Zion and the resurrection of Jesus."
          }
        }
      ]
    },
    {
      "@context": "https://schema.org",
      "@type": "BreadcrumbList",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://4thewordofgod.com/"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Commentaries",
          "item": "https://4thewordofgod.com/commentaries/"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Isaiah",
          "item": "https://4thewordofgod.com/commentaries/isaiah"
        },
        {
          "@type": "ListItem",
          "position": 4,
          "name": "Chapter 28",
          "item": "https://4thewordofgod.com/commentaries/isaiah/28"
        }
      ]
    }
  ],
  "metaDescription": "The prophet warns these beer-bellied winesops: their crown of pride is a fading flower. Only the Stone in Zion stands when the covenant with death is annulled.",
  "keywords": [
    "covenant with death disannulled",
    "Isaiah 28 and the resurrection of Jesus",
    "sure foundation stone is Jesus Christ",
    "God's strange work is the resurrection",
    "refuge of lies and resurrection cover-up",
    "Isaiah 28 covenant with Judas",
    "drunkards of Ephraim explained"
  ],
  "previous_chapter": "isaiah_27",
  "next_chapter": "isaiah_29"
}