{
  "book_name": "Isaiah",
  "chapter_number": "37",
  "title": "Divine Deliverance and the Fall of the Assyrian Boaster",
  "content": "<p>A day of trouble had arrived for the administration of Hezekiah. Assyria had reneged on its peace treaty and invaded Israel. Jerusalem was next unless they surrendered. A meeting took place at the laundry mat─no agreement could be reached! A prayer meeting was held in the temple compound and the prophet Isaiah was asked if he had received any word from the LORD. He then reveals that God is going to cause a rumor thus sending the Rabashack hurriedly back to defend his country against an invasion of the Ethiopians. Meanwhile in the army camping nearby, God sends a death angel and 185,000 Assyrian soldiers were dead the following morning, and the king breaks camp and rushes home and goes to the idol temple to worship where his two sons slip in and kill him.</p>\n\n<h2>Uncovering Divine Deliverance and the Fall of the Assyrian Boaster</h2>\n\n<h3>Isaiah 37:1</h3>\n<blockquote class=\"primary-scripture\">And it came to pass, when king Hezekiah heard it, that he rent his clothes, and covered himself with sackcloth, and went into the house of the LORD.</blockquote>\n<p>Hezekiah tore his robe, put on an old gunnysack and went to the temple to pray.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>2Ki 19:1:</strong> And it came to pass, when king Hezekiah heard it, that he rent his clothes, and covered himself with sackcloth, and went into the house of the LORD. Read: <strong>2Ki 19:2-3; Ezr 9:5</strong></li>\n</ul>\n\n<h3>Isaiah 37:2</h3>\n<blockquote class=\"primary-scripture\">And he sent Eliakim, who was over the household, and Shebna the scribe, and the elders of the priests covered with sackcloth, unto Isaiah the prophet the son of Amoz.</blockquote>\n<p>He sends his prime minister and a large contingent of people to see if the prophet has any revelation from God. They not only inquire of the prophet Isaiah but they went to see the prophetess Huldah.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>2Ki 22:13-14:</strong> Go ye, enquire of the LORD for me, and for the people, and for all Judah, concerning the words of this book that is found: for great is the wrath of the LORD that is kindled against us, because our fathers have not hearkened unto the words of this book, to do according unto all that which is written concerning us. So Hilkiah the priest, and Ahikam, and Achbor, and Shaphan, and Asahiah, went unto Huldah the prophetess, the wife of Shallum the son of Tikvah, the son of Harhas, keeper of the wardrobe; (now she dwelt in Jerusalem in the college;) and they communed with her.</li>\n</ul>\n\n<h3>Isaiah 37:3</h3>\n<blockquote class=\"primary-scripture\">And they said unto him, Thus saith Hezekiah, This day is a day of trouble, and of rebuke, and of blasphemy: for the children are come to the birth, and there is not strength to bring forth.</blockquote>\n<p>It was a day of trouble and frustration─he likens the day to a breech birth and the woman hasn’t enough strength to give birth to the baby.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>2Ki 22:12:</strong> And the king commanded Hilkiah the priest, and Ahikam the son of Shaphan, and Achbor the son of Michaiah, and Shaphan the scribe, and Asahiah a servant of the king's, saying,</li>\n</ul>\n\n<h3>Isaiah 37:4-5</h3>\n<blockquote class=\"primary-scripture\">It may be the LORD thy God will hear the words of Rabshakeh, whom the king of Assyria his master hath sent to reproach the living God, and will reprove the words which the LORD thy God hath heard: wherefore lift up thy prayer for the remnant that is left. So the servants of king Hezekiah came to Isaiah.</blockquote>\n<p>He is hoping that God has heard Rabashakeh defying the living God and taunting Hezekiah with insults. He is hoping that God won’t let him get away with these taunts.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>2Ch 15:4:</strong> But when they in their trouble did turn unto the LORD God of Israel, and sought him, he was found of them.</li>\n<li><strong>Psa 50:15:</strong> And call upon me in the day of trouble: I will deliver thee, and thou shalt glorify me.</li>\n<li><strong>Psa 116:3-4:</strong> The sorrows of death compassed me, and the pains of hell gat hold upon me: I found trouble and sorrow. Then called I upon the name of the LORD; O LORD, I beseech thee, deliver my soul. Read: <strong>2Sa 16:12</strong></li>\n</ul>\n\n<h3>Isaiah 37:6-7</h3>\n<blockquote class=\"primary-scripture\">And Isaiah said unto them, Thus shall ye say unto your master, Thus saith the LORD, Be not afraid of the words that thou hast heard, wherewith the servants of the king of Assyria have blasphemed me. Behold, I will send a blast upon him, and he shall hear a rumour, and return to his own land; and I will cause him to fall by the sword in his own land.</blockquote>\n<p>The deputation returns with words of reassurance that God had heard the blasphemy. This blast of alarm was the news from Assyria that they were about to be attacked by Ethiopia. When he gets home he will be assassinated by his two sons.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>2Ki 19:5-7:</strong> So the servants of king Hezekiah came to Isaiah. And Isaiah said unto them, Thus shall ye say to your master, Thus saith the LORD, Be not afraid of the words which thou hast heard, with which the servants of the king of Assyria have blasphemed me. Behold, I will send a blast upon him, and he shall hear a rumour, and shall return to his own land; and I will cause him to fall by the sword in his own land.</li>\n<li><strong>2Ch 32:21:</strong> And the LORD sent an angel, which cut off all the mighty men of valour, and the leaders and captains in the camp of the king of Assyria. So he returned with shame of face to his own land. And when he was come into the house of his god, they that came forth of his own bowels slew him there with the sword.</li>\n</ul>\n\n<h3>Isaiah 37:8-9</h3>\n<blockquote class=\"primary-scripture\">So Rabshakeh returned, and found the king of Assyria warring against Libnah: for he had heard that he was departed from Lachish. And he heard say concerning Tirhakah king of Ethiopia, He is come forth to make war with thee. And when he heard it, he sent messengers to Hezekiah, saying,</blockquote>\n<p>Libnah and Lachish were cities in Judah that Assyria was warring against. The prophet of Isaiah had already told Hezekiah that the king would hear a rumor─the rumor was that Assyria was under attack and he needed to come and defend the homeland.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>2Ki 19:8:</strong> So Rabshakeh returned, and found the king of Assyria warring against Libnah: for he had heard that he was departed from Lachish.</li>\n<li><strong>2Ki 19:9:</strong> And when he heard say of Tirhakah king of Ethiopia, Behold, he is come out to fight against thee: he sent messengers again unto Hezekiah, saying,</li>\n</ul>\n\n<h3>Isaiah 37:10</h3>\n<blockquote class=\"primary-scripture\">Thus shall ye speak to Hezekiah king of Judah, saying, Let not thy God, in whom thou trustest, deceive thee, saying, Jerusalem shall not be given into the hand of the king of Assyria.</blockquote>\n<p>Hezekiah was warned by the Assyrians not to trust God for the Assyrian king who had retreated would return to capture them.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>2Ki 18:5:</strong> He trusted in the LORD God of Israel; so that after him was none like him among all the kings of Judah, nor any that were before him.</li>\n</ul>\n\n<h3>Isaiah 37:11-13</h3>\n<blockquote class=\"primary-scripture\">Behold, thou hast heard what the kings of Assyria have done to all lands by destroying them utterly; and shalt thou be delivered? Have the gods of the nations delivered them which my fathers have destroyed, as Gozan, and Haran, and Rezeph, and the children of Eden which were in Telassar? Where is the king of Hamath, and the king of Arphad, and the king of the city of Sepharvaim, Hena, and Ivah?</blockquote>\n<p>Listen, the king of Assyria has crushed and exterminated all who had opposed him. One country after another was destroyed by Assyria and none of the idol gods stepped in to help them. Those who governed the city were executed and those with a trade were used as slaves.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>2Ki 17:4-5:</strong> And the king of Assyria found conspiracy in Hoshea: for he had sent messengers to So king of Egypt, and brought no present to the king of Assyria, as he had done year by year: therefore the king of Assyria shut him up, and bound him in prison. Then the king of Assyria came up throughout all the land, and went up to Samaria, and besieged it three years.</li>\n<li><strong>Isa 46:5-6:</strong> To whom will ye liken me, and make me equal, and compare me, that we may be like? They lavish gold out of the bag, and weigh silver in the balance, and hire a goldsmith; and he maketh it a god: they fall down, yea, they worship.</li>\n<li><strong>2Ki 17:24:</strong> And the king of Assyria brought men from Babylon, and from Cuthah, and from Ava, and from Hamath, and from Sepharvaim, and placed them in the cities of Samaria instead of the children of Israel: and they possessed Samaria, and dwelt in the cities thereof. Read: <strong>2Ki 17:30-31</strong></li>\n</ul>\n\n<h3>Isaiah 37:14</h3>\n<blockquote class=\"primary-scripture\">And Hezekiah received the letter from the hand of the messengers, and read it: and Hezekiah went up unto the house of the LORD, and spread it before the LORD.</blockquote>\n<p>Hezekiah laid out the contents of the letter before the LORD and prayed and wept.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Joe 2:17-20:</strong> Let the priests, the ministers of the LORD, weep between the porch and the altar, and let them say, Spare thy people, O LORD, and give not thine heritage to reproach, that the heathen should rule over them: wherefore should they say among the people, Where is their God? Then will the LORD be jealous for his land, and pity his people. Yea, the LORD will answer and say unto his people, Behold, I will send you corn, and wine, and oil, and ye shall be satisfied therewith: and I will no more make you a reproach among the heathen: But I will remove far off from you the northern army, and will drive him into a land barren and desolate, with his face toward the east sea, and his hinder part toward the utmost sea, and his stink shall come up, and his ill savour shall come up, because he hath done great things.</li>\n</ul>\n\n<h3>Isaiah 37:15-16</h3>\n<blockquote class=\"primary-scripture\">And Hezekiah prayed unto the LORD, saying, O LORD of hosts, God of Israel, that dwellest between the cherubims, thou art the God, even thou alone, of all the kingdoms of the earth: thou hast made heaven and earth.</blockquote>\n<p>God was enthroned (in symbol) above the ark of the temple. The king ascribes God as creator and sustainer of the universe.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 44:6:</strong> Thus saith the LORD the King of Israel, and his redeemer the LORD of hosts; I am the first, and I am the last; and beside me there is no God. Read: <strong>Isa 43:10-11</strong></li>\n</ul>\n\n<h3>Isaiah 37:17</h3>\n<blockquote class=\"primary-scripture\">Incline thine ear, O LORD, and hear; open thine eyes, O LORD, and see: and hear all the words of Sennacherib, which hath sent to reproach the living God.</blockquote>\n<p>He asked God to listen, and to see, and to hear, what Sennacherib had written, taunting and insulting the living God.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Dan 9:17-19:</strong> Now therefore, O our God, hear the prayer of thy servant, and his supplications, and cause thy face to shine upon thy sanctuary that is desolate, for the Lord's sake. O my God, incline thine ear, and hear; open thine eyes, and behold our desolations, and the city which is called by thy name: for we do not present our supplications before thee for our righteousnesses, but for thy great mercies. O Lord, hear; O Lord, forgive; O Lord, hearken and do; defer not, for thine own sake, O my God: for thy city and thy people are called by thy name.</li>\n</ul>\n\n<h3>Isaiah 37:18-19</h3>\n<blockquote class=\"primary-scripture\">Of a truth, LORD, the kings of Assyria have laid waste all the nations, and their countries, And have cast their gods into the fire: for they were no gods, but the work of men's hands, wood and stone: therefore they have destroyed them.</blockquote>\n<p>It was true that the king of Assyria had brought to ruin nations and the lands they lived in. Nothing angered God more than to worship idols.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>1Ch 5:26:</strong> And the God of Israel stirred up the spirit of Pul king of Assyria, and the spirit of Tilgathpilneser king of Assyria, and he carried them away, even the Reubenites, and the Gadites, and the half tribe of Manasseh, and brought them unto Halah, and Habor, and Hara, and to the river Gozan, unto this day.</li>\n<li><strong>Isa 44:9-10:</strong> They that make a graven image are all of them vanity; and their delectable things shall not profit; and they are their own witnesses; they see not, nor know; that they may be ashamed. Who hath formed a god, or molten a graven image that is profitable for nothing?</li>\n</ul>\n\n<h3>Isaiah 37:21</h3>\n<blockquote class=\"primary-scripture\">Then Isaiah the son of Amoz sent unto Hezekiah, saying, Thus saith the LORD God of Israel, Whereas thou hast prayed to me against Sennacherib king of Assyria:</blockquote>\n<p>In answer to the prayers be assured that there will be an appropriate response.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Act 4:31:</strong> And when they had prayed, the place was shaken where they were assembled together; and they were all filled with the Holy Ghost, and they spake the word of God with boldness.</li>\n</ul>\n\n<h3>Isaiah 37:22</h3>\n<blockquote class=\"primary-scripture\">This is the word which the LORD hath spoken concerning him; The virgin, the daughter of Zion, hath despised thee, and laughed thee to scorn; the daughter of Jerusalem hath shaken her head at thee.</blockquote>\n<p>Zion despises and mocks you─she is laughing you to scorn─ you may insult idol gods but you can’t insult the God of heaven and get away with it.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Psa 2:2-4:</strong> The kings of the earth set themselves, and the rulers take counsel together, against the LORD, and against his anointed, saying, Let us break their bands asunder, and cast away their cords from us. He that sitteth in the heavens shall laugh: the Lord shall have them in derision.</li>\n</ul>\n\n<h3>Isaiah 37:23</h3>\n<blockquote class=\"primary-scripture\">Whom hast thou reproached and blasphemed? and against whom hast thou exalted thy voice, and lifted up thine eyes on high? even against the Holy One of Israel.</blockquote>\n<p>He taunted, defied, insulted and reviled the only God that could retaliate.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 41:14:</strong> Fear not, thou worm Jacob, and ye men of Israel; I will help thee, saith the LORD, and thy redeemer, the Holy One of Israel. Read: <strong>2Ki 19:4</strong></li>\n</ul>\n\n<h3>Isaiah 37:24-25</h3>\n<blockquote class=\"primary-scripture\">By thy servants hast thou reproached the Lord, and hast said, By the multitude of my chariots am I come up to the height of the mountains, to the sides of Lebanon; and I will cut down the tall cedars thereof, and the choice fir trees thereof: and I will enter into the height of his border, and the forest of his Carmel. I have digged, and drunk water; and with the sole of my feet have I dried up all the rivers of the besieged places.</blockquote>\n<p>This brag-bag claims that he can scale the highest mountain─chop down the choiciest trees─and push right into its furthest recesses. More boasting─he has dug a well of water and drained their rivers.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>2Ki 19:22:</strong> Whom hast thou reproached and blasphemed? and against whom hast thou exalted thy voice, and lifted up thine eyes on high? even against the Holy One of Israel.</li>\n<li><strong>Exo 9:17:</strong> As yet exaltest thou thyself against my people, that thou wilt not let them go?</li>\n<li><strong>2Ki 19:23-24:</strong> By thy messengers thou hast reproached the Lord, and hast said, With the multitude of my chariots I am come up to the height of the mountains, to the sides of Lebanon, and will cut down the tall cedar trees thereof, and the choice fir trees thereof: and I will enter into the lodgings of his borders, and into the forest of his Carmel. I have digged and drunk strange waters, and with the sole of my feet have I dried up all the rivers of besieged places.</li>\n</ul>\n\n<h3>Isaiah 37:26-27</h3>\n<blockquote class=\"primary-scripture\">Hast thou not heard long ago, how I have done it; and of ancient times, that I have formed it? now have I brought it to pass, that thou shouldest be to lay waste defenced cities into ruinous heaps. Therefore their inhabitants were of small power, they were dismayed and confounded: they were as the grass of the field, and as the green herb, as the grass on the housetops, and as corn blasted before it be grown up.</blockquote>\n<p>Have you not realized that a long time ago I planned it and I formed it. That I am the one who has power to lay waste defenced cities. These people were drained of their power─like tender grass shoots on a thatched roof, or like a field of corn in a drought.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Psa 129:6:</strong> Let them be as the grass upon the housetops, which withereth afore it groweth up: Read: <strong>Isa 40:6-8</strong></li>\n</ul>\n\n<h3>Isaiah 37:28-29</h3>\n<blockquote class=\"primary-scripture\">But I know thy abode, and thy going out, and thy coming in, and thy rage against me. Because thy rage against me, and thy tumult, is come up into mine ears, therefore will I put my hook in thy nose, and my bridle in thy lips, and I will turn thee back by the way by which thou camest.</blockquote>\n<p>God lets him know that he had him in his GPS─ he has zeroed in on him. When God decides to make an end of a wicked man there is no limit to his power. Now who is boss? God is going to put a hook in his nose and a bridle in his mouth.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Psa 139:2-5:</strong> Thou knowest my downsitting and mine uprising, thou understandest my thought afar off. Thou compassest my path and my lying down, and art acquainted with all my ways. For there is not a word in my tongue, but, lo, O LORD, thou knowest it altogether. Thou hast beset me behind and before, and laid thine hand upon me.</li>\n<li><strong>Nah 1:9-11:</strong> What do ye imagine against the LORD? he will make an utter end: affliction shall not rise up the second time. For while they be folden together as thorns, and while they are drunken as drunkards, they shall be devoured as stubble fully dry. There is one come out of thee, that imagineth evil against the LORD, a wicked counsellor.</li>\n</ul>\n\n<h3>Isaiah 37:30</h3>\n<blockquote class=\"primary-scripture\">And this shall be a sign unto thee, Ye shall eat this year such as groweth of itself; and the second year that which springeth of the same: and in the third year sow ye, and reap, and plant vineyards, and eat the fruit thereof.</blockquote>\n<p>Put out your gardens, because two years from now you will have more than enough, and the third year you will have a bumper crop.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>2Ki 20:9:</strong> And Isaiah said, This sign shalt thou have of the LORD, that the LORD will do the thing that he hath spoken: shall the shadow go forward ten degrees, or go back ten degrees? Read: <strong>1Ki 13:3-5</strong></li>\n</ul>\n\n<h3>Isaiah 37:31-32</h3>\n<blockquote class=\"primary-scripture\">And the remnant that is escaped of the house of Judah shall again take root downward, and bear fruit upward: For out of Jerusalem shall go forth a remnant, and they that escape out of mount Zion: the zeal of the LORD of hosts shall do this.</blockquote>\n<p>The surviving remnant will take new root and have many children and grandchildren. This band of survivors that escaped out of Zion─the remnant─shall go out and repopulate the cities and farmland.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Jer 44:28:</strong> Yet a small number that escape the sword shall return out of the land of Egypt into the land of Judah, and all the remnant of Judah, that are gone into the land of Egypt to sojourn there, shall know whose words shall stand, mine, or theirs. Read: <strong>Isa 65:9</strong></li>\n<li><strong>2Ki 19:31:</strong> For out of Jerusalem shall go forth a remnant, and they that escape out of mount Zion: the zeal of the LORD of hosts shall do this.</li>\n<li><strong>Joe 2:18:</strong> Then will the LORD be jealous for his land, and pity his people.</li>\n<li><strong>Zec 1:14:</strong> So the angel that communed with me said unto me, Cry thou, saying, Thus saith the LORD of hosts; I am jealous for Jerusalem and for Zion with a great jealousy.</li>\n</ul>\n\n<h3>Isaiah 37:33-35</h3>\n<blockquote class=\"primary-scripture\">Therefore thus saith the LORD concerning the king of Assyria, He shall not come into this city, nor shoot an arrow there, nor come before it with shields, nor cast a bank against it. By the way that he came, by the same shall he return, and shall not come into this city, saith the LORD. For I will defend this city to save it for mine own sake, and for my servant David's sake.</blockquote>\n<p>He will not fire a shot─he will not march around it─he will not build a siege ramp against it. The eternal declares that he will take the same path back home. For God’s honor and in memory of his servant David.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>2Ki 19:32-34:</strong> Therefore thus saith the LORD concerning the king of Assyria, He shall not come into this city, nor shoot an arrow there, nor come before it with shield, nor cast a bank against it. By the way that he came, by the same shall he return, and shall not come into this city, saith the LORD. For I will defend this city, to save it, for mine own sake, and for my servant David's sake.</li>\n<li><strong>Isa 37:29:</strong> Because thy rage against me, and thy tumult, is come up into mine ears, therefore will I put my hook in thy nose, and my bridle in thy lips, and I will turn thee back by the way by which thou camest.</li>\n<li><strong>Isa 31:5:</strong> As birds flying, so will the LORD of hosts defend Jerusalem; defending also he will deliver it; and passing over he will preserve it.</li>\n<li><strong>2Ki 20:6:</strong> And I will add unto thy days fifteen years; and I will deliver thee and this city out of the hand of the king of Assyria; and I will defend this city for mine own sake, and for my servant David's sake.</li>\n</ul>\n\n<h3>Isaiah 37:36</h3>\n<blockquote class=\"primary-scripture\">Then the angel of the LORD went forth, and smote in the camp of the Assyrians a hundred and fourscore and five thousand: and when they arose early in the morning, behold, they were all dead corpses.</blockquote>\n<p>When daylight came─just an army or corpses, 185,000 never awoke the next morning.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>2Ch 32:21-22:</strong> And the LORD sent an angel, which cut off all the mighty men of valour, and the leaders and captains in the camp of the king of Assyria. So he returned with shame of face to his own land. And when he was come into the house of his god, they that came forth of his own bowels slew him there with the sword. Thus the LORD saved Hezekiah and the inhabitants of Jerusalem from the hand of Sennacherib the king of Assyria, and from the hand of all other, and guided them on every side.</li>\n</ul>\n\n<h3>Isaiah 37:37-38</h3>\n<blockquote class=\"primary-scripture\">So Sennacherib king of Assyria departed, and went and returned, and dwelt at Nineveh. And it came to pass, as he was worshipping in the house of Nisroch his god, that Adrammelech and Sharezer his sons smote him with the sword; and they escaped into the land of Armenia: and Esarhaddon his son reigned in his stead.</blockquote>\n<p>He broke camp leaving food and supplies behind. He went to the idols temple to honor the idol and his two sons slipped in and slew their own father─they thought with fear that they would be put to death and his third son reigned in his stead. Esar-haddon was the third son of Sennacherib; and having reigned twenty-nine years over the Assyrians, he took advantage of the anarchy and confusion which followed the death of Mesessimordacus, and seized upon Babylon; which he added to his former empire, and reigned over both for thirteen years.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Gen 10:11:</strong> Out of that land went forth Asshur, and builded Nineveh, and the city Rehoboth, and Calah,</li>\n<li><strong>Jon 1:2:</strong> Arise, go to Nineveh, that great city, and cry against it; for their wickedness is come up before me.</li>\n<li><strong>2Ch 32:21:</strong> And the LORD sent an angel, which cut off all the mighty men of valour, and the leaders and captains in the camp of the king of Assyria. So he returned with shame of face to his own land. And when he was come into the house of his god, they that came forth of his own bowels slew him there with the sword.</li>\n</ul>",
  "faq": [
    {
      "question": "How did God respond to Hezekiah's prayer regarding the Assyrian threat?",
      "answer": "According to the commentary, God promised to put a hook in Sennacherib's nose and a bridle in his lips, turning him back. Ultimately, God sent a death angel that killed 185,000 Assyrian soldiers overnight."
    },
    {
      "question": "What agricultural sign was given to Hezekiah regarding the future of the remnant?",
      "answer": "The text explains that for the first two years they would eat what grew of itself, but by the third year, they would sow, reap, plant vineyards, and have a bumper crop."
    },
    {
      "question": "How does the commentary describe the death of Sennacherib?",
      "answer": "After returning to Nineveh in shame, Sennacherib went to his idol's temple to worship, where his two sons, Adrammelech and Sharezer, slipped in and killed him with the sword."
    },
    {
      "question": "What metaphor does the commentary use for God's surveillance of the Assyrian king?",
      "answer": "The commentary uses the modern metaphor of a 'GPS,' stating that God had zeroed in on the king's abode, his going out, and his coming in."
    }
  ],
  "structuredData": [
    {
      "@context": "https://schema.org",
      "@type": "Article",
      "headline": "Divine Deliverance and the Fall of the Assyrian Boaster",
      "description": "A day of trouble arrived for Hezekiah, but God put a hook in the nose of the Assyrian brag-bag. See how prayer and the death angel saved the remnant.",
      "author": {
        "@type": "Person",
        "name": "Lewis P. Hussell"
      },
      "about": [
        {
          "@type": "Person",
          "name": "Hezekiah",
          "description": "King of Judah who prayed for deliverance from Assyria",
          "sameAs": "https://en.wikipedia.org/wiki/Hezekiah"
        },
        {
          "@type": "Person",
          "name": "Sennacherib",
          "description": "King of Assyria who defied God and was subsequently assassinated",
          "sameAs": "https://en.wikipedia.org/wiki/Sennacherib"
        },
        {
          "@type": "Thing",
          "name": "The Remnant",
          "description": "The surviving group of Judah that would take root and repopulate the land",
          "sameAs": "https://en.wikipedia.org/wiki/Remnant_(Bible)"
        },
        {
          "@type": "Person",
          "name": "Isaiah",
          "description": "The prophet who delivered God's message of reassurance to Hezekiah",
          "sameAs": "https://en.wikipedia.org/wiki/Isaiah"
        },
        {
          "@type": "CreativeWork",
          "name": "Isaiah"
        },
        {
          "@type": "CreativeWork",
          "name": "Chapter 37"
        }
      ],
      "keywords": "Hezekiah's prayer against Sennacherib, Fall of the Assyrian Boaster, Sennacherib's reproach of the living God, Angel of the LORD smites 185,000 Assyrians, God's hook in Sennacherib's nose, God's sovereignty over Assyria, Prophecy of Sennacherib's assassination"
    },
    {
      "@context": "https://schema.org",
      "@type": "FAQPage",
      "mainEntity": [
        {
          "@type": "Question",
          "name": "How did God respond to Hezekiah's prayer regarding the Assyrian threat?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "According to the commentary, God promised to put a hook in Sennacherib's nose and a bridle in his lips, turning him back. Ultimately, God sent a death angel that killed 185,000 Assyrian soldiers overnight."
          }
        },
        {
          "@type": "Question",
          "name": "What agricultural sign was given to Hezekiah regarding the future of the remnant?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The text explains that for the first two years they would eat what grew of itself, but by the third year, they would sow, reap, plant vineyards, and have a bumper crop."
          }
        },
        {
          "@type": "Question",
          "name": "How does the commentary describe the death of Sennacherib?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "After returning to Nineveh in shame, Sennacherib went to his idol's temple to worship, where his two sons, Adrammelech and Sharezer, slipped in and killed him with the sword."
          }
        },
        {
          "@type": "Question",
          "name": "What metaphor does the commentary use for God's surveillance of the Assyrian king?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The commentary uses the modern metaphor of a 'GPS,' stating that God had zeroed in on the king's abode, his going out, and his coming in."
          }
        }
      ]
    },
    {
      "@context": "https://schema.org",
      "@type": "BreadcrumbList",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://4thewordofgod.com/"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Commentaries",
          "item": "https://4thewordofgod.com/commentaries/"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Isaiah",
          "item": "https://4thewordofgod.com/commentaries/isaiah"
        },
        {
          "@type": "ListItem",
          "position": 4,
          "name": "Chapter 37",
          "item": "https://4thewordofgod.com/commentaries/isaiah/37"
        }
      ]
    }
  ],
  "metaDescription": "A day of trouble arrived for Hezekiah, but God put a hook in the nose of the Assyrian brag-bag. See how prayer and the death angel saved the remnant.",
  "keywords": [
    "Hezekiah's prayer against Sennacherib",
    "Fall of the Assyrian Boaster",
    "Sennacherib's reproach of the living God",
    "Angel of the LORD smites 185,000 Assyrians",
    "God's hook in Sennacherib's nose",
    "God's sovereignty over Assyria",
    "Prophecy of Sennacherib's assassination"
  ],
  "previous_chapter": "isaiah_36",
  "next_chapter": "isaiah_38"
}