{
  "book_name": "Isaiah",
  "chapter_number": "08",
  "title": "The Sign of the Son and the Coming Assyrian Flood",
  "content": "<p>God told Isaiah to get his wife pregnant and that the boy will be a sign to Israel that an army is coming. Before the boy is two years old Damascus and Samaria will fall to the Assyrians. His prophecies that the two leaders of those countries will be dead within two years comes true. The prophet predicts a flood but it is not a flood of water but an army will spread across the land like a flood.</p>\n<p>Isaiah and his two children who have symbolic names is a sign to that generation:</p>\n<ul>\n  <li><strong>Isaiah:</strong> Jehovah will save</li>\n  <li><strong>Shear-Jashub:</strong> A remnant will return</li>\n  <li><strong>Maher-shalal-hash-baz:</strong> Your enemies will soon be destroyed</li>\n</ul>\n<p>Some were seeking fortune tellers and others were consulting spiritualist and others were claiming to talk to the dead─should not a people seek unto their God? Only one book has the real answers and that is the Word of God. The prophet predicts that Israel and Judah will both end up as slaves in captivity. Their life in captivity was sad beyond understanding. All joy had gone from their heart and they were so heartsick that they couldn’t see through the tears. Catastrophe had struck them and their whole world had fallen apart. All the details are in the exposition.</p>\n\n<h2>Unveiling the Prophetic Sign and the Coming Assyrian Flood</h2>\n\n<h3>Isaiah 8:1</h3>\n<blockquote class=\"primary-scripture\">Moreover the LORD said unto me, Take thee a great roll, and write in it with a man's pen concerning Mahershalalhashbaz.</blockquote>\n<p>The prophet is told to take a scroll and write on it the birth announcement of his son; name him before he is born. <strong>Mahershalalhashbaz</strong> means (Speed-spoil-hurry-prey).</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Jer 36:2:</strong> Take thee a roll of a book, and write therein all the words that I have spoken unto thee against Israel, and against Judah, and against all the nations, from the day I spake unto thee, from the days of Josiah, even unto this day. Read: Jer 36:28; Isa 30:8; Job 19:23-24; Hab 2:2-3</li>\n</ul>\n\n<h3>Isaiah 8:2</h3>\n<blockquote class=\"primary-scripture\">And I took unto me faithful witnesses to record, Uriah the priest, and Zechariah the son of Jeberechiah.</blockquote>\n<p>Isaiah asked two of his friends to testify that this was written beforehand so that the whole world would know that before the conception he had told them that his wife would bear a son and that he had pre-named him.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Rth 4:10-11:</strong> Moreover Ruth the Moabitess, the wife of Mahlon, have I purchased to be my wife, to raise up the name of the dead upon his inheritance, that the name of the dead be not cut off from among his brethren, and from the gate of his place: ye <em>are</em> witnesses this day. And all the people that <em>were</em> in the gate, and the elders, said, <em>We are</em> witnesses. The LORD make the woman that is come into thine house like Rachel and like Leah, which two did build the house of Israel: and do thou worthily in Ephratah, and be famous in Bethlehem:</li>\n</ul>\n\n<h3>Isaiah 8:3</h3>\n<blockquote class=\"primary-scripture\">And I went unto the prophetess; and she conceived, and bare a son. Then said the LORD to me, Call his name Mahershalalhashbaz.</blockquote>\n<p>He goes home and lies with his wife and she has a son and they call him (Speed-spoil-hurry-prey). Imagine that every time he introduces his son to someone that they will ask “why did you give him that name” and this would provide an opening for Isaiah to tell them of the coming doom.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Hos 1:4-9:</strong> And the LORD said unto him, Call his name Jezreel; for yet a little <em>while,</em> and I will avenge the blood of Jezreel upon the house of Jehu, and will cause to cease the kingdom of the house of Israel. And it shall come to pass at that day, that I will break the bow of Israel in the valley of Jezreel. And she conceived again, and bare a daughter. And <em>God</em> said unto him, Call her name Loruhamah: for I will no more have mercy upon the house of Israel; but I will utterly take them away. But I will have mercy upon the house of Judah, and will save them by the LORD their God, and will not save them by bow, nor by sword, nor by battle, by horses, nor by horsemen. Now when she had weaned Loruhamah, she conceived, and bare a son. Then said <em>God,</em> Call his name Loammi: for ye <em>are</em> not my people, and I will not be your <em>God.</em> Read: Jdg 4:4; 2Ki 22:14; Hos 1:3</li>\n</ul>\n\n<h3>Isaiah 8:4</h3>\n<blockquote class=\"primary-scripture\">For before the child shall have knowledge to cry, My father, and my mother, the riches of Damascus and the spoil of Samaria shall be taken away before the king of Assyria.</blockquote>\n<p>The child will not reach two years old before the capital of Syria (Damascus) and the capital of Israel (Samaria) will be plundered and carried away to the king of Assyria.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>2Ki 17:5-6:</strong> Then the king of Assyria came up throughout all the land, and went up to Samaria, and besieged it three years. In the ninth year of Hoshea the king of Assyria took Samaria, and carried Israel away into Assyria, and placed them in Halah and in Habor <em>by</em> the river of Gozan, and in the cities of the Medes. Read: 2Ki 16:9; 2Ki 15:29; Isa 17:3</li>\n</ul>\n\n<h3>Isaiah 8:5-6</h3>\n<blockquote class=\"primary-scripture\">The LORD spake also unto me again, saying, Forasmuch as this people refuseth the waters of Shiloah that go softly, and rejoice in Rezin and Remaliah's son;</blockquote>\n<p>This message from the Lord comes at another time. Because they had rejected the <strong>waters of Shiloah</strong> (Siloam) typical of God’s care and got all excited over Rezin and Remaliah’s son God is going to bring a flood water over the land. Judah was planning on help from Pekah and Rezin to protect them from Assyria.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Jer 2:13:</strong> For my people have committed two evils; they have forsaken me the fountain of living waters, <em>and</em> hewed them out cisterns, broken cisterns, that can hold no water.</li>\n  <li><strong>Jer 2:18:</strong> And now what hast thou to do in the way of Egypt, to drink the waters of Sihor? or what hast thou to do in the way of Assyria, to drink the waters of the river?</li>\n</ul>\n\n<h3>Isaiah 8:7</h3>\n<blockquote class=\"primary-scripture\">Now therefore, behold, the Lord bringeth up upon them the waters of the river, strong and many, even the king of Assyria, and all his glory: and he shall come up over all his channels, and go over all his banks:</blockquote>\n<p>Isaiah paints a word picture of the King of Assyria crossing the Euphrates River and flooding the entire land with his armies.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Isa 17:12-13:</strong> Woe to the multitude of many people, <em>which</em> make a noise like the noise of the seas; and to the rushing of nations, <em>that</em> make a rushing like the rushing of mighty waters! The nations shall rush like the rushing of many waters: but <em>God</em> shall rebuke them, and they shall flee far off, and shall be chased as the chaff of the mountains before the wind, and like a rolling thing before the whirlwind. Read: Deu 28:49-52; Eze 31:3-5; 2Ki 18:9-12</li>\n</ul>\n\n<h3>Isaiah 8:8</h3>\n<blockquote class=\"primary-scripture\">And he shall pass through Judah; he shall overflow and go over, he shall reach even to the neck; and the stretching out of his wings shall fill the breadth of thy land, O Immanuel.</blockquote>\n<p>The armies of Assyria will overflow the banks and canals like a mighty river in flood stage. It will reach even to the neck which is Jerusalem.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Isa 30:28:</strong> And his breath, as an overflowing stream, shall reach to the midst of the neck, to sift the nations with the sieve of vanity: and <em>there shall be</em> a bridle in the jaws of the people, causing <em>them</em> to err. Read: Isa 22:5-10</li>\n</ul>\n\n<h3>Isaiah 8:9</h3>\n<blockquote class=\"primary-scripture\">Associate yourselves, O ye people, and ye shall be broken in pieces; and give ear, all ye of far countries: gird yourselves, and ye shall be broken in pieces; gird yourselves, and ye shall be broken in pieces.</blockquote>\n<p>Even though they associate themselves together they will lose nerve and be broken by the mighty army of Assyria. They can gird themselves (arm themselves) and still lose the war.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Mic 4:11-13:</strong> Now also many nations are gathered against thee, that say, Let her be defiled, and let our eye look upon Zion. But they know not the thoughts of the LORD, neither understand they his counsel: for he shall gather them as the sheaves into the floor. Arise and thresh, O daughter of Zion: for I will make thine horn iron, and I will make thy hoofs brass: and thou shalt beat in pieces many people: and I will consecrate their gain unto the LORD, and their substance unto the Lord of the whole earth.</li>\n</ul>\n\n<h3>Isaiah 8:10</h3>\n<blockquote class=\"primary-scripture\">Take counsel together, and it shall come to nought; speak the word, and it shall not stand: for God is with us.</blockquote>\n<p>They can plot and plan and form a strategy but it will fail, all your war councils and scheming will be baffled. When the dust settles the last word will be O Immanuel (God with us).</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Psa 33:10-11:</strong> The LORD bringeth the counsel of the heathen to nought: he maketh the devices of the people of none effect. The counsel of the LORD standeth for ever, the thoughts of his heart to all generations.</li>\n  <li><strong>Psa 83:3-5:</strong> They have taken crafty counsel against thy people, and consulted against thy hidden ones. They have said, Come, and let us cut them off from <em>being</em> a nation; that the name of Israel may be no more in remembrance. For they have consulted together with one consent: they are confederate against thee:</li>\n</ul>\n\n<h3>Isaiah 8:11</h3>\n<blockquote class=\"primary-scripture\">For the LORD spake thus to me with a strong hand, and instructed me that I should not walk in the way of this people, saying,</blockquote>\n<p>God grabs Isaiah firmly and makes it clear to him that under no circumstances was he to go along with the thinking of this people.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Jer 20:9:</strong> Then I said, I will not make mention of him, nor speak any more in his name. But <em>his word</em> was in mine heart as a burning fire shut up in my bones, and I was weary with forbearing, and I could not <em>stay.</em></li>\n  <li><strong>Eze 3:14:</strong> So the spirit lifted me up, and took me away, and I went in bitterness, in the heat of my spirit; but the hand of the LORD was strong upon me. Read: Eze 2:6-8</li>\n</ul>\n\n<h3>Isaiah 8:12</h3>\n<blockquote class=\"primary-scripture\">Say ye not, A confederacy, to all them to whom this people shall say, A confederacy; neither fear ye their fear, nor be afraid.</blockquote>\n<p>Don’t panic; don’t fear this confederacy of Israel and Syria. If you are going to fear anything then fear the maker of the Universe. He can be a rock to hide behind or a bolder in the road.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>2Ki 16:5-7:</strong> Then Rezin king of Syria and Pekah son of Remaliah king of Israel came up to Jerusalem to war: and they besieged Ahaz, but could not overcome <em>him.</em> At that time Rezin king of Syria recovered Elath to Syria, and drave the Jews from Elath: and the Syrians came to Elath, and dwelt there unto this day. So Ahaz sent messengers to Tiglathpileser king of Assyria, saying, I <em>am</em> thy servant and thy son: come up, and save me out of the hand of the king of Syria, and out of the hand of the king of Israel, which rise up against me. Read: Psa 53:5; Luk 12:4-5</li>\n</ul>\n\n<h3>Isaiah 8:13</h3>\n<blockquote class=\"primary-scripture\">Sanctify the LORD of hosts himself; and let him be your fear, and let him be your dread.</blockquote>\n<p>Let the peace of God rule your life—fear him that can destroy both body and soul.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Isa 26:3-4:</strong> Thou wilt keep <em>him</em> in perfect peace, <em>whose</em> mind <em>is</em> stayed <em>on thee:</em> because he trusteth in thee. Trust ye in the LORD for ever: for in the LORD JEHOVAH <em>is</em> everlasting strength: Read: Num 27:14; Mal 2:5; Luk 12:5; Rev 15:4</li>\n</ul>\n\n<h3>Isaiah 8:14</h3>\n<blockquote class=\"primary-scripture\">And he shall be for a sanctuary; but for a stone of stumbling and for a rock of offence to both the houses of Israel, for a gin and for a snare to the inhabitants of Jerusalem.</blockquote>\n<p>He can be a shelter from a tornado or a rock impeding your progress he can be a barbed wire fence to get tangled in or a trap to get caught in. In this hour of pearl consecrate yourself to him.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Psa 46:1-2:</strong> To the chief Musician for the sons of Korah, A Song upon Alamoth. God <em>is</em> our refuge and strength, a very present help in trouble. Therefore will not we fear, though the earth be removed, and though the mountains be carried into the midst of the sea; Read: Eze 11:16</li>\n</ul>\n\n<h3>Isaiah 8:15</h3>\n<blockquote class=\"primary-scripture\">And many among them shall stumble, and fall, and be broken, and be snared, and be taken.</blockquote>\n<p>Some are going to fall down, others are going to bruise themselves, and some will be trapped and tangled up in some mesh of their own making.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Luk 20:18:</strong> Whosoever shall fall upon that stone shall be broken; but on whomsoever it shall fall, it will grind him to powder. Read: Mat 15:14; 1Co 1:23</li>\n</ul>\n\n<h3>Isaiah 8:16</h3>\n<blockquote class=\"primary-scripture\">Bind up the testimony, seal the law among my disciples.</blockquote>\n<p>This message given by the prophet was to be rolled up and a leather throng tied around it and placed in a clay cylinder and sealed with wax so that no moisture could penetrate it and it would be preserved for future generations. This message was somehow preserved through war and peace and has reached even me. The prophetic record has been guarded by and entrusted to godly men who have passed it on to future generations.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Isa 29:11:</strong> And the vision of all is become unto you as the words of a book that is sealed, which <em>men</em> deliver to one that is learned, saying, Read this, I pray thee: and he saith, I cannot; for it <em>is</em> sealed:</li>\n  <li><strong>Dan 12:4:</strong> But thou, O Daniel, shut up the words, and seal the book, <em>even</em> to the time of the end: many shall run to and fro, and knowledge shall be increased. Read: Deu 4:45; Rev 5:5; Dan 12:9-10; Mat 13:11; 1Co 2:14</li>\n</ul>\n\n<h3>Isaiah 8:17</h3>\n<blockquote class=\"primary-scripture\">And I will wait upon the LORD, that hideth his face from the house of Jacob, and I will look for him.</blockquote>\n<p>He is waiting on God who is in hiding and while he waits he lives in faith and trust and hope.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Isa 25:9:</strong> And it shall be said in that day, Lo, this <em>is</em> our God; we have waited for him, and he will save us: this <em>is</em> the LORD; we have waited for him, we will be glad and rejoice in his salvation.</li>\n  <li><strong>Isa 33:2:</strong> O LORD, be gracious unto us; we have waited for thee: be thou their arm every morning, our salvation also in the time of trouble. Read: Isa 64:4; Gen 49:18; Psa 27:14</li>\n</ul>\n\n<h3>Isaiah 8:18</h3>\n<blockquote class=\"primary-scripture\">Behold, I and the children whom the LORD hath given me are for signs and for wonders in Israel from the LORD of hosts, which dwelleth in mount Zion.</blockquote>\n<p>Isaiah and his two children who have symbolic names is a sign to that generation. <strong>Isaiah</strong> means Jehovah will save─<strong>Shear-Jashub</strong> means a remnant will return─<strong>Maher-shalal-hash-baz</strong> means your enemies will soon be destroyed.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Isa 8:3:</strong> And I went unto the prophetess; and she conceived, and bare a son. Then said the LORD to me, Call his name Mahershalalhashbaz.</li>\n  <li><strong>Eze 14:8:</strong> And I will set my face against that man, and will make him a sign and a proverb, and I will cut him off from the midst of my people; and ye shall know that I <em>am</em> the LORD.</li>\n  <li><strong>Luk 2:34:</strong> And Simeon blessed them, and said unto Mary his mother, Behold, this <em>child</em> is set for the fall and rising again of many in Israel; and for a sign which shall be spoken against;</li>\n</ul>\n\n<h3>Isaiah 8:19</h3>\n<blockquote class=\"primary-scripture\">And when they shall say unto you, Seek unto them that have familiar spirits, and unto wizards that peep, and that mutter: should not a people seek unto their God? for the living to the dead?</blockquote>\n<p>Some were seeking fortune tellers and others were consulting spiritualist and others were claiming to talk to the dead─should not a people seek unto their God? Only one book has the real answers and that is the Word of God.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Isa 19:3:</strong> And the spirit of Egypt shall fail in the midst thereof; and I will destroy the counsel thereof: and they shall seek to the idols, and to the charmers, and to them that have familiar spirits, and to the wizards.</li>\n  <li><strong>Lev 20:6:</strong> And the soul that turneth after such as have familiar spirits, and after wizards, to go a whoring after them, I will even set my face against that soul, and will cut him off from among his people. Read: Deu 18:10-11; 1Sa 28:8; 1Ch 10:13; 2Ch 33:6</li>\n</ul>\n\n<h3>Isaiah 8:20</h3>\n<blockquote class=\"primary-scripture\">To the law and to the testimony: if they speak not according to this word, it is because there is no light in them.</blockquote>\n<p>Check the witch’s word or the mediums and see that there is no dawn of hope in what they say. There is one document that holds out hope to a lost world and that hope come beaming in through the light of the world.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Luk 10:26:</strong> He said unto him, What is written in the law? how readest thou? Read: Luk 16:29-31; Joh 5:39; Joh 5:46; Joh 5:47; Act 17:11; 2Ti 3:15-17; Isa 30:8-11; Psa 19:7; Psa 119:130; Jer 8:9; Mic 3:6; Pro 4:18</li>\n</ul>\n\n<h3>Isaiah 8:21</h3>\n<blockquote class=\"primary-scripture\">And they shall pass through it, hardly bestead and hungry: and it shall come to pass, that when they shall be hungry, they shall fret themselves, and curse their king and their God, and look upward.</blockquote>\n<p>Their life in captivity was sad beyond understanding. All the joy had gone from their heart and they were so heartsick that they couldn’t see through the tears. Catastrophe had struck them and their whole world had fallen apart.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Deu 28:33-34:</strong> The fruit of thy land, and all thy labours, shall a nation which thou knowest not eat up; and thou shalt be only oppressed and crushed alway: So that thou shalt be mad for the sight of thine eyes which thou shalt see. Read: Deu 28:53-57; 2Ki 25:3; Jer 14:18; Jer 52:6; Lam 4:4-5; Lam 4:9-10; Rev 9:20-21</li>\n</ul>\n\n<h3>Isaiah 8:22</h3>\n<blockquote class=\"primary-scripture\">And they shall look unto the earth; and behold trouble and darkness, dimness of anguish; and they shall be driven to darkness.</blockquote>\n<p>As they pass thru hard times, depressed and hungry they will fret and curse God and the king and they will look toward heaven and receive no help and look to the earth and see distress, misery and gloom. They will live a life of despondency and despair from which there is no way out. They were living in a black hole from which there was no escape.</p>\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Isa 5:30:</strong> And in that day they shall roar against them like the roaring of the sea: and if <em>one</em> look unto the land, behold darkness <em>and</em> sorrow, and the light is darkened in the heavens thereof.</li>\n  <li><strong>2Ch 15:5-6:</strong> And in those times <em>there was</em> no peace to him that went out, nor to him that came in, but great vexations <em>were</em> upon all the inhabitants of the countries. And nation was destroyed of nation, and city of city: for God did vex them with all adversity. Read: Jer 13:16; Jer 23:12</li>\n</ul>",
  "faq": [
    {
      "question": "What is the symbolic meaning of the name Maher-shalal-hash-baz?",
      "answer": "According to the commentary, the name means 'Speed-spoil-hurry-prey,' serving as a sign that the riches of Damascus and Samaria would be taken by Assyria before the child was two years old."
    },
    {
      "question": "What do the 'waters of Shiloah' represent in this chapter?",
      "answer": "The waters of Shiloah represent God's gentle care. The commentary notes that because the people rejected these waters in favor of alliances, God would instead bring the overwhelming 'flood' of the Assyrian army."
    },
    {
      "question": "How does the commentary advise believers regarding familiar spirits and wizards?",
      "answer": "The commentary explicitly warns against consulting spiritualists or the dead. It argues that there is no light in them and that people should instead seek their God through 'the law and the testimony' (the Word of God)."
    },
    {
      "question": "What is the consequence of rejecting the 'law and the testimony'?",
      "answer": "The text states that those who reject God's word will face 'trouble and darkness, dimness of anguish.' They will end up cursing their king and God while living in a state of despondency and despair with no escape."
    }
  ],
  "structuredData": [
    {
      "@context": "https://schema.org",
      "@type": "Article",
      "headline": "The Sign of the Son and the Coming Assyrian Flood",
      "description": "Isaiah’s son stands as a sign of judgment. Rejecting the gentle waters of Shiloah brings the Assyrian flood. Seek the Law and Testimony, for occultism leads only to darkness.",
      "author": {
        "@type": "Person",
        "name": "Lewis P. Hussell"
      },
      "about": [
        {
          "@type": "Person",
          "name": "Maher-shalal-hash-baz",
          "description": "Isaiah's son, whose name means 'Speed-spoil-hurry-prey' and serves as a sign of the imminent fall of Damascus and Samaria.",
          "sameAs": "https://en.wikipedia.org/wiki/Maher-shalal-hash-baz"
        },
        {
          "@type": "Thing",
          "name": "Waters of Shiloah",
          "description": "Symbolic representation of God's gentle care and provision, which the people rejected in favor of political alliances.",
          "sameAs": "https://en.wikipedia.org/wiki/Pool_of_Siloam"
        },
        {
          "@type": "Person",
          "name": "King of Assyria",
          "description": "The ruler whose army is depicted as an overflowing river that will flood the land of Israel and Judah.",
          "sameAs": "https://en.wikipedia.org/wiki/Assyria"
        },
        {
          "@type": "Thing",
          "name": "Law and Testimony",
          "description": "The Word of God, described as the only source of light and truth in contrast to the darkness of occult practices.",
          "sameAs": "https://en.wikipedia.org/wiki/Hebrew_Bible"
        },
        {
          "@type": "CreativeWork",
          "name": "Isaiah"
        },
        {
          "@type": "CreativeWork",
          "name": "Chapter 8"
        }
      ],
      "keywords": "Isaiah's children as prophetic signs, Maher-shalal-hash-baz meaning, Assyrian army as a flood metaphor, Waters of Shiloah symbolism, God as a sanctuary and stumbling stone, Seeking God vs familiar spirits, Symbolic names in Isaiah 8"
    },
    {
      "@context": "https://schema.org",
      "@type": "FAQPage",
      "mainEntity": [
        {
          "@type": "Question",
          "name": "What is the symbolic meaning of the name Maher-shalal-hash-baz?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "According to the commentary, the name means 'Speed-spoil-hurry-prey,' serving as a sign that the riches of Damascus and Samaria would be taken by Assyria before the child was two years old."
          }
        },
        {
          "@type": "Question",
          "name": "What do the 'waters of Shiloah' represent in this chapter?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The waters of Shiloah represent God's gentle care. The commentary notes that because the people rejected these waters in favor of alliances, God would instead bring the overwhelming 'flood' of the Assyrian army."
          }
        },
        {
          "@type": "Question",
          "name": "How does the commentary advise believers regarding familiar spirits and wizards?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The commentary explicitly warns against consulting spiritualists or the dead. It argues that there is no light in them and that people should instead seek their God through 'the law and the testimony' (the Word of God)."
          }
        },
        {
          "@type": "Question",
          "name": "What is the consequence of rejecting the 'law and the testimony'?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The text states that those who reject God's word will face 'trouble and darkness, dimness of anguish.' They will end up cursing their king and God while living in a state of despondency and despair with no escape."
          }
        }
      ]
    },
    {
      "@context": "https://schema.org",
      "@type": "BreadcrumbList",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://4thewordofgod.com/"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Commentaries",
          "item": "https://4thewordofgod.com/commentaries/"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Isaiah",
          "item": "https://4thewordofgod.com/commentaries/isaiah"
        },
        {
          "@type": "ListItem",
          "position": 4,
          "name": "Chapter 8",
          "item": "https://4thewordofgod.com/commentaries/isaiah/8"
        }
      ]
    }
  ],
  "metaDescription": "Isaiah’s son stands as a sign of judgment. Rejecting the gentle waters of Shiloah brings the Assyrian flood. Seek the Law and Testimony, for occultism leads only to darkness.",
  "keywords": [
    "Isaiah's children as prophetic signs",
    "Maher-shalal-hash-baz meaning",
    "Assyrian army as a flood metaphor",
    "Waters of Shiloah symbolism",
    "God as a sanctuary and stumbling stone",
    "Seeking God vs familiar spirits",
    "Symbolic names in Isaiah 8"
  ],
  "previous_chapter": "isaiah_07",
  "next_chapter": "isaiah_09"
}