{
  "book_name": "Isaiah",
  "chapter_number": "66",
  "title": "The Birth of a Nation and True Worship",
  "content": "<p>Heaven is God’s throne─no house on earth can compare. God was not looking for a house, he was looking for a <strong>humble man who trembles at his word</strong>. They sacrificed, held meetings, observed Sabbaths, new moons and appointed feasts─God hated every minute of it─what he wanted was a person who did justice, loved mercy and walked humbly with him. God had called this self serving─self centered bunch but they never answered─just ignored the prophets. Those who listen and stand in awe will be hated and rejected because of their loyalty.</p>\n<p>The prophet launches into a discourse on birth and then tells us that <strong>Israel was born in one day</strong>. When a woman gives birth there is rejoicing so also when this new nation was born. Israel was nurtured in Babylon and like a baby getting its nourishment from its mothers breast Israel got its nourishment from Persia. The prophet says that she would suck the breast of kings─they furnished her everything to rebuild with. She was being breast fed by all nations-─from Spain to Syria─from Media to Mesopotamia─from Assyria to Asia. After World War II she comes back to her homeland and sucks the breast of Europe─she is still sucking the breast of America as we send her billions of dollars and arms and the latest technology. This river of prosperity continued to flow. When you feast your eyes on the scriptures regarding the birth of this nation your whole frame will be as vigorous as fresh grass in early spring. God is going to send as missionaries to Spain, Lydia, Russia, Africa, Turkey and far off islands and they will tell his glory to the nations─they will return with the exiles on dromedaries, horses, sleds, mules, and ships. Some of those who return will become priests and assistants. As they leave the gates of Jerusalem they will pass a cemetery where the enemies of God are buried.</p>\n\n<h2>Witnessing the Miraculous Birth of a Nation and True Worship</h2>\n\n<h3>Isaiah 66:1</h3>\n<blockquote class=\"primary-scripture\">Thus saith the LORD, The heaven is my throne, and the earth is my footstool: where is the house that ye build unto me? and where is the place of my rest?</blockquote>\n<p>Heaven is the seat of God’s power. Where will you build me a house? What temple can you build me that would compare with what I have?</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>2Ch 36:22-23</strong> Now in the first year of Cyrus king of Persia, that the word of the LORD <em>spoken</em> by the mouth of Jeremiah might be accomplished, the LORD stirred up the spirit of Cyrus king of Persia, that he made a proclamation throughout all his kingdom, and <em>put it</em> also in writing, saying, Thus saith Cyrus king of Persia, All the kingdoms of the earth hath the LORD God of heaven given me; and he hath charged me to build him an house in Jerusalem, which <em>is</em> in Judah. Who <em>is there</em> among you of all his people? The LORD his God <em>be</em> with him, and let him go up.</li>\n</ul>\n\n<h3>Isaiah 66:2</h3>\n<blockquote class=\"primary-scripture\">For all those things hath mine hand made, and all those things have been, saith the LORD: but to this man will I look, even to him that is poor and of a contrite spirit, and trembleth at my word.</blockquote>\n<p>God says that he owns it all and made it all. What God is looking for is a <strong>humble man that trembles at his word</strong>.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 42:16</strong> And I will bring the blind by a way <em>that</em> they knew not; I will lead them in paths <em>that</em> they have not known: I will make darkness light before them, and crooked things straight. These things will I do unto them, and not forsake them.</li>\n<li><strong>Psa 107:16</strong> For he hath broken the gates of brass, and cut the bars of iron in sunder.</li>\n</ul>\n\n<h3>Isaiah 66:3</h3>\n<blockquote class=\"primary-scripture\">He that killeth an ox is as if he slew a man; he that sacrificeth a lamb, as if he cut off a dog's neck; he that offereth an oblation, as if he offered swine's blood; he that burneth incense, as if he blessed an idol. Yea, they have chosen their own ways, and their soul delighteth in their abominations.</blockquote>\n<p>Slaughtering animals or sacrificing a lamb without reverence for God and his word was to no purpose─their solemn meetings, Sabbaths and new moons, calling of assemblies, and appointed feasts was like smoke in one’s eyes. What God wanted was a person who did justice, loved mercy and walked humbly with him.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Jer 27:5-7</strong> I have made the earth, the man and the beast that <em>are</em> upon the ground, by my great power and by my outstretched arm, and have given it unto whom it seemed meet unto me. And now have I given all these lands into the hand of Nebuchadnezzar the king of Babylon, my servant; and the beasts of the field have I given him also to serve him. And all nations shall serve him, and his son, and his son's son, until the very time of his land come: and then many nations and great kings shall serve themselves of him.</li>\n<li><strong>Jer 50:37</strong> A sword <em>is</em> upon their horses, and upon their chariots, and upon all the mingled people that <em>are</em> in the midst of her; and they shall become as women: a sword <em>is</em> upon her treasures; and they shall be robbed.</li>\n<li><strong>Ezr 1:2</strong> Thus saith Cyrus king of Persia, The LORD God of heaven hath given me all the kingdoms of the earth; and he hath charged me to build him an house at Jerusalem, which <em>is</em> in Judah.</li>\n</ul>\n\n<h3>Isaiah 66:4</h3>\n<blockquote class=\"primary-scripture\">I also will choose their delusions, and will bring their fears upon them; because when I called, none did answer; when I spake, they did not hear: but they did evil before mine eyes, and chose that in which I delighted not.</blockquote>\n<p>This deluded bunch had chose nonsense─it was a self-serving, self centered worship that lacked the real ingredient. God had called and called and called─no answer─no return call─they just ignored the prophets.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Exo 19:5</strong> Now therefore, if ye will obey my voice indeed, and keep my covenant, then ye shall be a peculiar treasure unto me above all people: for all the earth <em>is</em> mine:</li>\n<li><strong>Jer 50:17-20</strong> Israel <em>is</em> a scattered sheep; the lions have driven <em>him</em> away: first the king of Assyria hath devoured him; and last this Nebuchadrezzar king of Babylon hath broken his bones. Therefore thus saith the LORD of hosts, the God of Israel; Behold, I will punish the king of Babylon and his land, as I have punished the king of Assyria. And I will bring Israel again to his habitation, and he shall feed on Carmel and Bashan, and his soul shall be satisfied upon mount Ephraim and Gilead. In those days, and in that time, saith the LORD, the iniquity of Israel shall be sought for, and <em>there shall be</em> none; and the sins of Judah, and they shall not be found: for I will pardon them whom I reserve.</li>\n<li><strong>Isa 46:9</strong> Remember the former things of old: for I <em>am</em> God, and <em>there is</em> none else; <em>I am</em> God, and <em>there is</em> none like me,</li>\n<li><strong>Deu 32:39</strong> See now that I, <em>even</em> I, <em>am</em> he, and <em>there is</em> no god with me: I kill, and I make alive; I wound, and I heal: neither <em>is there any</em> that can deliver out of my hand.</li>\n<li><strong>Job 12:18</strong> He looseth the bond of kings, and girdeth their loins with a girdle.</li>\n</ul>\n\n<h3>Isaiah 66:5</h3>\n<blockquote class=\"primary-scripture\">Hear the word of the LORD, ye that tremble at his word; Your brethren that hated you, that cast you out for my name's sake, said, Let the LORD be glorified: but he shall appear to your joy, and they shall be ashamed.</blockquote>\n<p>Those who anxiously listen and stand in awe at his word and tremble at his word will be hated and rejected─they will cast you out because you are loyal to my name.</p>\n\n<h3>Isaiah 66:6</h3>\n<blockquote class=\"primary-scripture\">A voice of noise from the city, a voice from the temple, a voice of the LORD that rendereth recompence to his enemies.</blockquote>\n<p>The prophet tells them that he can already hear the tumult─it was a city in uproar─it was the thunderous voice coming from the temple. It was God rendering recompense upon his foes.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Mal 1:11</strong> For from the rising of the sun even unto the going down of the same my name <em>shall be</em> great among the Gentiles; and in every place incense <em>shall be</em> offered unto my name, and a pure offering: for my name <em>shall be</em> great among the heathen, saith the LORD of hosts.</li>\n</ul>\n\n<h3>Isaiah 66:7</h3>\n<blockquote class=\"primary-scripture\">Before she travailed, she brought forth; before her pain came, she was delivered of a man child.</blockquote>\n<p>Long before the labor pains came on she gives birth to a child. Has anyone seen anything as strange as this?</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Jer 18:7-9</strong> <em>At what</em> instant I shall speak concerning a nation, and concerning a kingdom, to pluck up, and to pull down, and to destroy <em>it;</em> If that nation, against whom I have pronounced, turn from their evil, I will repent of the evil that I thought to do unto them. And <em>at what</em> instant I shall speak concerning a nation, and concerning a kingdom, to build and to plant <em>it;</em></li>\n<li><strong>Jer 51:20</strong> Thou <em>art</em> my battle axe <em>and</em> weapons of war: for with thee will I break in pieces the nations, and with thee will I destroy kingdoms;</li>\n<li><strong>Amo 3:6</strong> Shall a trumpet be blown in the city, and the people not be afraid? shall there be evil in a city, and the LORD hath not done <em>it?</em></li>\n</ul>\n\n<h3>Isaiah 66:8</h3>\n<blockquote class=\"primary-scripture\">Who hath heard such a thing? who hath seen such things? Shall the earth be made to bring forth in one day? or shall a nation be born at once? for as soon as Zion travailed, she brought forth her children.</blockquote>\n<p>Who ever heard of a woman having a child without labor pains? But, in one day, suddenly, a nation, Israel, is born, even before the birth pains set in. Was there ever a nation born in a day? Was there ever a country that came into existence in an instant? <strong>Israel became a country in a day</strong> at the end of Babylonian captivity. She was born without labor pains! In an instant, Zion is born; the nation begins.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 44:3</strong> For I will pour water upon him that is thirsty, and floods upon the dry ground: I will pour my spirit upon thy seed, and my blessing upon thine offspring:</li>\n<li><strong>Isa 61:3</strong> To appoint unto them that mourn in Zion, to give unto them beauty for ashes, the oil of joy for mourning, the garment of praise for the spirit of heaviness; that they might be called trees of righteousness, the planting of the LORD, that he might be glorified.</li>\n</ul>\n\n<h3>Isaiah 66:9</h3>\n<blockquote class=\"primary-scripture\">Shall I bring to the birth, and not cause to bring forth? saith the LORD: shall I cause to bring forth, and shut the womb? saith thy God.</blockquote>\n<p>God asks─should I bring to the birth (the full time of gestation) and not have the baby delivered? No! No! Never!</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 10:15</strong> Shall the axe boast itself against him that heweth therewith? <em>or</em> shall the saw magnify itself against him that shaketh it? as if the rod should shake <em>itself</em> against them that lift it up, <em>or</em> as if the staff should lift up <em>itself, as if it were</em> no wood.</li>\n</ul>\n\n<h3>Isaiah 66:10</h3>\n<blockquote class=\"primary-scripture\">Rejoice ye with Jerusalem, and be glad with her, all ye that love her: rejoice for joy with her, all ye that mourn for her:</blockquote>\n<p>Rejoice─when a woman gives birth it is a time of rejoicing, singing, celebrating and jubilation. It was a time of congratulations, hugging and dancing─its hip-hip-hurrah! Three cheers.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Mal 1:6</strong> A son honoureth <em>his</em> father, and a servant his master: if then I <em>be</em> a father, where <em>is</em> mine honour? and if I <em>be</em> a master, where <em>is</em> my fear? saith the LORD of hosts unto you, O priests, that despise my name. And ye say, Wherein have we despised thy name?</li>\n</ul>\n\n<h3>Isaiah 66:11</h3>\n<blockquote class=\"primary-scripture\">That ye may suck, and be satisfied with the breasts of her consolations; that ye may milk out, and be delighted with the abundance of her glory.</blockquote>\n<p>What a picture, a newborn sucking at its mother’s breast for nourishment. When Israel left Babylon they went to Persia and were nurtured there while the proper preparations were made for her to return to her homeland. When she finally returns she is <strong>sucking the breast of all the nations</strong> as she is furnished everything to rebuild the walls and cities. She was being breast-fed by all nations─from Spain to Syria, from Media to Mesopotamia, from Assyria to Asia. After World War II when she comes back to her homeland she sucks the breast of Europe, and she is still sucking the breast of America. We send her billions of dollars and share the latest technology.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Jer 33:3</strong> Call unto me, and I will answer thee, and shew thee great and mighty things, which thou knowest not.</li>\n<li><strong>Dan 9:2-3</strong> In the first year of his reign I Daniel understood by books the number of the years, whereof the word of the LORD came to Jeremiah the prophet, that he would accomplish seventy years in the desolations of Jerusalem. And I set my face unto the Lord God, to seek by prayer and supplications, with fasting, and sackcloth, and ashes:</li>\n<li><strong>Eph 2:10</strong> For we are his workmanship, created in Christ Jesus unto good works, which God hath before ordained that we should walk in them.</li>\n</ul>\n\n<h3>Isaiah 66:12</h3>\n<blockquote class=\"primary-scripture\">For thus saith the LORD, Behold, I will extend peace to her like a river, and the glory of the Gentiles like a flowing stream: then shall ye suck, ye shall be borne upon her sides, and be dandled upon her knees.</blockquote>\n<p>The picture continues─its peace like a river─and the glory of the Gentiles flowing like a stream to Israel─Israel is still sucking the prosperity and riches of Gentile nations─it’s a river of prosperity that is flowing to her. A child gets comfort from being dandled upon its mother’s knee and fondled on a mother’s lap.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 40:12</strong> Who hath measured the waters in the hollow of his hand, and meted out heaven with the span, and comprehended the dust of the earth in a measure, and weighed the mountains in scales, and the hills in a balance?</li>\n</ul>\n\n<h3>Isaiah 66:13</h3>\n<blockquote class=\"primary-scripture\">As one whom his mother comforteth, so will I comfort you; and ye shall be comforted in Jerusalem.</blockquote>\n<p>God says he will console Israel like a mother caressing her son.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 52:2-3</strong> Shake thyself from the dust; arise, <em>and</em> sit down, O Jerusalem: loose thyself from the bands of thy neck, O captive daughter of Zion. For thus saith the LORD, Ye have sold yourselves for nought; and ye shall be redeemed without money.</li>\n<li>Read: <strong>Isa 48:14-15; Isa 44:28</strong></li>\n</ul>\n\n<h3>Isaiah 66:14</h3>\n<blockquote class=\"primary-scripture\">And when ye see this, your heart shall rejoice, and your bones shall flourish like an herb: and the hand of the LORD shall be known toward his servants, and his indignation toward his enemies.</blockquote>\n<p>Feast your eyes on what the scriptures teach regarding Israel being born and you will rejoice and your whole frame will be a vigorous as fresh grass in early spring.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 49:23</strong> And kings shall be thy nursing fathers, and their queens thy nursing mothers: they shall bow down to thee with <em>their</em> face toward the earth, and lick up the dust of thy feet; and thou shalt know that I <em>am</em> the LORD: for they shall not be ashamed that wait for me.</li>\n<li><strong>Psa 149:8</strong> To bind their kings with chains, and their nobles with fetters of iron; To execute upon them the judgment written: this honour have all his saints. Praise ye the LORD.</li>\n<li>Read: <strong>Isa 19:23-25; Isa 61:5-6</strong></li>\n</ul>\n\n<h3>Isaiah 66:15</h3>\n<blockquote class=\"primary-scripture\">For, behold, the LORD will come with fire, and with his chariots like a whirlwind, to render his anger with fury, and his rebuke with flames of fire.</blockquote>\n<p>God is coming with the fire of his anger─he will attack like a tornado─it is the <strong>fire of judgment</strong> against his enemies.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 8:17</strong> And I will wait upon the LORD, that hideth his face from the house of Jacob, and I will look for him.</li>\n</ul>\n\n<h3>Isaiah 66:16</h3>\n<blockquote class=\"primary-scripture\">For by fire and by his sword will the LORD plead with all flesh: and the slain of the LORD shall be many.</blockquote>\n<p>God will have a purging of the world─the victims will be many─this purging took place when God sent Cyrus to conquer the world which was under God’s judgment.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 42:17</strong> They shall be turned back, they shall be greatly ashamed, that trust in graven images, that say to the molten images, Ye <em>are</em> our gods.</li>\n<li><strong>Jer 10:14-15</strong> Every man is brutish in <em>his</em> knowledge: every founder is confounded by the graven image: for his molten image <em>is</em> falsehood, and <em>there is</em> no breath in them. They are vanity, and the work of errors: in the time of their visitation they shall perish.</li>\n</ul>\n\n<h3>Isaiah 66:17</h3>\n<blockquote class=\"primary-scripture\">They that sanctify themselves, and purify themselves in the gardens behind one tree in the midst, eating swine's flesh, and the abomination, and the mouse, shall be consumed together, saith the LORD.</blockquote>\n<p>God says that the people who are gathering in these sacred groves and engaging in rituals of eating swine flesh and mice and other abominations are living under a death sentence. Everyone who gathers in the sacred groves and are initiated into the idol religion by these rituals are going to die together.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Joe 2:26-27</strong> And ye shall eat in plenty, and be satisfied, and praise the name of the LORD your God, that hath dealt wondrously with you: and my people shall never be ashamed. And ye shall know that I <em>am</em> in the midst of Israel, and <em>that</em> I <em>am</em> the LORD your God, and none else: and my people shall never be ashamed.</li>\n</ul>\n\n<h3>Isaiah 66:18</h3>\n<blockquote class=\"primary-scripture\">For I know their works and their thoughts: it shall come, that I will gather all nations and tongues; and they shall come, and see my glory.</blockquote>\n<p>God says he knows what they are doing and what they are thinking and that he is going to gather all nations and tongues to Jerusalem and they will witness his display of glory and might.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Jer 10:12</strong> He hath made the earth by his power, he hath established the world by his wisdom, and hath stretched out the heavens by his discretion.</li>\n<li><strong>Psa 115:16</strong> The heaven, <em>even</em> the heavens, <em>are</em> the LORD'S: but the earth hath he given to the children of men.</li>\n</ul>\n\n<h3>Isaiah 66:19</h3>\n<blockquote class=\"primary-scripture\">And I will set a sign among them, and I will send those that escape of them unto the nations, to Tarshish, Pul, and Lud, that draw the bow, to Tubal, and Javan, to the isles afar off, that have not heard my fame, neither have seen my glory; and they shall declare my glory among the Gentiles.</blockquote>\n<p>Those who survive his judgment will be sent as missionaries to Spain, Lydia, Russia, Africa, Turkey and far off islands. They will tell my glory among the nations.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Deu 29:29</strong> The secret <em>things belong</em> unto the LORD our God: but those <em>things which are</em> revealed <em>belong</em> unto us and to our children for ever, that <em>we</em> may do all the words of this law.</li>\n<li><strong>Isa 55:6-7</strong> Seek ye the LORD while he may be found, call ye upon him while he is near: Let the wicked forsake his way, and the unrighteous man his thoughts: and let him return unto the LORD, and he will have mercy upon him; and to our God, for he will abundantly pardon.</li>\n</ul>\n\n<h3>Isaiah 66:20</h3>\n<blockquote class=\"primary-scripture\">And they shall bring all your brethren for an offering unto the LORD out of all nations upon horses, and in chariots, and in litters, and upon mules, and upon swift beasts, to my holy mountain Jerusalem, saith the LORD, as the children of Israel bring an offering in a clean vessel into the house of the LORD.</blockquote>\n<p>They will return with exiles on dromedaries, horses, sleds, liters and mules and war ships. Their return will be like bringing an offering to the temple.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 41:5</strong> The isles saw <em>it,</em> and feared; the ends of the earth were afraid, drew near, and came. They helped every one his neighbour; and <em>every one</em> said to his brother, Be of good courage.</li>\n</ul>\n\n<h3>Isaiah 66:21</h3>\n<blockquote class=\"primary-scripture\">And I will also take of them for priests and for Levites, saith the LORD.</blockquote>\n<p>Some of the returning exiles who were the priestly tribe became priests and assistants.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 41:1-4</strong> Keep silence before me, O islands; and let the people renew <em>their</em> strength: let them come near; then let them speak: let us come near together to judgment. Who raised up the righteous <em>man</em> from the east, called him to his foot, gave the nations before him, and made <em>him</em> rule over kings? he gave <em>them</em> as the dust to his sword, <em>and</em> as driven stubble to his bow. He pursued them, <em>and</em> passed safely; <em>even</em> by the way <em>that</em> he had not gone with his feet. Who hath wrought and done <em>it,</em> calling the generations from the beginning? I the LORD, the first, and with the last; I <em>am</em> he.</li>\n</ul>\n\n<h3>Isaiah 66:22</h3>\n<blockquote class=\"primary-scripture\">For as the new heavens and the new earth, which I will make, shall remain before me, saith the LORD, so shall your seed and your name remain.</blockquote>\n<p>God calls this a <strong>new heaven and a new earth</strong>. In a book written by Cecil Roth he describes the phenomenon as a New World and a Resurrection.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 41:22-23</strong> Let them bring <em>them</em> forth, and shew us what shall happen: let them shew the former things, what they <em>be,</em> that we may consider them, and know the latter end of them; or declare us things for to come. Shew the things that are to come hereafter, that we may know that ye <em>are</em> gods: yea, do good, or do evil, that we may be dismayed, and behold <em>it</em> together.</li>\n</ul>\n\n<h3>Isaiah 66:23</h3>\n<blockquote class=\"primary-scripture\">And it shall come to pass, that from one new moon to another, and from one sabbath to another, shall all flesh come to worship before me, saith the LORD.</blockquote>\n<p>From month to month and week to week all mankind will come to worship me.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Gen 22:15-17</strong> And the angel of the LORD called unto Abraham out of heaven the second time, And said, By myself have I sworn, saith the LORD, for because thou hast done this thing, and hast not withheld thy son, thine only <em>son:</em> That in blessing I will bless thee, and in multiplying I will multiply thy seed as the stars of the heaven, and as the sand which <em>is</em> upon the sea shore; and thy seed shall possess the gate of his enemies;</li>\n</ul>\n\n<h3>Isaiah 66:24</h3>\n<blockquote class=\"primary-scripture\">And they shall go forth, and look upon the carcases of the men that have transgressed against me: for their worm shall not die, neither shall their fire be quenched; and they shall be an abhorring unto all flesh.</blockquote>\n<p>As they leave the gates of Jerusalem they will pass the cemetery where the enemies of God have been buried. Worms that never die and fires never quenched is a picture of the horror that these leaders brought on their people. The memory of these worms lives on in infamy. What they did will seethe and smolder as long as time goes on. The atrocities of men like Hitler and Stalin and Roman rulers will always be remembered and will burn and burn and burn in our memory.</p>\n<h4>Cross References</h4>\n<ul>\n<li><strong>Isa 54:17</strong> No weapon that is formed against thee shall prosper; and every tongue <em>that</em> shall rise against thee in judgment thou shalt condemn. This <em>is</em> the heritage of the servants of the LORD, and their righteousness <em>is</em> of me, saith the LORD.</li>\n<li><strong>Zec 10:12</strong> And I will strengthen them in the LORD; and they shall walk up and down in his name, saith the LORD.</li>\n<li><strong>Isa 60:9</strong> Surely the isles shall wait for me, and the ships of Tarshish first, to bring thy sons from far, their silver and their gold with them, unto the name of the LORD thy God, and to the Holy One of Israel, because he hath glorified thee.</li>\n</ul>",
  "faq": [
    {
      "question": "What type of person is God looking for according to the commentary?",
      "answer": "God is not looking for a physical house or temple, but rather for a humble man who is poor, of a contrite spirit, and trembles at His word."
    },
    {
      "question": "How does the text explain the birth of the nation of Israel?",
      "answer": "The commentary describes Israel as being born in one day, suddenly and without labor pains, comparing this to the nation's emergence at the end of the Babylonian captivity."
    },
    {
      "question": "What historical analogy is used to explain Israel 'sucking the breast of kings'?",
      "answer": "The commentary compares Israel receiving nourishment from Persia after Babylon to receiving aid from Europe and America (billions of dollars and technology) after World War II."
    },
    {
      "question": "What is the significance of the 'worm that shall not die' in verse 24?",
      "answer": "It represents the enduring infamy of leaders who brought horror to their people; the commentary specifically cites the atrocities of Hitler, Stalin, and Roman rulers as memories that will always burn."
    }
  ],
  "structuredData": [
    {
      "@context": "https://schema.org",
      "@type": "Article",
      "headline": "The Birth of a Nation and True Worship",
      "description": "God seeks a humble man, not empty rituals. Witness Israel born in a day without labor, nurtured by nations, while judgment falls on enemies with unquenchable fire.",
      "author": {
        "@type": "Person",
        "name": "Lewis P. Hussell"
      },
      "about": [
        {
          "@type": "Thing",
          "name": "Zion",
          "description": "The nation of Israel, described as being born in a single day.",
          "sameAs": "https://en.wikipedia.org/wiki/Zion"
        },
        {
          "@type": "Person",
          "name": "Cyrus",
          "description": "King of Persia who was stirred by God to build a house in Jerusalem.",
          "sameAs": "https://en.wikipedia.org/wiki/Cyrus_the_Great"
        },
        {
          "@type": "Place",
          "name": "Babylon",
          "description": "The location where Israel was nurtured before returning to their homeland.",
          "sameAs": "https://en.wikipedia.org/wiki/Babylon"
        },
        {
          "@type": "Thing",
          "name": "New Heavens and New Earth",
          "description": "The creation God promises to make, where the seed and name of the faithful shall remain.",
          "sameAs": "https://en.wikipedia.org/wiki/New_Earth_(Christianity)"
        },
        {
          "@type": "CreativeWork",
          "name": "Isaiah"
        },
        {
          "@type": "CreativeWork",
          "name": "Chapter 66"
        }
      ],
      "keywords": "Israel born in one day, humble man who trembles at his word, sucking the breast of all the nations, self-serving self centered worship, Israel sucking the breast of America, fire of judgment against his enemies, missionaries to Spain, Lydia, Russia"
    },
    {
      "@context": "https://schema.org",
      "@type": "FAQPage",
      "mainEntity": [
        {
          "@type": "Question",
          "name": "What type of person is God looking for according to the commentary?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "God is not looking for a physical house or temple, but rather for a humble man who is poor, of a contrite spirit, and trembles at His word."
          }
        },
        {
          "@type": "Question",
          "name": "How does the text explain the birth of the nation of Israel?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The commentary describes Israel as being born in one day, suddenly and without labor pains, comparing this to the nation's emergence at the end of the Babylonian captivity."
          }
        },
        {
          "@type": "Question",
          "name": "What historical analogy is used to explain Israel 'sucking the breast of kings'?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The commentary compares Israel receiving nourishment from Persia after Babylon to receiving aid from Europe and America (billions of dollars and technology) after World War II."
          }
        },
        {
          "@type": "Question",
          "name": "What is the significance of the 'worm that shall not die' in verse 24?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "It represents the enduring infamy of leaders who brought horror to their people; the commentary specifically cites the atrocities of Hitler, Stalin, and Roman rulers as memories that will always burn."
          }
        }
      ]
    },
    {
      "@context": "https://schema.org",
      "@type": "BreadcrumbList",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://4thewordofgod.com/"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Commentaries",
          "item": "https://4thewordofgod.com/commentaries/"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Isaiah",
          "item": "https://4thewordofgod.com/commentaries/isaiah"
        },
        {
          "@type": "ListItem",
          "position": 4,
          "name": "Chapter 66",
          "item": "https://4thewordofgod.com/commentaries/isaiah/66"
        }
      ]
    }
  ],
  "metaDescription": "God seeks a humble man, not empty rituals. Witness Israel born in a day without labor, nurtured by nations, while judgment falls on enemies with unquenchable fire.",
  "keywords": [
    "Israel born in one day",
    "humble man who trembles at his word",
    "sucking the breast of all the nations",
    "self-serving self centered worship",
    "Israel sucking the breast of America",
    "fire of judgment against his enemies",
    "missionaries to Spain, Lydia, Russia"
  ],
  "previous_chapter": "isaiah_65",
  "next_chapter": null
}