{
  "book_name": "Haggai",
  "chapter_number": "01",
  "title": "Rebuilding Jerusalem: The Struggle to Restore the Temple Ruins",
  "content": "<p>In the year 586 BC the city of Jerusalem was reduced to ruins, along with the Temple. The people were led away into captivity (those who weren’t killed), although a few were allowed to remain behind to live in the ruins. They finally moved to Egypt and were not heard from after a generation or so. Many of the Jews returned to their homeland after the captivity but not all wanted to return. The prospect of returning to an impoverished land and attempting to rebuild on the ruins of the past had little appeal. Only a few caught a vision of the pioneer spirit and become serious about the challenges that lay ahead.</p>\n\n<ul>\n  <li><strong>536 BC</strong> ─ the first group of about 50,000 return under Zerubbabel. Joshua, the priest, served as the religious leader of the returned people. Haggai returned with this group ……. See my comments on Ezra 2.</li>\n  <li><strong>457 BC</strong> ─ A second group, led by Ezra, consisting of about 2058 persons, returns. Several reforms are instituted, including the problem of inter-marriage with the nations ……. See my comments on Ezra 8-10.</li>\n  <li><strong>445 BC</strong> ─ A third group, led by Nehemiah, returns. Under his leadership the walls are rebuilt ……. See my comments on Nehemiah 2.</li>\n</ul>\n\n<p>Upon the return of the first group (536 BC) work began on the Temple. The altar of sacrifice was restored and the foundation for the new Temple was laid. However, at this point the people ceased their work. The city and houses and wall were all in ruins, the land had been neglected for 70 years and food was scarce.</p>\n\n<p>Cyrus was succeeded by his son Cambyses (529-522 BC). After this king came Darius I (522-486 BC). Two years into his reign (520 BC), and 16 years after work had ceased on the Temple, God raised up the prophet Haggai “to combat apathy and depression by giving inspired leadership” for the reconstruction of the Temple. In this book that is called by his name you will meet a man of whom I call “God’s cheer leader.”</p>\n\n<h2>HIGHLIGHTS OF HAGGAI</h2>\n<p>God raised up Haggai to challenge the people. It was after the building had stopped that the name of Haggai appears in Ezra (Ezra 4:24, 5:1). The Key word is <strong>CONSIDER</strong> which is repeated 5 times in 38 verses. The expression “The Word Of The Lord” is found 5 times and the statement “Saith The Lord” is quoted 20 times. This makes the book one of authority. 516 BC</p>\n\n<h2>KEYS TO OPEN HAGGAI</h2>\n<p>Like Malachi, Haggai uses a number of questions to highlight key issues (see 1:4,9; 2:3,19). He also makes effective use of repetition: “Give careful thought” occurs in 1:5,7; 2:15,18, and “I am with you” in 1:13; 2:4. “I will shake the heavens and the earth” is found in 2:6,21. The major sections of the book are marked off by the date on which the word of the Lord came “to” (or “through”) Haggai (1:1; 2:1,10,20). Several times the prophet appears to echo other Scriptures (compare Hag 1:6 with Dt 28:38-39 and Hag 2:17 with Dt 28:22). All of these scriptures are quoted in full in the main text to this commentary.</p>\n\n<h2>SURVEY OF THE BOOK</h2>\n<p>The messages of Haggai were given during a four-month period in 520 B.C., the second year of King Darius. The first message was delivered on the first day of the sixth month (Aug. 29), the last on the 24th day of the ninth month.</p>\n<p>Haggai and Zechariah began to preach in the second year of king Darius, 520 B.C. (see 1:1; Zec 1:1). The Jews were more to blame for their inactivity than their opponents, and Haggai tried to arouse them from their lethargy. When the governor of Trans-Euphrates and other officials tried to interfere with the rebuilding efforts, Darius fully supported the Jews (Ezra 5:3-6; 6:6-12). In 516 B.C. the temple was finished and dedicated (Ezra 6:15-18).</p>\n\n<h2>INSPIRATIONAL INTRODUCTION</h2>\n<p>Haggai returned to Jerusalem with the first group of 50,000 persons led by Zerubbabel in 536 BC. It is also possible he did some writing of psalms during this time. Charles Haddon Spurgeon credits Haggai and Zechariah as being the author/co-author of several psalms (Psalms 138, 146-149) and believes that they were written for the occasion of the Temple dedication. Vol. 7 p 383 The prophet dates his own work very precisely. Haggai 1:1 dates it in the “second year of Darius the king.” Thus, the prophecy is dated in the year 520 BC. This book consists of four brief oracles, each of which is precisely dated within this year. They were delivered “between August and the last of November in the year 520 BC”</p>\n\n<h2>MEMORANDUM</h2>\n<p>For two decades the Israelites had ignored God’s strong desire for them to rebuild the temple. When they finally responded and got to work God’s sternness melted immediately. “I am with you,” he told them. The Jews were busy building their own houses and were complaining that:</p>\n<ul>\n  <li>The weather was bad (Haggai 1:10)</li>\n  <li>There was not much to eat or drink (Haggai 1:6)</li>\n  <li>Their money did not buy much (Haggai 1:6)</li>\n</ul>\n<p>God revealed to them that this was not a new plan but that he had planned this more than 1,000 years before when he brought them out of Egypt and that this new temple would be greater than the old one and that his glory would fill it and that the desire of all nations would come to it. Later the Messiah would come to this temple.</p>\n\n<p>This group of exiles had lived in Babylon which is now Iraq. King Cyrus of Persia had conquered the Babylonians and allowed the Jews to return to their homeland. He told them to build their own Temple but they built an altar and foundation for the Temple and then stopped the work for 16 years. In the year of 520 B.C. Haggai told them it was time for them to finish what they had started. Haggai had showed them that God was angry with them. He cited three examples: Inflation─bad crops─bad weather. Haggai inspired them to get busy on the project and within 4 years it was completed.</p>\n\n<h2>Breaking the Sixteen-Year Cycle of Spiritual Apathy</h2>\n\n<h3>Haggai 1:1</h3>\n<blockquote class=\"primary-scripture\">In the second year of Darius the king, in the sixth month, in the first day of the month, came the word of the LORD by Haggai the prophet unto Zerubbabel the son of Shealtiel, governor of Judah, and to Joshua the son of Josedech, the high priest, saying,</blockquote>\n<p>Under the edict of Cyrus, Zerubbabel and Joshua the high priest had led a group of 42,360 (Ezra 2:64) to Jerusalem. Upon their arrival they began building the temple but encountered opposition from the Arabians, Horinites and the Ammonites. Their propaganda was successful in stopping the work, no more work was done in the days of Cyrus, nor yet in the reign of his successors. During this same period the people lost heart and enthusiasm. They had anticipated prosperity and happiness. They had expected peace and plenty. They expected the blessings of God without any problems. Instead they faced ruined buildings, barren land, shortages and a hostile people. Their zeal waned and rebuilding became a matter of indifference. In the meantime some changes occurred: Darius took the throne and obstacles were removed─the original decree was found─every assistance was now offered─only one thing missing, “the will of the people.” God sends Haggai to stir up the people.</p>\n\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Ezr 5:1,2</strong> When the prophets, Haggai the prophet and Zechariah the son of Iddo, prophesied to the Jews who were in Judah and Jerusalem, in the name of the God of Israel, who was over them...</li>\n  <li><strong>Zec 1:1</strong> In the eighth month of the second year of Darius, the word of the LORD came to Zechariah the prophet...</li>\n  <li><strong>Ezr 3:8</strong> Now in the second year of their coming to the house of God at Jerusalem in the second month, Zerubbabel the son of Shealtiel and Jeshua the son of Jozadak... began the work...</li>\n  <li><strong>Zec 4:6-10</strong> Then he answered and said to me, \"This is the word of the LORD to Zerubbabel saying, 'Not by might nor by power, but by My Spirit,' says the LORD of hosts...</li>\n</ul>\n\n<h3>Haggai 1:2</h3>\n<blockquote class=\"primary-scripture\">Thus speaketh the LORD of hosts, saying, This people say, The time is not come, the time that the LORD's house should be built.</blockquote>\n<p>The LORD of everything says, ‘Everybody says that it is not time to build the house of the LORD.’ The word of the LORD came by the prophet Haggai. He said, ‘You are living in good houses, but the house of the LORD is a ruin.’ The LORD of everything says, ‘Think again about what you are doing. You planted many seeds, but not much grew. There is not enough to eat. There is not enough to drink. Your clothes do not keep you warm. Your money bag is full of holes.’ The LORD of everything says: ‘Think again about what you are doing. This is a story of procrastination. Are we putting business, education or recreation or building our own house ahead of the Lords house?</p>\n<ul>\n  <li>A few men build cities─the rest live in them.</li>\n  <li>A few men project subways─the rest ride in them.</li>\n  <li>A few men erect factories─the rest toil in them.</li>\n  <li>A few men dream of foundations and skyscrapers─the rest live in them.</li>\n</ul>\n<p align=\"center\">Remember that cowards never start.<br>The weak die on the way.<br>Only the strong come through!</p>\n<p>Caesar saw Britain─not the grueling marches, treacherous tribes, and danger on every hand between him and his goal. He had an objective and a sense of direction. Napoleon saw Italy but not the Alps. Washington saw the Hessians at Trenton. A smaller man would have seen the ice-filled Delaware. (I Dare You p. 108)</p>\n\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Ezr 4:23,24</strong> Then as soon as the copy of King Artaxerxes' document was read before Rehum and Shimshai the scribe and their colleagues, they went in haste to Jerusalem to the Jews and stopped them by force of arms...</li>\n  <li><strong>Pro 22:13</strong> The sluggard says, \"There is a lion outside; I shall be slain in the streets!\"</li>\n  <li><strong>Ecc 11:4</strong> He who watches the wind will not sow and he who looks at the clouds will not reap.</li>\n</ul>\n\n<h3>Haggai 1:3</h3>\n<blockquote class=\"primary-scripture\">Then came the word of the LORD by Haggai the prophet, saying,</blockquote>\n<p>Haggai was a man of single vision─build the Temple!\" His desire was to see the Temple reconstructed and their worship of God reinstituted. The people had become discouraged and, as a result, forgetful of God. They needed to prioritize their work. They were thinking of themselves─building their own houses, but not His! Haggai was sent as a motivator and edifier─Get your priorities right! Put God first, and He'll take care of your other needs (Matthew 6:33).</p>\n<p>This fired up prophet motivated the people and within three weeks and a few days the people began work on the Temple again.” One of the reasons for his success was his dependence on the Word of the Lord! Twenty-six times (in a book of only 38 verses!) he appeals to God as the authority and source of his message. Such expressions as \"saith the Lord,\" \"declares the Lord of hosts,\" and the like are very common. Haggai knew how to stir the people, move their hearts, and get results. God sent the right man at the right time for the right job. It got results then, and such preaching will get results today! The Temple was completed in 516 BC, twenty years after it was started and seventy years after it was destroyed in 586 BC (Ezra 6:15). This new Temple was desecrated in the time of Antiochus Epiphanies (168 BC), but later cleaned up. It was added on to by Herod the Great. While Ezekiel was in captivity he has a vision of the temple and that is the temple that is being rebuilt by Zerubbabel. It was essentially this same Temple that Jesus and the apostles entered time and again during their ministries.</p>\n\n<h3>Haggai 1:4</h3>\n<blockquote class=\"primary-scripture\">Is it time for you, O ye, to dwell in your cieled houses, and this house lie waste?</blockquote>\n<p>They had become self-centered, satisfied with their own house, garden, and own pleasure. They had been back for 20 years and had made one attempt at building the temple and became discouraged and the work was halted. The foundation was a nagging reminder that they had neglected God and the prophets wouldn’t let them forget it!</p>\n\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Psa 74:7,8</strong> They have burned Thy sanctuary to the ground; They have defiled the dwelling place of Thy name...</li>\n  <li><strong>Jer 52:13</strong> And he burned the house of the LORD, the king's house, and all the houses of Jerusalem; even every large house he burned with fire.</li>\n  <li><strong>Lam 2:7</strong> The Lord has rejected His altar, He has abandoned His sanctuary...</li>\n  <li><strong>Mic 3:12</strong> Therefore, on account of you, Zion will be plowed as a field, Jerusalem will become a heap of ruins...</li>\n  <li><strong>Jer 26:18</strong> Micah of Moresheth prophesied in the days of Hezekiah...</li>\n  <li><strong>Psa 132:3-5</strong> Surely I will not enter my house, Nor lie on my bed... Until I find a place for the LORD...</li>\n  <li><strong>2Sa 7:2</strong> that the king said to Nathan the prophet, \"See now, I dwell in a house of cedar, but the ark of God dwells within tent curtains.\"</li>\n  <li><strong>Eze 24:21</strong> Speak to the house of Israel, \"Thus says the Lord GOD, 'Behold, I am about to profane My sanctuary...'\"</li>\n</ul>\n\n<h3>Haggai 1:5</h3>\n<blockquote class=\"primary-scripture\">Now therefore thus saith the LORD of hosts; Consider your ways.</blockquote>\n<p>Consider is used 5 times by Haggai in two short chapters.</p>\n\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Lam 3:40</strong> Let us examine and probe our ways, And let us return to the LORD.</li>\n  <li><strong>Luk 15:17</strong> \"But when he came to his senses, he said, 'How many of my father's hired men have more than enough bread, but I am dying here with hunger!\"</li>\n</ul>\n\n<h3>Haggai 1:6</h3>\n<blockquote class=\"primary-scripture\">Ye have sown much, and bring in little; ye eat, but ye have not enough; ye drink, but ye are not filled with drink; ye clothe you, but there is none warm; and he that earneth wages earneth wages to put it into a bag with holes.</blockquote>\n<p>Man has blamed seed, weather and nature when all the time God was withholding his favor. The following scriptures will set the record straight.</p>\n\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Lev 26:20</strong> 'And your strength shall be spent uselessly, for your land shall not yield its produce and the trees of the land shall not yield their fruit.</li>\n  <li><strong>Deu 28:38-40</strong> \"You shall bring out much seed to the field but you shall gather in little, for the locust shall consume it...\"</li>\n  <li><strong>2Sa 21:1</strong> Now there was a famine in the days of David for three years...</li>\n  <li><strong>Psa 107:34</strong> A fruitful land into a salt waste, Because of the wickedness of those who dwell in it.</li>\n  <li><strong>Isa 5:10</strong> \"For ten acres of vineyard will yield only one bath of wine, And a homer of seed will yield but an ephah of grain.\"</li>\n  <li><strong>Jer 14:4</strong> \"Because the ground is cracked, For there has been no rain on the land...\"</li>\n  <li><strong>Hos 4:10</strong> And they will eat, but not have enough; They will play the harlot, but not increase, Because they have stopped giving heed to the LORD.</li>\n  <li><strong>Hos 8:7</strong> For they sow the wind, And they reap the whirlwind...</li>\n  <li><strong>Joe 1:10-12</strong> The field is ruined, The land mourns, For the grain is ruined, The new wine dries up, Fresh oil fails...</li>\n  <li><strong>Amo 4:7-9</strong> \"And furthermore, I withheld the rain from you...\"</li>\n  <li><strong>Mic 6:14-15</strong> \"You will eat, but you will not be satisfied...\"</li>\n  <li><strong>Mal 2:2</strong> \"If you do not listen, and if you do not take it to heart to give honor to My name...\"</li>\n  <li><strong>Lev 26:26</strong> 'When I break your staff of bread...'</li>\n  <li><strong>1Ki 17:12</strong> But she said, \"As the LORD your God lives, I have no bread, only a handful of flour in the bowl...\"</li>\n  <li><strong>Eze 4:16-17</strong> Moreover, He said to me, \"Son of man, behold, I am going to break the staff of bread in Jerusalem...\"</li>\n</ul>\n\n<h3>Haggai 1:7</h3>\n<blockquote class=\"primary-scripture\">Thus saith the LORD of hosts; Consider your ways.</blockquote>\n<p>The world is upside down today─we blame everything form ecology to theology. We blame everybody for everything but never blame ourselves. We spend more money on cars, clothes, cosmetics, TV, vacations, boats, golfing and pleasure than it would take to build a new church house. People will pay a dollar to see almost anything and then give a dime to the Lord.</p>\n\n<h3>Haggai 1:8</h3>\n<blockquote class=\"primary-scripture\">Go up to the mountain, and bring wood, and build the house; and I will take pleasure in it, and I will be glorified, saith the LORD.</blockquote>\n<p>The prophet encourages the people to cut the timber in the forest of Lebanon and float it down to the sea port of Joppa and then transport it overland to the place of construction and then God would have pleasure in it and be glorified.</p>\n\n<h4>Cross References</h4>\n<ul>\n  <li><strong>2Ch 2:8-10</strong> \"Send me also cedar, cypress and algum timber from Lebanon...\"</li>\n  <li><strong>Ezr 3:7</strong> Then they gave money to the masons and carpenters, and food, drink, and oil to the Sidonians and to the Tyrians...</li>\n  <li><strong>Ezr 6:4</strong> with three layers of huge stones, and one layer of timbers...</li>\n  <li><strong>Zec 11:1-2</strong> Open your doors, O Lebanon, That a fire may feed on your cedars...</li>\n  <li><strong>1Ki 9:3</strong> And the LORD said to him, \"I have heard your prayer and your supplication...\"</li>\n  <li><strong>Psa 132:13-14</strong> For the LORD has chosen Zion; He has desired it for His habitation...</li>\n</ul>\n\n<h3>Haggai 1:9</h3>\n<blockquote class=\"primary-scripture\">Ye looked for much, and lo, it came to little; and when ye brought it home, I did blow upon it. Why? saith the LORD of hosts. Because of mine house that is waste, and ye run every man unto his own house.</blockquote>\n<p>What they had brought home was wasted, as if the Lord had \"blown upon it,\" and driven it away! And the reason was, because they neglected the temple, and left it in ruins, while they were busy in building and decorating their own houses; therefore they were visited by drought and famine, and by various diseases.</p>\n\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Isa 17:10-11</strong> For you have forgotten the God of your salvation And have not remembered the rock of your refuge...</li>\n  <li><strong>Isa 40:7</strong> The grass withers, the flower fades, When the breath of the LORD blows upon it...</li>\n  <li><strong>Jos 7:11-13</strong> \"Israel has sinned, and they have also transgressed My covenant which I commanded them...\"</li>\n  <li><strong>1Co 11:30-32</strong> For this reason many among you are weak and sick, and a number sleep...</li>\n  <li><strong>Rev 2:22</strong> 'Behold, I will cast her upon a bed of sickness...'</li>\n</ul>\n\n<h3>Haggai 1:10</h3>\n<blockquote class=\"primary-scripture\">Therefore the heaven over you is stayed from dew, and the earth is stayed from her fruit.</blockquote>\n<p>Consider your ways─Man goes to church when convenient─it takes very little to make it inconvenient. Too hot, too cold, too wet. Friends, reunions, outing, too tired, not feeling well etc. Haggai was a prophet (holy man). He lived at the same time as Zechariah. Then, some people from Israel had returned from Babylon. They rebuilt their own houses in Jerusalem. Haggai explained why they were poor. He said that God was not blessing them because they had neglected His house.</p>\n\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Lev 26:19</strong> 'And I will also break down your pride of power; I will also make your sky like iron and your earth like bronze.</li>\n  <li><strong>Deu 28:23-24</strong> \"And the heaven which is over your head shall be bronze...\"</li>\n  <li><strong>1Ki 8:35</strong> \"When the heavens are shut up and there is no rain...\"</li>\n  <li><strong>Jer 14:1-6</strong> That which came as the word of the LORD to Jeremiah in regard to the drought...</li>\n  <li><strong>Joe 1:18-20</strong> How the beasts groan! The herds of cattle wander aimlessly Because there is no pasture for them...</li>\n</ul>\n\n<h3>Haggai 1:11</h3>\n<blockquote class=\"primary-scripture\">And I called for a drought upon the land, and upon the mountains, and upon the corn, and upon the new wine, and upon the oil, and upon that which the ground bringeth forth, and upon men, and upon cattle, and upon all the labour of the hands.</blockquote>\n<p>National adversity is due to national disobedience. They had worked hard, but what had it earned them? Their crops were unsuccessful. Their money disappeared as soon as they earned it. Why? Haggai asked. Because they had mistaken their priorities and needed to put God first. They needed to rebuild his temple. Would rebuilding the temple change Israel's financial situation? Haggai's first words promised nothing. He simply said, \"Give careful thought to your ways,\" and pointed out that Israel's lack of prosperity was God's doing. They had worked hard, but God had withheld the rain their crops needed a month later (2:1-9) Haggai said that God had glorious plans for Israel, plans that would shake the whole earth. But he let Israel know that in order for them to expect God to guide their feet they would have to recalibrate their thinking.</p>\n\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Deu 28:22</strong> \"The LORD will smite you with consumption and with fever and with inflammation...\"</li>\n  <li><strong>2Ki 8:1</strong> Now Elisha spoke to the woman whose son he had restored to life...</li>\n  <li><strong>Amo 5:8</strong> He who made the Pleiades and Orion And changes deep darkness into morning...</li>\n</ul>\n\n<h3>Haggai 1:12</h3>\n<blockquote class=\"primary-scripture\">Then Zerubbabel the son of Shealtiel, and Joshua the son of Josedech, the high priest, with all the remnant of the people, obeyed the voice of the LORD their God, and the words of Haggai the prophet, as the LORD their God had sent him, and the people did fear before the LORD.</blockquote>\n<p>Sometimes, at crucial moments, a single voice can stir a directionless mass of people to action. Prime Minister Winston Churchill's inspiring oratory may have saved Britain in World War II. Consider the words of Haggai and you will see similar action. Consider your ways: more money is spent on alcohol than on education. More on pleasure than of food, more on foreign aid than social reform, more is spent on cat food, boats, TV and cosmetics than missions. They had lost the desire to appropriate and appreciate spiritual things. We need a season of conviction in the lives of God’s people. We need another Watergate revival like the one in Nehemiah 9 and 10. Pray that God will send us another Haggai.</p>\n\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Ezr 5:2</strong> then Zerubbabel the son of Shealtiel and Jeshua the son of Jozadak arose and began to rebuild the house of God...</li>\n  <li><strong>Isa 55:10-11</strong> \"For as the rain and the snow come down from heaven... So shall My word be which goes forth from My mouth...\"</li>\n  <li><strong>Psa 112:1</strong> Praise the LORD! How blessed is the man who fears the LORD...</li>\n  <li><strong>Pro 1:7</strong> The fear of the LORD is the beginning of knowledge...</li>\n  <li><strong>Isa 50:10</strong> Who is among you that fears the LORD...</li>\n  <li><strong>Heb 12:28</strong> Therefore, since we receive a kingdom which cannot be shaken...</li>\n</ul>\n\n<h3>Haggai 1:13</h3>\n<blockquote class=\"primary-scripture\">Then spake Haggai the LORD's messenger in the LORD's message unto the people, saying, I am with you, saith the LORD.</blockquote>\n<p>Haggai was the messenger of the LORD. He spoke the message of the LORD. Haggai told the people, ‘The LORD says, “I am with you.”</p>\n<p>One of my favorite stories is the building of the Panama Canal. The world said that “It can’t be done.” America had purchased the Isthmus. President Theodore Roosevelt appointed George W. Goethals to build the canal. He had the reputation of never quitting. The world flippantly said, “Let George do it.” Colonel Goethals “put to the full test the fearless courage that was the measure of the man.” The canal was completed. “George did it.” But George didn’t do it without the help of another fearless man. William C. Gorgas, an American Army doctor was selected to fight malaria and yellow fever. He scanned the record of twenty thousand who had died from these pestilential diseases. One report showed that five hundred young engineers came from France to Panama and “not one lived to draw his first month’s pay.” Then began Dr. Gorgas’ most amazing campaign. He was ridiculed. Called a mosquito chaser; but Gorgas “concentrated his sleepless energies upon one single aim─the destruction of the infesting mosquitoes, and he won what was unquestionably the greatest triumph in preventive medicine. A campaign waged for less than six months wiped out a scourge that had afflicted this region for at least four hundred years.” Had he allowed ridicule and opposition to overcome his courage, the Panama Canal might not have been built. (I dare you p.106,107)</p>\n\n<h4>Cross References</h4>\n<ul>\n  <li><strong>Isa 44:26</strong> Confirming the word of His servant, And performing the purpose of His messengers...</li>\n  <li><strong>2Ch 15:2</strong> ...the LORD is with you when you are with Him. And if you seek Him, He will let you find Him...</li>\n  <li><strong>2Ch 20:17</strong> ...stand and see the salvation of the LORD on your behalf...</li>\n  <li><strong>Isa 8:10</strong> \"Devise a plan but it will be thwarted; State a proposal, but it will not stand, For God is with us.\"</li>\n  <li><strong>Isa 41:10</strong> 'Do not fear, for I am with you...'</li>\n  <li><strong>Isa 43:2</strong> \"When you pass through the waters, I will be with you...\"</li>\n  <li><strong>Jer 15:20</strong> \"Then I will make you to this people A fortified wall of bronze...\"</li>\n  <li><strong>Mat 28:20</strong> ...and lo, I am with you always, even to the end of the age.\"</li>\n</ul>\n\n<h3>Haggai 1:14</h3>\n<blockquote class=\"primary-scripture\">And the LORD stirred up the spirit of Zerubbabel the son of Shealtiel, governor of Judah, and the spirit of Joshua the son of Josedech, the high priest, and the spirit of all the remnant of the people; and they came and did work in the house of the LORD of hosts, their God,</blockquote>\n<ul>\n  <li>The Lord of everything stirred up Zerubbabel!</li>\n  <li>The Lord of everything stirred up Joshua!</li>\n  <li>The Lord of everything stirred up the remnant!</li>\n</ul>\n\n<h4>Cross References</h4>\n<ul>\n  <li><strong>1Ch 5:26</strong> So the God of Israel stirred up the spirit of Pul, king of Assyria...</li>\n  <li><strong>2Ch 36:22</strong> ...the LORD stirred up the spirit of Cyrus king of Persia...</li>\n  <li><strong>Ezr 1:1</strong> ...the LORD stirred up the spirit of Cyrus king of Persia...</li>\n  <li><strong>Ezr 1:5</strong> Then the heads of fathers' households... arose, even everyone whose spirit God had stirred...</li>\n  <li><strong>Ezr 7:27-28</strong> Blessed be the LORD, the God of our fathers, who has put such a thing as this in the king's heart...</li>\n</ul>\n\n<h3>Haggai 1:15</h3>\n<blockquote class=\"primary-scripture\">In the four and twentieth day of the sixth month, in the second year of Darius the king.</blockquote>\n<p>By October 24th the people had responded to Haggai. Prophets before him, such as Amos, Isaiah, and Jeremiah, had spoken for decades without seeing such a heartfelt reaction. Haggai's messages span a mere four months, but he accomplished everything he set out to do. In four years the temple was complete. What made the temple so important? After all, the proper sacrifices and rituals could be carried out on a makeshift altar. But God's reputation was at stake. He could not be properly honored so long as the house he called home lay in ruins. The temple symbolized God's presence, and Israel's priorities.</p>\n<p>In addition to all this the Prophets had prophesied that the temple would be rebuilt in troublous times. See Daniel 9 and my comments in Daniel and the Revelation.</p>",
  "faq": [
    {
      "question": "Why does the commentary refer to Haggai as \"God’s cheerleader\"?",
      "answer": "The commentary calls Haggai \"God’s cheerleader\" because he was raised up to combat the people's apathy and depression by giving inspired leadership and motivation to reconstruct the Temple."
    },
    {
      "question": "What physical consequences did the people suffer for neglecting the Temple?",
      "answer": "According to the commentary, because the people prioritized their own houses over God's house, God withheld His favor, resulting in inflation (money in a \"bag with holes\"), bad crops, bad weather, and a lack of satisfaction in eating and drinking."
    },
    {
      "question": "What is the significance of the phrase \"Consider your ways\" in Haggai?",
      "answer": "The phrase \"Consider your ways\" is repeated five times in the book. It serves as a call for the people to self-examine their priorities and realize that their lack of prosperity was a direct result of neglecting God's work."
    },
    {
      "question": "How long had the work on the Temple ceased before Haggai began his ministry?",
      "answer": "The work on the Temple had ceased for sixteen years, during which time the people became self-centered and focused on building their own homes while the Temple lay in ruins."
    }
  ],
  "structuredData": [
    {
      "@context": "https://schema.org",
      "@type": "Article",
      "headline": "Red Tagged for Sixteen Years: Overcoming Spiritual Apathy",
      "description": "After sixteen years of neglect, God raised up a leader to combat apathy. Discover how misplaced priorities led to ruin and why you must now consider your ways.",
      "author": {
        "@type": "Person",
        "name": "Lewis P. Hussell"
      },
      "about": [
        {
          "@type": "Person",
          "name": "Haggai",
          "description": "Prophet raised up by God to challenge the people's apathy and inspire the rebuilding of the Temple.",
          "sameAs": "https://en.wikipedia.org/wiki/Haggai"
        },
        {
          "@type": "Person",
          "name": "Zerubbabel",
          "description": "Governor of Judah who, along with Joshua, led the people in the work of rebuilding the house of the Lord.",
          "sameAs": "https://en.wikipedia.org/wiki/Zerubbabel"
        },
        {
          "@type": "Place",
          "name": "The Temple",
          "description": "The house of the Lord in Jerusalem, which lay in ruins for sixteen years due to the people's neglect.",
          "sameAs": "https://en.wikipedia.org/wiki/Second_Temple"
        },
        {
          "@type": "Person",
          "name": "Darius",
          "description": "King of Persia during whose second year of reign Haggai delivered his message to the people.",
          "sameAs": "https://en.wikipedia.org/wiki/Darius_I"
        },
        {
          "@type": "CreativeWork",
          "name": "Haggai"
        },
        {
          "@type": "CreativeWork",
          "name": "Chapter 1"
        }
      ],
      "keywords": "Haggai overcoming spiritual apathy, Consider your ways Haggai, National adversity and national disobedience, Misplaced priorities and rebuilding the temple, Haggai God's cheerleader, Divine cause of economic hardship Haggai, Zerubbabel and Joshua leadership stirred"
    },
    {
      "@context": "https://schema.org",
      "@type": "FAQPage",
      "mainEntity": [
        {
          "@type": "Question",
          "name": "Why does the commentary refer to Haggai as \"God’s cheerleader\"?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The commentary calls Haggai \"God’s cheerleader\" because he was raised up to combat the people's apathy and depression by giving inspired leadership and motivation to reconstruct the Temple."
          }
        },
        {
          "@type": "Question",
          "name": "What physical consequences did the people suffer for neglecting the Temple?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "According to the commentary, because the people prioritized their own houses over God's house, God withheld His favor, resulting in inflation (money in a \"bag with holes\"), bad crops, bad weather, and a lack of satisfaction in eating and drinking."
          }
        },
        {
          "@type": "Question",
          "name": "What is the significance of the phrase \"Consider your ways\" in Haggai?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The phrase \"Consider your ways\" is repeated five times in the book. It serves as a call for the people to self-examine their priorities and realize that their lack of prosperity was a direct result of neglecting God's work."
          }
        },
        {
          "@type": "Question",
          "name": "How long had the work on the Temple ceased before Haggai began his ministry?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The work on the Temple had ceased for sixteen years, during which time the people became self-centered and focused on building their own homes while the Temple lay in ruins."
          }
        }
      ]
    },
    {
      "@context": "https://schema.org",
      "@type": "BreadcrumbList",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://4thewordofgod.com/"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Commentaries",
          "item": "https://4thewordofgod.com/commentaries/"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Haggai",
          "item": "https://4thewordofgod.com/commentaries/haggai"
        },
        {
          "@type": "ListItem",
          "position": 4,
          "name": "Chapter 1",
          "item": "https://4thewordofgod.com/commentaries/haggai/1"
        }
      ]
    }
  ],
  "metaDescription": "After sixteen years of neglect, God raised up a leader to combat apathy. Discover how misplaced priorities led to ruin and why you must now consider your ways.",
  "keywords": [
    "Haggai overcoming spiritual apathy",
    "Consider your ways Haggai",
    "National adversity and national disobedience",
    "Misplaced priorities and rebuilding the temple",
    "Haggai God's cheerleader",
    "Divine cause of economic hardship Haggai",
    "Zerubbabel and Joshua leadership stirred"
  ],
  "previous_chapter": "haggai_00",
  "next_chapter": "haggai_02"
}