{
  "book_name": "Daniel",
  "chapter_number": "02",
  "title": "Nebuchadnezzar’s Dream: The Statue and the Crushing Stone",
  "content": "<p>In this chapter God will give Daniel wisdom, understanding and insight into dreams that will baffle the imagination of the king. Nebuchadezzar has a dream about a large statue that looms high above the horizon, it had a head of gold, breast of silver, belly of brass, and legs and feet of iron and clay. Then a stone from a mountain struck the image and dashed it to pieces and it disappeared as chaff disappears from the summer threshing floor. Then the stone grew larger and larger and larger until it filled the entire world. It covered North America, South America, Europe, Asia and Africa.</p>\n<p>The king called all the quacks to tell him the meaning of the dream. He threatens to execute all the 'so-called interpreters of dreams’ if they do not perform. After they were exposed as mere frauds, Daniel, who has been given the secret meaning of the dream by the almighty God now comes forward with a proposal: If the king would not carry out his order for execution he would make known the dream and its interpretation.</p>\n<p>The king is told that the dream is about four kingdoms and that he is the first of the four. Three more would emerge, one after the other, and that the stone would destroy all four kingdoms and become a worldwide kingdom. He further tells the king that that the stone would establish his kingdom during the time of the fourth world empire. Jesus the \"stone of stumbling\" came during that period in world history and established his kingdom world wide. Halleluiah!</p>\n\n<h2>Decoding the Prophetic Vision of the Stone and Kingdoms</h2>\n\n<h3>Daniel 2:1</h3>\n<blockquote class=\"primary-scripture\">And in the second year of the reign of Nebuchadnezzar Nebuchadnezzar dreamed dreams, wherewith his spirit was troubled, and his sleep brake from him.</blockquote>\n<p>His mind was disturbed, he was robbed of his sleep and his spirit had no rest. Like Pharaoh of Gen. 41:8 “And it came to pass in the morning that his spirit was troubled; and he sent and called for all the magicians of Egypt, and all the wise men thereof: and Pharaoh told them his dream; but there was none that could interpret them unto Pharaoh.”</p>\n\n<h3>Daniel 2:2</h3>\n<blockquote class=\"primary-scripture\">Then the king commanded to call the magicians, and the astrologers, and the sorcerers, and the Chaldeans, for to shew the king his dreams. So they came and stood before the king.</blockquote>\n<p>Diviners, soothsayers, astrologers, exorcists, socerers, necromancers were all called to the palace to interpret the dream of Nebuchadnezzar. Magicians employed all the superstitutious rites and ceremonies of fortunetellers, while the astrologers pretended to tell future events by the study of the stars. Sorcerers and necromancers pretended to hold communion with the dead, while the Caldeans were a sect of philosophers similar to the magicians and astrologers who made natural science and divinations their study.</p>\n<p>All the wise men summoned to interpret the dream used chicanery. These frauds will use any kind of deception to dupe people into thinking they know the future. They were expert at hocus-pocus and delusion. They will try and conjure up an interpretation. To trust in fortunetellers is like hanging your hopes on a cobweb strung across the horns of the moon.</p>\n\n<h3>Daniel 2:3</h3>\n<blockquote class=\"primary-scripture\">And the king said unto them, I have dreamed a dream, and my spirit was troubled to know the dream.</blockquote>\n<p>Try as he might he could not dismiss the dream as a random occurrence. The vision must have some special meaning. Nebuchadezzar felt that this dream had been sent by the gods. Every waking moment was fraught with anxiety.</p>\n\n<h3>Daniel 2:4</h3>\n<blockquote class=\"primary-scripture\">Then spake the Chaldeans to the king in Syriack, O king, live for ever: tell thy servants the dream, and we will shew the interpretation.</blockquote>\n<p>This special language or dialect, which was the ancient Cushite language used for scientific and religious purposes, and reserved for occasions like this. This was not the ordinary Aramaic spoken by peasants. They inform the King that it will be no trouble to make the dream known to him. \"Yes, we will explain and make known the meaning.\" was their boast.</p>\n\n<h3>Daniel 2:5</h3>\n<blockquote class=\"primary-scripture\">The king answered and said to the Chaldeans, The thing is gone from me: if ye will not make known unto me the dream, with the interpretation thereof, ye shall be cut in pieces, and your houses shall be made a dunghill.</blockquote>\n<p>The Chaldeans are the spokesman for the group, so the king addresses them. First he tells them that he can’t remember the dream. It has eluded him. It was in the secret chamber of his spirit,and he could not recall the dream. In computer terms it had been deleted. They were boxed in, and there was no way out. The king tells them if they can’t tell the dream, that they will be torn from limb to limb and the state will confiscate their property, and turn it into a public restroom. The NIV says that he firmly decided, rather than forgot.</p>\n\n<h3>Daniel 2:6-7</h3>\n<blockquote class=\"primary-scripture\">But if ye shew the dream, and the interpretation thereof, ye shall receive of me gifts and rewards and great honour: therefore shew me the dream, and the interpretation thereof. They answered again and said, Let the king tell his servants the dream, and we will shew the interpretation of it.</blockquote>\n<p>They were promised gifts, rewards, honour, dignity, and advancement. It was a package deal that no employee could turn down. However, they must show him the dream and the interpretation. They wanted to know the dream so that they could echo some flattering story that would underwrite the plans already in the head of the king.</p>\n\n<h3>Daniel 2:8-9</h3>\n<blockquote class=\"primary-scripture\">The king answered and said, I know of certainty that ye would gain the time, because ye see the thing is gone from me. But if ye will not make known unto me the dream, there is but one decree for you: for ye have prepared lying and corrupt words to speak before me, till the time be changed: therefore tell me the dream, and I shall know that ye can shew me the interpretation thereof.</blockquote>\n<p>Slowly but surely the net was beginning to close around them. They had told the king that it was written in the stars, now the king is going to put them to the test. They were schooled in the art of drawing out sufficient information to form a basis for their shrewd calculation. Then they would give an ambiguous answer that could be construed to apply to any future event. Their answers were like fortune cookies.</p>\n\n<h3>Daniel 2:10-11</h3>\n<blockquote class=\"primary-scripture\">The Chaldeans answered before the king, and said, There is not a man upon the earth that can shew the king's matter: therefore there is no king, lord, nor ruler, that asked such things at any magician, or astrologer, or Chaldean. And it is a rare thing that the king requireth, and there is none other that can shew it before the king, except the gods, whose dwelling is not with flesh.</blockquote>\n<p>These men were terrified, they were boxed in and no way out. They are beginning to realize that the king was seeing through their blubbering sophistry. They were heap big thunder, no rain.</p>\n<p>When they declared that none but the gods could reveal the dream. It was an open acknowledgment that they had no communion with these gods and knew nothing beyond what human wisdom and discernment could reveal. The king saw that he and previous kings had been made victims by their chicanery. So the decree went forth that the wise men should be slain; and they sought Daniel and his fellows to be slain. The King saw their double-dealing and that he had been hoodwinked before, but this time he had them right where he wanted them. What a miserable class of frauds. The king would have no part in dishonesty and deception.</p>\n\n<h3>Daniel 2:12-13</h3>\n<blockquote class=\"primary-scripture\">For this cause the king was angry and very furious, and commanded to destroy all the wise men of Babylon. And the decree went forth that the wise men should be slain; and they sought Daniel and his fellows to be slain.</blockquote>\n<p>Now the king is irate, he flies off the handle, he is so enraged that he orders the execution of these deceivers who pretended to have communion with the dead or could read the zodiac. A warrant or edict was issued for Arioch to prepare for the execution of the experts.</p>\n\n<h3>Daniel 2:14-16</h3>\n<blockquote class=\"primary-scripture\">Then Daniel answered with counsel and wisdom to Arioch the captain of the king's guard, which was gone forth to slay the wise men of Babylon... Then Daniel went in, and desired of the king that he would give him time, and that he would shew the king the interpretation.</blockquote>\n<p>Daniel was filled with wisdom, tact, diplomacy, prudence and discretion. The mages and seers are indeed a vain and supercilious lot, but they have done nothing to deserve this. Daniel goes to bat for them, he could be writing his own ticket to the gallows.</p>\n<p>The decree was not only harsh, but it was hasty and severe. Daniel asks for a stay of execution with the promise that he would tell the dream and show the king the interpretation. The king called on the heathen system first. Had Daniel been called first the magicians would not have been brought to the test.</p>\n\n<h3>Daniel 2:17-19</h3>\n<blockquote class=\"primary-scripture\">Then Daniel went to his house, and made the thing known to Hananiah, Mishael, and Azariah, his companions: That they would desire mercies of the God of heaven concerning this secret... Then was the secret revealed unto Daniel in a night vision. Then Daniel blessed the God of heaven.</blockquote>\n<p>The news of this whole affair is laid out to Daniel's three friends. Daniel and his three friends are crying out to the God of Heaven for mercy. They are seeking an answer to the dream. The Sovereign Lord answered Daniel in a dream. Daniel spends some time praising the God of Heaven for supplying the pieces of the puzzle.</p>\n\n<h3>Daniel 2:20-22</h3>\n<blockquote class=\"primary-scripture\">Daniel answered and said, Blessed be the name of God for ever and ever: for wisdom and might are his: And he changeth the times and the seasons: he removeth kings, and setteth up kings... He revealeth the deep and secret things: he knoweth what is in the darkness, and the light dwelleth with him.</blockquote>\n<p>Wisdom and power and might belong only to God. Since there is but one God and it was not the pagan gods of Babylon, but rather the God of Daniel. Our God is the unveiler of things unknown to mortals.</p>\n\n<h3>Daniel 2:23-25</h3>\n<blockquote class=\"primary-scripture\">I thank thee, and praise thee, O thou God of my fathers, who hast given me wisdom and might... Then Arioch brought in Daniel before the king in haste...</blockquote>\n<p>This is the first of the dreams, which Daniel interpreted, and the one, which secured for him both his reputation as a dream interpreter, and for this he is given a position in the empire. Daniel refused to take credit for any of his knowledge, giving it entirely to God. So profound was the effect on Nebuchadnezzar, that he gave Daniel a Supreme Court appointment. Even King Nebuchadezzar praises God in glowing terms. Armed with wisdom, knowledge, insight, and understanding of the content and meaning of the dream, Daniel is ready to reveal the interpretation.</p>\n\n<h3>Daniel 2:26-30</h3>\n<blockquote class=\"primary-scripture\">The king answered and said to Daniel, whose name was Belteshazzar, Art thou able to make known unto me the dream which I have seen, and the interpretation thereof? ...But there is a God in heaven that revealeth secrets...</blockquote>\n<p>Daniel now faces the King and says in bold terms that none of the wise men can answer the king, including Daniel himself. But there is a God in heaven… Before Daniel goes any further he wants to make it clear that it is not by the power of soothsayers, astrology, or sorcery that the dream will be revealed. He gives all credit, and honor, and glory to the One and only God of Heaven.</p>\n<p>The mental picture that came to Nebuchadezzar during his sleep had partially left the king, however when Daniel begins to tell the King the dream his subconscious mind releases the information that had been stored up in his spirit. This revelation to Daniel was not given to him because of any super wisdom that he had attained to but rather to let the King see that the other three exiles had equally prayed that the God of Heaven would reveal the secret.</p>\n\n<h3>Daniel 2:31-35</h3>\n<blockquote class=\"primary-scripture\">Thou, O king, sawest, and behold a great image. This great image, whose brightness was excellent, stood before thee; and the form thereof was terrible... Thou sawest till that a stone was cut out without hands, which smote the image upon his feet that were of iron and clay, and brake them to pieces.</blockquote>\n<p>This imposing image that appeared to Nebuchadazzer was frightening. Daniel continues to describe the image that the King saw before giving a detailed description of the interpretation. This was the frightening part of the whole vision, a stone cut out of the mountain breaking the image into small pieces.</p>\n<p>This stone not only broke the image but ground it into such small particles that the wind blew it away like chaff on the summer threshing floor and then the stone gets larger and larger till it is as big as a mountain and filled the whole earth. Wow! This part of the dream is getting exciting. Larger than Everest, bigger than the Andes, greater than the Hemeliahs. Just wait till you hear the interpretation to the dream.</p>\n\n<h3>Daniel 2:36-38</h3>\n<blockquote class=\"primary-scripture\">This is the dream; and we will tell the interpretation thereof before the king. Thou, O king, art a king of kings: for the God of heaven hath given thee a kingdom, power, and strength, and glory.</blockquote>\n<p>Daniel now informs the King that he will give him a full and detailed explanation of the dream. Nebuchadazzar is declared to be king of kings because there were many vassals under him ruling in the nations that he had conquered. However, God had given him this power, not because he merited it, but the Almighty Sovereign Lord had a scheme for world history and he needed such a monarch to play the part and fulfill His purpose. Daniel reminds the king that he has a World Wide Kingdom a Super Power and that he is ruler over them all.</p>\n\n<h3>Daniel 2:39</h3>\n<blockquote class=\"primary-scripture\">And after thee shall arise another kingdom inferior to thee, and another third kingdom of brass, which shall bear rule over all the earth.</blockquote>\n<p>Now the King is informed that the dream meant that two other kingdoms are to arise. He is further informed that the brass kingdom will bear rule over all the earth. Daniel also informs Nebuchaduzzar that the kingdom to follow the Babylonian would be inferior to his. What Daniel is telling as the meaning of the dream is corroborated in the books of history. The four kingdoms are as follows:</p>\n<ul>\n  <li><strong>GOLD</strong> – Babylonian – 600-536 B.C.</li>\n  <li><strong>SILVER</strong> – Medo Persian 536-330 B.C.</li>\n  <li><strong>BRASS</strong> – Grecian – 323 – 30 B.C.</li>\n  <li><strong>IRON</strong> – Roman 30 – 476 A.D.</li>\n</ul>\n\n<h3>Daniel 2:40</h3>\n<blockquote class=\"primary-scripture\">And the fourth kingdom shall be strong as iron: forasmuch as iron breaketh in pieces and subdueth all things: and as iron that breaketh all these, shall it break in pieces and bruise.</blockquote>\n<p>I have spread out before me a great number of world history books and all describe this fourth world kingdom as Rome and with one voice describe it as strong as iron and able to break any and all resistance encountered on or near its borders. More is written about the fourth empire than all the others combined.</p>\n\n<h3>Daniel 2:41-43</h3>\n<blockquote class=\"primary-scripture\">And whereas thou sawest the feet and toes, part of potters' clay, and part of iron, the kingdom shall be divided... And as the toes of the feet were part of iron, and part of clay, so the kingdom shall be partly strong, and partly broken.</blockquote>\n<p>The imagery is most striking when we consider that there were two feet, which represented the two parts of the Roman Empire, namely East and West, or Latin and Greek. Notice also that there is ten toes which represent the ten kingdoms that make up the empire. And the toes and feet are part of iron and part of clay.</p>\n<p>The Kingdom had incessant strife and warfare within. It was difficult to hold together. Even when they mingled themselves with the seed of men they no more cleaved to one another than iron would mix with clay. This mixture signifies the attempts to hold the empire together through alliances and marriages (mingling with the seed of men), which ultimately failed.</p>\n\n<h3>Daniel 2:44</h3>\n<blockquote class=\"primary-scripture\">And in the days of these kings shall the God of heaven set up a kingdom, which shall never be destroyed: and the kingdom shall not be left to other people, but it shall break in pieces and consume all these kingdoms, and it shall stand for ever.</blockquote>\n<p>The God of heaven was to set up a Kingdom whereas men set up the previous four kingdoms. One very important point to be considered is that the God of Heaven would set up this kingdom during the rule of the fourth world empire. All the other kingdoms have been given over to other people and history shows them passing into the hands of another. But the kingdom that God sets up will have no successor.</p>\n<p>In Daniel chapter 7, beginning with verse nine heaven convened court, and the indictments were read and judgment was declared against the four kingdoms. Then in verse thirteen and fourteen we are introduced to the Son of Man, who comes to the Ancient of days, and receives dominion, and glory, and a kingdom. All this was accomplished when Jesus ascended back to the Father and was crowned Lord of lords, and King of kings.</p>\n<p>No Bible believer claims that the terms <strong>church</strong> and <strong>kingdom</strong> are synonymous, but are rather applied to the same thing. The following facts are indisputable (1) The head, (2) the laws, (3) the subjects, (4) the territory. The church and kingdom all contain the above. The Head of the church and King of the kingdom are the same.</p>\n<ul>\n  <li>Christ is the Head of the church (Eph. 1:22, Col. 1:18).</li>\n  <li>Christ is also the King of the Kingdom (Acts 17:7, Rev. 17:14).</li>\n  <li>The members of the church are the subjects of the kingdom (Col. 1:13,14).</li>\n  <li>The territory of the church is the territory of the kingdom (the heart).</li>\n</ul>\n<p>Christ does not have one thing on earth called the “church” and another thing called the “kingdom”. He who is in the one is in the other. That which introduces one into the church also introduces one into the kingdom. The kingdom, the church, and the body are not three different institutions. They are the same institution wearing different names and are entered into by the new birth.</p>\n\n<h3>Daniel 2:45</h3>\n<blockquote class=\"primary-scripture\">Forasmuch as thou sawest that the stone was cut out of the mountain without hands, and that it brake in pieces the iron, the brass, the clay, the silver, and the gold; the great God hath made known to the king what shall come to pass hereafter: and the dream is certain, and the interpretation thereof sure.</blockquote>\n<p>Wow! What a picture. A stone cut out of the mountain without hands. No human being hewed the stone from the mountain. The stone and the Kingdom that the God of Heaven was to set-up are one and the same. Jesus Christ is the Stone that came out of the Mountain of God and destroyed all the other kingdoms and set up his kingdom.</p>\n<p>There is no room for doubt that Jesus Christ is the stone cut out of the Mountian that destroyed the kingdoms made by hands and established his kingdom. Daniel said that the dream was certain and the interpretation thereof sure. We now know by historical fact that the dream was decreed of the Lord and He proved it to be true.</p>\n\n<h3>Daniel 2:46-49</h3>\n<blockquote class=\"primary-scripture\">Then the king Nebuchadnezzar fell upon his face, and worshipped Daniel, and commanded that they should offer an oblation and sweet odours unto him... The king answered unto Daniel, and said, Of a truth it is, that your God is a God of gods...</blockquote>\n<p>Nebuchadnezzar surely knew about bowing down to Idols. Nebuchadnezzar in an act of gratitude bows down to worship Daniel. The king senses that he is in the presence of a person who has a powerful relationship with deity. The King gives Daniels God the glory and praises him as greater than the gods that he served. Praise be to our God because he is the Master of the Universe and the Revealer of Mysteries.</p>\n<p>Then the king made Daniel a great man, and gave him many great gifts, and made him ruler over the whole province of Babylon. Daniel requested of the king, and he set Shadrach, Meshach, and Abed-nego, over the affairs of the province of Babylon: but Daniel sat in the gate of the king. We admire the unselfishness of Daniel.</p>",
  "faq": [
    {
      "question": "What do the four metals in Nebuchadnezzar's dream represent?",
      "answer": "According to the commentary, the metals represent four successive kingdoms: Gold is the Babylonian empire, Silver is the Medo-Persian empire, Brass is the Grecian empire, and Iron is the Roman empire."
    },
    {
      "question": "What is the significance of the stone cut out of the mountain without hands?",
      "answer": "The stone represents Jesus Christ and the Kingdom of God. It was not created by human power ('without hands'), and it destroys the earthly kingdoms to establish an everlasting kingdom."
    },
    {
      "question": "How does the commentary view the relationship between the Church and the Kingdom?",
      "answer": "The commentary argues that the Church and the Kingdom are the same institution, sharing the same Head (Christ), the same laws, the same subjects (born-again believers), and the same territory (the human heart)."
    },
    {
      "question": "Why did Nebuchadnezzar threaten to execute the wise men?",
      "answer": "The King was furious because the wise men (magicians, astrologers, etc.) could not tell him the dream itself, proving they were 'frauds' and 'quacks' who only relied on chicanery rather than true connection with the gods."
    }
  ],
  "structuredData": [
    {
      "@context": "https://schema.org",
      "@type": "Article",
      "headline": "The Stone Cut Out of a Mountain and the Four Kingdoms",
      "description": "Discover the meaning of the Great Image, the four world empires, and the Stone cut without hands that fills the earth. God's Kingdom stands forever! Halleluiah!",
      "author": {
        "@type": "Person",
        "name": "Lewis P. Hussell"
      },
      "about": [
        {
          "@type": "Person",
          "name": "Nebuchadnezzar",
          "description": "King of Babylon who receives the dream of the great image.",
          "sameAs": "https://en.wikipedia.org/wiki/Nebuchadnezzar_II"
        },
        {
          "@type": "Person",
          "name": "Daniel",
          "description": "The prophet who interprets the dream and reveals the secrets of God.",
          "sameAs": "https://en.wikipedia.org/wiki/Daniel_(biblical_figure)"
        },
        {
          "@type": "Thing",
          "name": "The Great Image",
          "description": "A statue representing four successive world empires: Babylonian, Medo-Persian, Grecian, and Roman.",
          "sameAs": "https://en.wikipedia.org/wiki/Daniel_2"
        },
        {
          "@type": "Thing",
          "name": "The Stone Cut Without Hands",
          "description": "A symbol of Jesus Christ and His Kingdom that destroys earthly empires.",
          "sameAs": "https://en.wikipedia.org/wiki/Daniel_2"
        },
        {
          "@type": "Thing",
          "name": "The Church",
          "description": "Identified in the commentary as synonymous with the Kingdom of God established during the Roman empire.",
          "sameAs": "https://en.wikipedia.org/wiki/Christian_Church"
        },
        {
          "@type": "CreativeWork",
          "name": "Daniel"
        },
        {
          "@type": "CreativeWork",
          "name": "Chapter 2"
        }
      ],
      "keywords": "Daniel 2 four kingdoms interpretation, Stone cut out without hands meaning, Jesus as the stone in Daniel 2, Daniel 2 kingdom is the church, Failure of Babylonian wise men, God's sovereignty over kingdoms, Iron and clay feet Roman Empire"
    },
    {
      "@context": "https://schema.org",
      "@type": "FAQPage",
      "mainEntity": [
        {
          "@type": "Question",
          "name": "What do the four metals in Nebuchadnezzar's dream represent?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "According to the commentary, the metals represent four successive kingdoms: Gold is the Babylonian empire, Silver is the Medo-Persian empire, Brass is the Grecian empire, and Iron is the Roman empire."
          }
        },
        {
          "@type": "Question",
          "name": "What is the significance of the stone cut out of the mountain without hands?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The stone represents Jesus Christ and the Kingdom of God. It was not created by human power ('without hands'), and it destroys the earthly kingdoms to establish an everlasting kingdom."
          }
        },
        {
          "@type": "Question",
          "name": "How does the commentary view the relationship between the Church and the Kingdom?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The commentary argues that the Church and the Kingdom are the same institution, sharing the same Head (Christ), the same laws, the same subjects (born-again believers), and the same territory (the human heart)."
          }
        },
        {
          "@type": "Question",
          "name": "Why did Nebuchadnezzar threaten to execute the wise men?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The King was furious because the wise men (magicians, astrologers, etc.) could not tell him the dream itself, proving they were 'frauds' and 'quacks' who only relied on chicanery rather than true connection with the gods."
          }
        }
      ]
    },
    {
      "@context": "https://schema.org",
      "@type": "BreadcrumbList",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://4thewordofgod.com/"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Commentaries",
          "item": "https://4thewordofgod.com/commentaries/"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Daniel",
          "item": "https://4thewordofgod.com/commentaries/daniel"
        },
        {
          "@type": "ListItem",
          "position": 4,
          "name": "Chapter 2",
          "item": "https://4thewordofgod.com/commentaries/daniel/2"
        }
      ]
    }
  ],
  "metaDescription": "Discover the meaning of the Great Image, the four world empires, and the Stone cut without hands that fills the earth. God's Kingdom stands forever! Halleluiah!",
  "keywords": [
    "Daniel 2 four kingdoms interpretation",
    "Stone cut out without hands meaning",
    "Jesus as the stone in Daniel 2",
    "Daniel 2 kingdom is the church",
    "Failure of Babylonian wise men",
    "God's sovereignty over kingdoms",
    "Iron and clay feet Roman Empire"
  ],
  "previous_chapter": "daniel_01",
  "next_chapter": "daniel_03"
}