{
  "book_name": "Daniel",
  "chapter_number": "08",
  "title": "Prophecy of the Ram, the Goat, and Medo-Persia",
  "content": "<p><strong>548 B.C.</strong></p>\n<p>Standing by the river a vision comes to Daniel regarding a ram with two horns and one was taller than the other. Later in the chapter he tells us that the ram is the Medo-Persion Empire and the two horns are the two powers and that the highest horn is the Persians. He sees the ram pushing West, North and South and none could stop him. He had conquered all regions from the Caspian Sea to Egypt.</p>\n<p>Then he sees a goat with one horn, later in this chapter he identifies the goat as the king of Greece (Alexander the Great). Daniel sees the goat run into the ram with all his fury. When Alexander’s army met Darius on the field of battle, at Arbela, Granicus and at Issus he had thirty five thousand soldiers and Darius had five hundred thousand. In the first battle Alexander lost five hundred and Darius lost one hundred thousand. As the prophet says: ‘he ran into him with all his fury’.</p>\n<p>The goat became great (ruled the world) and his horn was broken (Alexander died) and four horns sprang up in it place. (His four generals will rule the world). A little horn sprang up from the Seleucid’s that ruled Syria, his name was <strong>Antiochus Epiphanies</strong> who attacked the Holy Land and desecrated the temple and took away the daily sacrifice for twenty three hundred days. The exposition section will describe in detail this foul character.</p>\n\n<h2>Decoding the Prophetic Vision of the Ram and the Goat</h2>\n\n<h3>Daniel 8:1</h3>\n<blockquote class=\"primary-scripture\">In the third year of the reign of king Belshazzar a vision appeared unto me, even unto me Daniel, after that which appeared unto me at the first.</blockquote>\n<p>In the year of 548 BC which was the third year of the reign of Belshazzar a vision came to Daniel. He was probably twenty-one when he was exiled and about eighty six years old at this time. A vision may occur when awake or in ecstasy; however the former one occurred when he was asleep (Dan. 7:1). The representation would seem to have been make to pass before his mind in open day and when fully awake.</p>\n\n<h3>Daniel 8:2</h3>\n<blockquote class=\"primary-scripture\">And I saw in a vision; and it came to pass, when I saw, that I was at Shushan in the palace, which is in the province of Elam; and I saw in a vision, and I was by the river of Ulai.</blockquote>\n<p>Daniel was living in the Palace in the city of Shushan (Susa) in Persia. When he seen the vision he was standing beside the Ulai River. However, at this time the Babylonian empire was still in existence and will continue until 539 B.C. It was probably a summer palace. Daniel was a high ranking government official and therefore could be at any one of the palaces. This city is now a gloomy wilderness inhabited by lions, hyenas and other beasts of prey.</p>\n\n<h3>Daniel 8:3</h3>\n<blockquote class=\"primary-scripture\">Then I lifted up mine eyes, and saw, and, behold, there stood before the river a ram which had two horns: and the two horns were high; but one was higher than the other, and the higher came up last.</blockquote>\n<p>In this vision he sees a Ram with two horns and one was higher than the other. In verse 20 Daniel says that the ram with the two horns are the two kings of Persia. So, the vision will be about the Medo-Persian empire. This empire consisted of 127 provinces and extended from India to Ethiopia, the boundaries of the then known world. Two horns represent the two powers, the Medes and the Persians, and one higher than the other means that the Persian power rose higher than the Medes. Verse 20 tells us that the two horns are the two kings of Media and Persia.</p>\n\n<h3>Daniel 8:4</h3>\n<blockquote class=\"primary-scripture\">I saw the ram pushing westward, and northward, and southward; so that no beasts might stand before him, neither was there any that could deliver out of his hand; but he did according to his will, and became great.</blockquote>\n<p>In the previous verse we learned that the Ram was the Empire of Medo-Persia. This ram was extending its possessions in three directions. East is not mentioned because none of her conquests were in that direction. She pushed West and conquered Babylonia, Mesopotania, Syria, and Asia Minor. She pushed North and conquered Colchis, Armenia, Iberia, and the regions around the Caspian Sea. She pushed South and conquered the regions of Palestine, Ethiopia, Egypt, Libya. It became great and had subdued to itself a large portion of the world, extending from India to Ethopia.</p>\n\n<h3>Daniel 8:5</h3>\n<blockquote class=\"primary-scripture\">And as I was considering behold, an he goat came from the west on the face of the whole earth, and touched not the ground: and the goat had a notable horn between his eyes.</blockquote>\n<p>In the vision Daniel sees a he goat with one horn. The goat represented the Greek or Macedonian empire. The goat touched not the ground surely represents the swiftness of the movement of Alexander’s army. The rough goat is the king of Grecia; and the great horn that is between his eyes is the first king (Daniel 8:21). The Greeks were known as the goat people from antiquity. It is remarkable that Alexander’s son by Roxana was named Alexander Aegus, or the son of the goat, and some of Alexander’s successors are represented in their coins with goat’s horns. Bronze figures of a goat have been found as a symbol of Macedon.</p>\n<p>When Alexander came to Jerusalem a group of priests met with him and showed him the prophecies of Daniel and he perceived that they referred to him and so he bestowed great favors upon the Jews. I will a quote a portion of what Josephus wrote in his book <em>Antiquities of the Jews</em>:</p>\n<blockquote>“And when he understood that he was not far from the city, he went out in procession, with the priests and the multitude of the citizens... And when the Book of Daniel was showed him wherein Daniel declared that one of the Greeks should destroy the empire of the Persians, he supposed that himself was the person intended.”</blockquote>\n\n<h3>Daniel 8:6</h3>\n<blockquote class=\"primary-scripture\">And he came to the ram that had two horns, which I had seen standing before the river, and ran unto him in the fury of his power.</blockquote>\n<p>Alexander the Great, king of Macedonia, conquer of the Persian Empire, was probably the greatest military geniuses of all times. He conquered the world in 12 years. And he gathered a mighty strong host and ruled over countries, and nations, and kings, who became tributaries unto him. On his way to conquer Tyre he passed through Jerusalem and the High Priest showed Alexander the prophecies of the prophet Daniel. When he read the sacred writings he was convinced that he was the person mentioned as the “Goat with one Horn”. Armed with this information Alexander is ready to take on the Persian Empire. The greatest and most impressive battle of all was when Alex met the King of Persia by the name of Darius.</p>\n\n<h3>Daniel 8:7</h3>\n<blockquote class=\"primary-scripture\">And I saw him come close unto the ram, and he was moved with choler against him, and smote the ram, and brake his two horns: and there was no power in the ram to stand before him, but he cast him down to the ground, and stamped upon him: and there was none that could deliver the ram out of his hand.</blockquote>\n<p>This represents the fierceness and fury with which he attacked the Persians at the Granicus, at Ittus, and Arbella, with which he overthrew and invaded their country. Alexander acted as if he were furiously enraged—on the eve of the battle, Darius sent ten chief relatives to sue for peace. When they had presented their conditions to Alexander. He said, “heaven cannot support two sons, nor the earth two masters.” So, the goat with one horn stomped the ram with two horns. Any world history book will give you the full story of Alexander the Great conquering the world.</p>\n\n<h3>Daniel 8:8</h3>\n<blockquote class=\"primary-scripture\">Therefore the he goat waxed very great: and when he was strong, the great horn was broken; and for it came up four notable ones toward the four winds of heaven.</blockquote>\n<p>The Prophet said that when he was strong that the great horn (Alexander) would be broken and that four notable ones would rise up from the four winds. At the age of 33 He drank the Herculean cup and laid in a drunken coma for 10 days before he expired. The kingdom did not go to his sons but was divided among his four generals and they ruled the empire which was divided into North, South, East and West (the four winds).</p>\n<p>The following quote is from the First Book of Machabees regarding Alexander's death:</p>\n<blockquote>“And after these things he fell sick, and perceived that he should die. Wherefore he called his servants, such as were honourable, and had been brought up with him from his youth, and parted his kingdom among them, while he was yet alive. So Alexander reigned twelve years, and then died.”</blockquote>\n\n<h3>Daniel 8:9</h3>\n<blockquote class=\"primary-scripture\">And out of one of them came forth a little horn, which waxed exceeding great, toward the south, and toward the east, and toward the pleasant land.</blockquote>\n<p>Watch carefully, because Daniel says that out of one of them came forth a little horn. So, the little horn must come from one of the <strong>FOUR NOTABLE ONES</strong> of the previous verse. We therefore identify him as <strong>Antiochus Epiphanes</strong>. He was the younger son of Antiochus the Great, who usurped the kingdom, to the prejudice of his nephew Demetrius.</p>\n<p><strong>ALEXANDER’S SUCCESSORS</strong></p>\n<p>Alexander’s Principal Generals, soon after his death, divided his empire among themselves. By the decisive battle of Ipsus (301 B.C.), the conflict was ended, and the following distribution of the territory made:</p>\n<ul>\n  <li><strong>Ptolemy</strong> received Egypt, and conquered all of Palestine, Phoenicia, and Cyprus.</li>\n  <li><strong>Lysimachus</strong> received Thrace and nearly all of Asia Minor.</li>\n  <li><strong>Seleucus</strong> received Syria and the East, and he afterward conquered Asia Minor.</li>\n  <li><strong>Cassander</strong> received Macedon and Greece.</li>\n</ul>\n<p>The succession of princes who reigned in Antioch, from Seleucus to Antiochus Epiphanes, were as follows:</p>\n<ol>\n  <li>Seleucus Nicator, B.C. 312-280.</li>\n  <li>Antiochus Sotor, his son, 280-261.</li>\n  <li>Antiochus Theos, his son, 261-247.</li>\n  <li>Seleucus Callinicus, his son, 247-226.</li>\n  <li>(Alexander), or Seleucus Ceraunus, his son, 226-223.</li>\n  <li>Antiochus the Great, his brother, 223-187.</li>\n  <li><strong>Antiochus Epiphanes</strong>, his brother, 176-164.</li>\n</ol>\n\n<h3>Daniel 8:10</h3>\n<blockquote class=\"primary-scripture\">And it waxed great, even to the host of heaven; and it cast down some of the host and of the stars to the ground, and stamped upon them.</blockquote>\n<p>The History of Josephus about Antiochus Epiphanes shows how he fulfills the prophecy of Daniel 8:9-27. It will further expose all the futuristic interpretations that are prevalent today.</p>\n<blockquote>“He also spoiled the temple, and put a stop to the constant practice of offering a daily sacrifice of expiation for three years and six months... he compelled the Jews to dissolve the laws of their country, and to keep their infants uncircumcised, and to sacrifice swine’s flesh upon the altar.” (Josephus)</blockquote>\n\n<h3>Daniel 8:11</h3>\n<blockquote class=\"primary-scripture\">Yea, he magnified himself even to the prince of the host, and by him the daily sacrifice was taken away, and the place of his sanctuary was cast down.</blockquote>\n<p>I will be quoting extensively from the book of First and Second Machabees, which contains the history of this period. No one can understand this section of the book of Daniel who has not read the Machabees. The author of this commentary regards them as accurate history and there can be no doubt of their authenticity.</p>\n<blockquote>“And entered proudly into the sanctuary, and took away the golden altar, and the candlestick of light... And when he had taken all away, he went into his own land, having made a great massacre, and spoken very proudly.” (1 Maccabees)</blockquote>\n\n<h3>Daniel 8:12</h3>\n<blockquote class=\"primary-scripture\">And an host was given him against the daily sacrifice by reason of transgression, and it cast down the truth to the ground; and it practiced, and prospered.</blockquote>\n<p>The following composite of historical facts and forensic evidence should convince any Bible believer that Antiochus Epiphanes fulfills these scriptures.</p>\n<blockquote>“And whosoever would not do according to the commandment of the king, he said, he should die... And when they had rent in pieces the books of the law which they found, they burnt them with fire.”</blockquote>\n\n<h3>Daniel 8:13</h3>\n<blockquote class=\"primary-scripture\">Then I heard one saint speaking, and another saint said unto that certain saint which spake, How long shall be the vision concerning the daily sacrifice, and the transgression of desolation, to give both the sanctuary and the host to be trodden under foot?</blockquote>\n<p>This conversation was regarding the time limit that God would permit the <strong>TRANSGRESSION OF ABOMINATION</strong> to last. The collation of historical facts presented in this commentary is overwhelming.</p>\n\n<h3>Daniel 8:14</h3>\n<blockquote class=\"primary-scripture\">And he said unto me, Unto two thousand and three hundred days; then shall the sanctuary be cleansed.</blockquote>\n<p>This calculation would equal six years and one hundred and ten days. From the time that Antiochus Epiphanes entered Jerusalem and took away the daily sacrifice till the cleansing of the temple was 2300 days: <strong>171 B.C. to 165 B.C.</strong> Wow! God’s Word and history’s connection proves that prophecy is true in every detail.</p>\n<blockquote>“Now upon the same day that the strangers profaned the temple, on the very same day it was cleansed again, even the five and twentieth day of the same month, which is Casleu.” (1 Maccabees)</blockquote>\n<p>They established a feast of Dedication and each year celebrated it. We are told in John 10:22 that Jesus was in Jerusalem at the feast of Dedication and walked in the Temple in Solomon’s porch.</p>\n\n<h3>Daniel 8:15-16</h3>\n<blockquote class=\"primary-scripture\">And it came to pass, when I, even I Daniel, had seen the vision, and sought for the meaning, then, behold, there stood before me as the appearance of a man. And I heard a man's voice between the banks of Ulai, which called, and said, Gabriel, make this man to understand the vision.</blockquote>\n<p>Under divine orders, someone appears before Daniel in the form of a human being. He looked like a man, he talked like a man but he had a divine mission, which was to instruct Gabriel to reveal the meaning of the vision to Daniel.</p>\n\n<h3>Daniel 8:17</h3>\n<blockquote class=\"primary-scripture\">So he came near where I stood: and when he came, I was afraid, and fell upon my face: but he said unto me, Understand, O son of man: for at the time of the end shall be the vision.</blockquote>\n<p>It is evident and collaborated with scripture truth that the time of the end is not the end of the world, but the latter end of the verse declares that the time of the end shall be the vision. In other words 150 years later Antiochus Epiphanies who is the main subject of the vision will be brought down to the grave and the temple rededicated and temple worship restored.</p>\n\n<h3>Daniel 8:18</h3>\n<blockquote class=\"primary-scripture\">Now as he was speaking with me, I was in a deep sleep on my face toward the ground: but he touched me, and set me upright.</blockquote>\n<p>Daniel was lying face down, unconscious, as though he was in a trance or a dead faint. Now the angel Gabriel touches him and set him in an upright position.</p>\n\n<h3>Daniel 8:19</h3>\n<blockquote class=\"primary-scripture\">And he said, Behold, I will make thee know what shall be in the last end of the indignation: for at the time appointed the end shall be.</blockquote>\n<p>Wow! Gabriel is going to reveal the remaining events of the scene. The rest of the chapter will reveal the secret. There is to be an end to the Medo-Persian, Grecian Empire and of the little horn. The vision ended with the downfall of the little horn (Antiochus Epiphanes). This is THE END that verse 17 and 19 are referring too. It is the end of the INDIGNATION created by Antiochus Epiphanes.</p>\n\n<h3>Daniel 8:20</h3>\n<blockquote class=\"primary-scripture\">The ram which thou sawest having two horns are the kings of Media and Persia.</blockquote>\n<p>Nothing could be plainer. Cyrus and Darius the Kings of Media and Persia.</p>\n\n<h3>Daniel 8:21</h3>\n<blockquote class=\"primary-scripture\">And the rough goat is the king of Grecia: and the great horn that is between his eyes is the first king.</blockquote>\n<p>No wonder Alexander the Great liked the book of Daniel because he could see himself in the prophecy. Daniel, thru the telescope of prophecy, saw the rise of Alexander the Great about 200 years before it happened.</p>\n\n<h3>Daniel 8:22</h3>\n<blockquote class=\"primary-scripture\">Now that being broken, whereas four stood up for it, four kingdoms shall stand up out of the nation, but not in his power.</blockquote>\n<p>The single horn is broken and from its roots comes four horns. Alexander the great was broken and his four generals divided the empire and ruled over it. Alexander’s kingdom was now divided among his four generals. Seleucus ruled Syria and the East. Lysimachus ruled Blthynia and Thrace, Ptolemy Soter ruled Egypt and Cassander ruled Macedonia.</p>\n\n<h3>Daniel 8:23</h3>\n<blockquote class=\"primary-scripture\">And in the latter time of their kingdom, when the transgressors are come to the full, a king of fierce countenance, and understanding dark sentences, shall stand up.</blockquote>\n<p>Please note that “in the latter time of their kingdom” a king of fierce countenance should stand up. This give us double proof that it was Antiochus, called Epiphanes.</p>\n\n<h3>Daniel 8:24</h3>\n<blockquote class=\"primary-scripture\">And his power shall be mighty, but not by his own power: and he shall destroy wonderfully, and shall prosper, and practice, and shall destroy the mighty and the holy people.</blockquote>\n<blockquote>“At which time according to the commandment they (Antiochus Epiphanes etal) put to death certain women, that had caused their children to be circumcised... And he sent also that detestable ringleader Apollonius with an army of two and twenty thousand, commanding him to slay all those that were of perfect age.”</blockquote>\n\n<h3>Daniel 8:25</h3>\n<blockquote class=\"primary-scripture\">And through his policy also he shall cause craft to prosper in his hand; and he shall magnify himself in his heart, and by peace shall destroy many: he shall also stand up against the Prince of princes; but he shall be broken without hand.</blockquote>\n<p>Antiochus’ policy was slick, he pretended and promised peace, then when he caught them off guard he would destroy them. He ran his course and was finally destroyed and a human hand never touched him. The Eternal God that he had opposed struck him with a plague unlike any ever described in medical journals. This man literally rotted in his tracts. He stank so bad that he himself could not stand the smell.</p>\n<blockquote>“But the Lord Almighty, the God of Isreal, smote him with an incurable and invisible plague... So that the worms rose up out of the body of this wicked man, and whiles he lived in sorrow and pain, his flesh fell away, and the filthiness of his smell was noisome to all his army.” (2 Maccabees)</blockquote>\n\n<h3>Daniel 8:26</h3>\n<blockquote class=\"primary-scripture\">And the vision of the evening and the morning which was told is true: wherefore shut thou up the vision; for it shall be for many days.</blockquote>\n<p>Daniel is to keep the vision secret (for the time being) for it pertains to many days hence. He will in chapter eleven tell the full story.</p>\n\n<h3>Daniel 8:27</h3>\n<blockquote class=\"primary-scripture\">And I Daniel fainted, and was sick certain days; afterward I rose up, and did the king's business; and I was astonished at the vision, but none understood it.</blockquote>\n<p>Daniel lost consciousness; he was exhausted, ill for several days, too sick to go to work, told his boss that he was unable to discharge his duties. The vision had taken its toll on Daniel both mentally and physically.</p>",
  "faq": [
    {
      "question": "Who does the 'Little Horn' represent in Daniel Chapter 8?",
      "answer": "According to the commentary, the Little Horn represents Antiochus Epiphanes, a ruler from the Seleucid dynasty who desecrated the Temple, rather than a future Antichrist figure."
    },
    {
      "question": "What is the meaning of the 2300 days mentioned in Daniel 8:14?",
      "answer": "The commentary interprets the 2300 days as a literal period of six years and 110 days (171 B.C. to 165 B.C.), marking the time from the removal of the daily sacrifice by Antiochus until the cleansing of the Temple."
    },
    {
      "question": "How did Alexander the Great treat the Jewish people according to the text?",
      "answer": "Alexander treated the Jews favorably. When the High Priest showed him the prophecies in the Book of Daniel identifying him as the 'Goat' who would destroy Persia, Alexander granted them the right to enjoy their own laws."
    },
    {
      "question": "How did Antiochus Epiphanes die according to the commentary?",
      "answer": "He was 'broken without hand,' meaning he died by a divine plague where his body rotted and worms rose out of him while he was still alive, rather than by human military force."
    }
  ],
  "structuredData": [
    {
      "@context": "https://schema.org",
      "@type": "Article",
      "headline": "The Prophetic Vision of the Ram and the Goat",
      "description": "Explore the prophetic vision of the Medo-Persian Ram and the Greek Goat. Witness the rise of Alexander the Great and the vile Antiochus Epiphanes in history.",
      "author": {
        "@type": "Person",
        "name": "Lewis P. Hussell"
      },
      "about": [
        {
          "@type": "Person",
          "name": "Alexander the Great",
          "description": "The King of Greece, represented as the Goat with one horn.",
          "sameAs": "https://en.wikipedia.org/wiki/Alexander_the_Great"
        },
        {
          "@type": "Person",
          "name": "Antiochus Epiphanes",
          "description": "The Little Horn who rose from the Seleucid dynasty and desecrated the Temple.",
          "sameAs": "https://en.wikipedia.org/wiki/Antiochus_IV_Epiphanes"
        },
        {
          "@type": "Place",
          "name": "Medo-Persian Empire",
          "description": "The empire represented by the Ram with two horns.",
          "sameAs": "https://en.wikipedia.org/wiki/Achaemenid_Empire"
        },
        {
          "@type": "CreativeWork",
          "name": "Daniel"
        },
        {
          "@type": "CreativeWork",
          "name": "Chapter 8"
        }
      ],
      "keywords": "Antiochus Epiphanes little horn, Daniel 8 2300 days prophecy fulfillment, Alexander the Great Daniel prophecy, Daniel 8 historical interpretation, Ram and Goat vision Medo-Persia Greece, Daniel 8 and Maccabees, Feast of Dedication prophecy"
    },
    {
      "@context": "https://schema.org",
      "@type": "FAQPage",
      "mainEntity": [
        {
          "@type": "Question",
          "name": "Who does the 'Little Horn' represent in Daniel Chapter 8?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "According to the commentary, the Little Horn represents Antiochus Epiphanes, a ruler from the Seleucid dynasty who desecrated the Temple, rather than a future Antichrist figure."
          }
        },
        {
          "@type": "Question",
          "name": "What is the meaning of the 2300 days mentioned in Daniel 8:14?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The commentary interprets the 2300 days as a literal period of six years and 110 days (171 B.C. to 165 B.C.), marking the time from the removal of the daily sacrifice by Antiochus until the cleansing of the Temple."
          }
        },
        {
          "@type": "Question",
          "name": "How did Alexander the Great treat the Jewish people according to the text?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "Alexander treated the Jews favorably. When the High Priest showed him the prophecies in the Book of Daniel identifying him as the 'Goat' who would destroy Persia, Alexander granted them the right to enjoy their own laws."
          }
        },
        {
          "@type": "Question",
          "name": "How did Antiochus Epiphanes die according to the commentary?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "He was 'broken without hand,' meaning he died by a divine plague where his body rotted and worms rose out of him while he was still alive, rather than by human military force."
          }
        }
      ]
    },
    {
      "@context": "https://schema.org",
      "@type": "BreadcrumbList",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://4thewordofgod.com/"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Commentaries",
          "item": "https://4thewordofgod.com/commentaries/"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Daniel",
          "item": "https://4thewordofgod.com/commentaries/daniel"
        },
        {
          "@type": "ListItem",
          "position": 4,
          "name": "Chapter 8",
          "item": "https://4thewordofgod.com/commentaries/daniel/8"
        }
      ]
    }
  ],
  "metaDescription": "Explore the prophetic vision of the Medo-Persian Ram and the Greek Goat. Witness the rise of Alexander the Great and the vile Antiochus Epiphanes in history.",
  "keywords": [
    "Antiochus Epiphanes little horn",
    "Daniel 8 2300 days prophecy fulfillment",
    "Alexander the Great Daniel prophecy",
    "Daniel 8 historical interpretation",
    "Ram and Goat vision Medo-Persia Greece",
    "Daniel 8 and Maccabees",
    "Feast of Dedication prophecy"
  ],
  "previous_chapter": "daniel_07",
  "next_chapter": "daniel_09"
}