{
  "book_name": "Daniel",
  "chapter_number": "11",
  "title": "Prophecies of Xerxes, Alexander the Great, and Future Kings",
  "content": "<h2>Introduction to the Prophetic History</h2>\n<p>Remember that in chapter ten, God revealed to Daniel what would befall his people in the latter end. In this chapter, He downloads the whole story. First, the fourth king of Persia (<strong>Xerxes</strong>) will stir up the king of Greece (<strong>Alexander the Great</strong>). Just at the peak of his triumphancy, Alexander will be broken and his kingdom divided towards the four winds of heaven. A novice at history will immediately realize that Alexander’s kingdom went to his four generals. The remaining part of the chapter tells the story of the <strong>King of the North (Syria)</strong> and the <strong>King of the South (Egypt)</strong>.</p>\n\n<p>The King of the North (Antiochus) divorces Laodice in order to marry Bernice, the daughter of the King of the South. Their son would rule the North kingdom (Syria). The angel tells Daniel that this pre-nuptial marriage agreement will not stand. The exposition will tell about the divorce, disinheriting, poisoning, murder, and with them the historical fulfillment of prophecy.</p>\n\n<p>A branch was to come up out of the root of Laodice and enter the kingdom of the north (Syria). This too was fulfilled under Ptolemy Euergetes. The marriage of Cleopatra (daughter of Antiochus, king of Syria) to Ptolemy king of Egypt was arranged in order to exploit the kingdom of Egypt. The rise of <strong>Antiochus Epiphanes</strong>, one of the worst men in history, is discussed in the exposition. This chapter represents the climax of Daniel's prophecy. A great blessing awaits those who learn how specific and detailed God's revelation is.</p>\n\n<h3>Chronological Table of the Northern Kingdom (Kings of Syria)</h3>\n<p><em>KNOWN AS THE SELEUCIDAE</em></p>\n<ul>\n<li><strong>323 B.C. SELEUCUS NICATOR</strong> - Reigned 33 years.</li>\n<li><strong>279 B.C. ANTIOCHUS SOTER</strong> - Reigned 19 years.</li>\n<li><strong>260 B.C. ANTIOCHUS THEUS</strong> - Reigned 15 years.</li>\n<li><strong>245 B.C. SELEUCUS CALLINICUS</strong> - Reigned 20 years.</li>\n<li><strong>225 B.C. SELEUCUS CREANUS</strong> - Reigned 3 years.</li>\n<li><strong>222 B.C. ANTIOCHUS THE GREAT</strong> - Reigned 36 years.</li>\n<li><strong>187 B.C. SELEUCUS PHILOPATOR</strong> - Reigned 11 years.</li>\n<li><strong>175 B.C. ANTIOCHUS EPIPHANES</strong> - Reigned 11 years.</li>\n</ul>\n\n<h3>Chronological Table of the Southern Kingdom (Kings of Egypt)</h3>\n<p><em>KNOWN AS THE PTOLEMY’S</em></p>\n<ul>\n<li><strong>B.C. 304 PTOLEMY SOTER</strong> - Reigned 20 years.</li>\n<li><strong>B.C. 284 PTOLEMY PHILODELPHUS</strong> - Reigned 38 years.</li>\n<li><strong>B.C. 246 PTOLEMY EURGETES</strong> - Reigned 25 years.</li>\n<li><strong>B.C. 221 PTOLEMY PHILOPATOR</strong> - Reigned 17 years.</li>\n<li><strong>B.C. 204 PTOLEMY EPIPHANES</strong> - Reigned 24 years.</li>\n<li><strong>B.C. 180 PTOLEMY PHILOMETER</strong> - Reigned 35 years.</li>\n</ul>\n\n<p>I thought it necessary to provide a guided tour through chapter eleven because it contains extensive historical quotes and may be difficult to follow. Machabees is the key to understanding the eleventh chapter of Daniel.</p>\n\n<p>Daniel begins by telling us that he will show us the truth. We should be eager to hear and understand the truth. We are told that the forth king of Persia (Xerxes) will pick a fight with Alexander the Great and that Alexander will gain control of the world, however he will lose his life and his kingdom will be divided. His wife, Roxana and his son Alexander Aegus, will not inherit the kingdom but it will pass to his four generals. Only two of the four kingdoms survive for long. So, this chapter will be about these two kingdoms, namely the kingdom of the North (Syria) and the kingdom of the South (Egypt).</p>\n\n<p>Later <strong>Bernice</strong>, who is the daughter of the Egyptian king (Ptolemy Soter), marries the Northern king (Antiochus Theos), but he must first divorce his wife <strong>Laodice</strong>. An agreement is made that the heir of Bernice will inherit the Northern Kingdom (Syria). When his father-in-law dies, the Northern king (Syria) decides to divorce Bernice and remarry Laodice, his former wife, and thus forfeit the agreement.</p>\n\n<p>However, she doesn’t trust him, so she poisons her husband (Antiochus Theus) and then proceeds to have her husbands second wife Bernice and her son murdered so that her children will inherit the throne. She and her son seek political asylum, but are found and killed along with the Egyptians that accompanied her.</p>\n\n<p>Her brother, Seluccus Callinicus, (who is out of her roots,) becomes the king of Syria, and decides to declare war on Egypt, but fails and returns home. Then his sons gather a large army and attack Egypt again, but Egypt won. The Syrian king will be back yet again with a larger army. Some Jews will ally themselves with this Syrian king, <strong>Antiochus the Great</strong> and help him gain victory but this will only prove their undoing.</p>\n\n<p>It looks as though this Syrian king is unbeatable. Antiochus the Great will capture Sidon, attack Jerusalem, set up a garrison in Jerusalem, and control all of Palestine. Antiochus the Great will give his daughter Cleopatra to the Egyptian king, but this proves to be another Syrian blunder; for she was loyal to her husband and the arrangement backfired. Antiochus the Great will attack the coasts of Asia Minor and the Roman general, <strong>Scipio</strong> will defeat him, taking most of his territory at the Battle of Thermopylae and Magnesium.</p>\n\n<p>The Syrians become bridled with heavy taxes imposed on them by the Romans. The new Syrian king, Seleucus Philopater, will “raise their taxes” and lose his life robbing temples in order to pay war reparations. The new heir to the throne will be set aside by <strong>Antiochus Epiphanes</strong>—a man who uses flattery and hypocrisy to gain control of Syria. This contemptible ruler will be successful in war, will be shrewd, and cunning. He will do worse than anyone before him when he sets up an idol of his god Jupiter Olympus in the Temple and sacrifices swine on God’s altar, additionally, he destroys many Jews.</p>\n\n<p>Antiochus Epiphanes will be successful in war over great armies like that of the Egyptian king, Ptolemy Philopator. He will depose Onias, who is the Prince of the covenant. He will wage war against the Machabees (Jews) and persecute Israel. Again he (Epiphanes) will attack Egypt but this time he will lose because the Roman ships of Chittum will come to Egypt's aid of Egypt and take much territory away from Antiochus Epiphanies.</p>\n\n<p>Finally, God sends a plague upon Antiochus. This homosexual apostate, Jew hating, vile, and treacherous man begins to rot piece by piece. In his final stages of the disease he thinks he can bargain with God for clemency. He starts by promising to get circumcised, thus become a Jew. He continues by promising to replace all that he plundered and go through this world heralding the praises of God. Additional information will be found on this liar and deceiver in the exposition.</p>\n\n<h2>Unveiling the Prophetic Wars of the North and South</h2>\n\n<h3>Daniel 11:1</h3>\n<blockquote class=\"primary-scripture\">Also I in the first year of Darius the Mede, even I, stood to confirm and to strengthen him.</blockquote>\n<p>At this time Cyrus and Darius are joint rulers. After the demise of the Babylonian Empire the rulers of the Persian Empire needed confirmation and strengthening. Read carefully the last verse of chapter ten and you will see that the angel Gabriel is the person who is giving this strength to Persia.</p>\n\n<h3>Daniel 11:2</h3>\n<blockquote class=\"primary-scripture\">And now will I shew thee the truth. Behold, there shall stand up yet three kings in Persia; and the fourth shall be far richer than they all: and by his strength through his riches he shall stir up all against the realm of Grecia.</blockquote>\n<p>If you have been waiting for the drama to unfold then you are in for a historical treat unlike anything you have ever dreamed. After the Angel assures Daniel that he is going to show the truth. He begins by showing him that there will be three kings in Persia, followed by a fourth, very strong king. History records their names as Cambyses, Smerdis, and Darius Hystaspia; and the fourth as <strong>Xerxes</strong>.</p>\n<p>Xerxes plundered temples, pillaged, and burnt until he was the richest monarch of the east. God had told the prophet Isaiah one hundred and seventy years before the event, that the two leaved gates would be left open, and that the treasures, hidden in secret places, would be opened for Cyrus. While this passage in Isaiah refers to Cyrus we must remember that Xerxes inherits his riches from his predecessors, as well as the plunder and taxes he imposed on the empire himself.</p>\n<blockquote>And I will give thee the treasures of darkness, and hidden riches of secret places, that thou mayest know that I, the LORD, which call thee by thy name, am the God of Israel. (Isa. 45:3)</blockquote>\n<p>The fulfillment of this prophecy is substantiated by several historians regarding Xerxes' massive expedition against Greece.</p>\n\n<h3>Daniel 11:3</h3>\n<blockquote class=\"primary-scripture\">And a mighty king shall stand up, that shall rule with great dominion, and do according to his will.</blockquote>\n<p>This mighty king was <strong>Alexander the Great</strong>. This quotation from the history books will confirm what the Angel said to Daniel regarding the Macedonian phalanx and his military prowess.</p>\n\n<h3>Daniel 11:4</h3>\n<blockquote class=\"primary-scripture\">And when he shall stand up, his kingdom shall be broken, and shall be divided toward the four winds of heaven; and not to his posterity, nor according to his dominion which he ruled: for his kingdom shall be plucked up, even for others beside those.</blockquote>\n<p>The Prophet said that when he was strong that a mighty King would stand up, and that the dominion would be great (World Wide) and that he would do as he pleased and that the Kingdom would be broken. Alexander would be broken and that four notable ones would rise up from the four winds. At the age of 33 He drank the Herculean cup and laid in a drunken coma for 10 days before he expired. The kingdom did not go to his sons, but was divided among his four generals.</p>\n<ul>\n<li><strong>North (Syria):</strong> General Seleucus</li>\n<li><strong>South (Egypt):</strong> General Ptolemy Soter</li>\n<li><strong>North/West (Blthynia/Thrace):</strong> General Lysimachus</li>\n<li><strong>West (Macedonia):</strong> General Cassander</li>\n</ul>\n\n<h3>Daniel 11:5</h3>\n<blockquote class=\"primary-scripture\">And the king of the south shall be strong, and one of his princes; and he shall be strong above him, and have dominion; his dominion shall be a great dominion.</blockquote>\n<p>After the death of Alexander, the kingdom wrangled and fought for about 20 years and then it was divided into four kingdoms. Now the prophecy only speaks of two. The two that remained were Syria, ruled by <strong>Seleucus Nicator (North)</strong>, and Egypt, ruled by <strong>Ptolemy Soter (South)</strong>. The scripture is correct in that Egypt the South is strong, but this other prince (Syria) will be even stronger.</p>\n\n<h3>Daniel 11:6</h3>\n<blockquote class=\"primary-scripture\">And in the end of years they shall join themselves together; for the king's daughter of the south shall come to the king of the north to make an agreement: but she shall not retain the power of the arm; neither shall he stand, nor his arm: but she shall be given up, and they that brought her, and he that begat her, and he that strengthened her in these times.</blockquote>\n<p>Here is how it all happened. <strong>Antiochus Theos</strong> attains the Northern throne and makes peace with <strong>Ptolemy Soter</strong> of the South. The terms: Antiochus would divorce his wife Laodice and marry Bernice, the daughter of Ptolemy Soter. The agreement was ratified by both sides and it was further agreed that the son from this marriage would inherit the throne.</p>\n<p>Following the death of Ptolemy Soter, Antiochus Theos decides to divorce Bernice and take back his ex-wife, Laodice. Laodice, not trusting Antiochus Theos, decides to murder him. So, she has his food poisoned. She did this to secure the kingdom for her son. In the meantime, she decides to have Bernice and her sons killed. Bernice and her son escape for a time, only to be found and murdered along with her helpers—just as prophesied.</p>\n\n<h3>Daniel 11:7-8</h3>\n<blockquote class=\"primary-scripture\">But out of a branch of her roots shall one stand up in his estate, which shall come with an army, and shall enter into the fortress of the king of the north, and shall deal against them, and shall prevail: And shall also carry captives into Egypt their gods, with their princes, and with their precious vessels of silver and of gold; and he shall continue more years than the king of the north.</blockquote>\n<p>Bernice is dead but this did not end the matter, for out of her roots shall one stand up in his estate. This is <strong>Ptolemy III (Euergetes)</strong>, Bernice's brother. He invaded Syria to avenge the death of his sister. He conquered Syria as far North as Antioch and was pressing towards Babylon when he was informed that trouble was brewing at home, so he headed back to Egypt. He brought back with him idols (gods) and vast treasures, including 40,000 talents of silver and 2,500 images.</p>\n\n<h3>Daniel 11:9</h3>\n<blockquote class=\"primary-scripture\">So the king of the south shall come into his kingdom, and shall return into his own land.</blockquote>\n<p>So the King of the South, who was Ptolemy Euergetes, having heard of unrest in his homeland returns to Egypt.</p>\n\n<h3>Daniel 11:10-12</h3>\n<blockquote class=\"primary-scripture\">But his sons shall be stirred up, and shall assemble a multitude of great forces: and one shall certainly come, and overflow, and pass through: then shall he return, and be stirred up, even to his fortress. And the king of the south shall be moved with choler, and shall come forth and fight with him... but he shall not be strengthened by it.</blockquote>\n<p>The two sons, Seleucus II and Antiochus II, are stirred up. <strong>Antiochus the Great</strong> commenced B.C. 219 by besieging Seleuceia. The King of the South (Ptolemy Philopator) is furious and comes out fighting. He wins the battle at Raphia and recovers what had been taken from him. However, his heart is lifted up; he attempts to enter the sanctuary in Jerusalem, but is struck with terror. He wins big time but does not follow up on his successes.</p>\n\n<h3>Daniel 11:13</h3>\n<blockquote class=\"primary-scripture\">For the king of the north shall return, and shall set forth a multitude greater than the former, and shall certainly come after certain years with a great army and with much riches.</blockquote>\n<p>Antiochus the Great, after ending the war beyond the Euphrates, raised a great army. Finding that Ptolemy Epiphanes, an infant, had succeeded Philopator, he united with Philip of Macedon to deprive the infant king of his throne.</p>\n\n<h3>Daniel 11:14-16</h3>\n<blockquote class=\"primary-scripture\">And in those times there shall many stand up against the king of the south: also the robbers of thy people shall exalt themselves to establish the vision; but they shall fall... But he that cometh against him shall do according to his own will, and none shall stand before him: and he shall stand in the glorious land, which by his hand shall be consumed.</blockquote>\n<p>Many stood up against the King of the South. Antiochus the Great seized Judea (\"the glorious land\"). The Jews, who had suffered between the two powers, eventually went over to Antiochus, assisting him when he besieged the garrison in the citadel of Jerusalem.</p>\n\n<h3>Daniel 11:17</h3>\n<blockquote class=\"primary-scripture\">He shall also set his face to enter with the strength of his whole kingdom, and upright ones with him; thus shall he do: and he shall give him the daughter of women, corrupting her: but she shall not stand on his side, neither be for him.</blockquote>\n<p>Antiochus (King of the North) gives his daughter, <strong>Cleopatra</strong>, in marriage to the King of Egypt (Ptolemy Epiphanes) to corrupt her and use her as a spy. However, she was true to her husband. As the word of God says, she would \"not stand on his (her father’s) side, neither be for him.\"</p>\n\n<h3>Daniel 11:18-19</h3>\n<blockquote class=\"primary-scripture\">After this shall he turn his face unto the isles, and shall take many: but a prince for his own behalf shall cause the reproach offered by him to cease... Then he shall turn his face toward the fort of his own land: but he shall stumble and fall, and not be found.</blockquote>\n<p>Antiochus turns to the isles and comes into contact with the Romans. The Roman General <strong>Scipio</strong> defeats him at Magnesia. Antiochus agrees to pay 12,000 talents. He decides to sack the temples in order to pay the war debt. However, in doing so there is a tumult and he is killed in the riot.</p>\n\n<h3>Daniel 11:20</h3>\n<blockquote class=\"primary-scripture\">Then shall stand up in his estate a raiser of taxes in the glory of the kingdom: but within few days he shall be destroyed, neither in anger, nor in battle.</blockquote>\n<p>This refers to <strong>Seleucus Philopator</strong>. He was a \"raiser of taxes\" to pay the Roman tribute. He reigned only eleven years and was destroyed by treachery, not in battle.</p>\n\n<h3>Daniel 11:21</h3>\n<blockquote class=\"primary-scripture\">And in his estate shall stand up a vile person, to whom they shall not give the honour of the kingdom: but he shall come in peaceably, and obtain the kingdom by flatteries.</blockquote>\n<p>Seleucus had a brother whose name was <strong>Antiochus Epiphanes</strong>. The world has never seen a more vile person. He did not obtain the crown by right of birth but seized it by flatteries and deceit.</p>\n\n<h3>Daniel 11:22-24</h3>\n<blockquote class=\"primary-scripture\">And with the arms of a flood shall they be overflown from before him... And after the league made with him he shall work deceitfully... He shall enter peaceably even upon the fattest places of the province...</blockquote>\n<p>Epiphanes comes against the new king of Egypt, Ptolemy Philometor, pretending friendship. He enters Egypt with a small army but uses deceit to get the upper hand, plundering the richest parts of the province.</p>\n\n<h3>Daniel 11:25-27</h3>\n<blockquote class=\"primary-scripture\">And he shall stir up his power and his courage against the king of the south with a great army... And both these kings' hearts shall be to do mischief, and they shall speak lies at one table; but it shall not prosper: for yet the end shall be at the time appointed.</blockquote>\n<p>Two kings (Philometor and Epiphanes) seated at the same table, each with a heart bent on evil, exchanging lies. Epiphanes was plotting the ruin of Philometor, and Philometor suspected the treachery but pretended not to see it.</p>\n\n<h3>Daniel 11:28-30</h3>\n<blockquote class=\"primary-scripture\">Then shall he return into his land with great riches; and his heart shall be against the holy covenant... For the ships of Chittim shall come against him: therefore he shall be grieved, and return, and have indignation against the holy covenant...</blockquote>\n<p>Antiochus determines to conquer Egypt (his fourth expedition). However, he runs into trouble as the \"ships of Chittim\" (Roman ambassadors and fleet) arrive. Popilius obliges him to lay down his arms and leave Egypt. Humiliated, he vents his indignation against Jerusalem and the holy covenant.</p>\n\n<h3>Daniel 11:31</h3>\n<blockquote class=\"primary-scripture\">And arms shall stand on his part, and they shall pollute the sanctuary of strength, and shall take away the daily sacrifice, and they shall place the abomination that maketh desolate.</blockquote>\n<p>Antiochus sent his armed forces to desecrate the Temple and profaned the sanctuary. He took away the daily sacrifice, set up idols, and sacrificed hogs on the altar. This is the Abomination of Desolation.</p>\n\n<h3>Daniel 11:32-35</h3>\n<blockquote class=\"primary-scripture\">And such as do wickedly against the covenant shall he corrupt by flatteries: but the people that do know their God shall be strong, and do exploits. And they that understand among the people shall instruct many: yet they shall fall by the sword, and by flame, by captivity, and by spoil, many days.</blockquote>\n<p>There were wicked Jews who forsook the covenant, but there were also those like the Maccabees who knew their God and stood strong. Daniel tells us that those with spiritual understanding will have a wide ministry but will be subjected to sword, flame, prison, and plunder.</p>\n\n<h3>Daniel 11:36-39</h3>\n<blockquote class=\"primary-scripture\">And the king shall do according to his will; and he shall exalt himself, and magnify himself above every god... But in his estate shall he honour the God of forces: and a god whom his fathers knew not shall he honour...</blockquote>\n<p>This arrogant blasphemer has no regard for the religion of his ancestors. He honors only the \"God of forces\" and a strange god whom he invented.</p>\n\n<h3>Daniel 11:40-45</h3>\n<blockquote class=\"primary-scripture\">And at the time of the end shall the king of the south push at him... But tidings out of the east and out of the north shall trouble him... And he shall plant the tabernacles of his palace between the seas in the glorious holy mountain; yet he shall come to his end, and none shall help him.</blockquote>\n<p>The end draws near for this evil ruler. Bad news comes from the east and north. He vents his fury on the Jews one last time. However, as prophesied, he comes to his end with none to help him. History records that God smote him with an incurable, invisible plague—a pain of the bowels that was remediless, leading to a miserable death where he finally acknowledged the power of God.</p>",
  "faq": [
    {
      "question": "Who is the 'vile person' mentioned in Daniel 11:21?",
      "answer": "The 'vile person' refers to Antiochus Epiphanes (Antiochus IV), who obtained the kingdom not by right of birth but by flatteries and deceit, and became one of the most vicious persecutors of the Jews."
    },
    {
      "question": "What is the meaning of the 'ships of Chittim' in verse 30?",
      "answer": "The 'ships of Chittim' refer to the Roman fleet and ambassadors (specifically Popilius) who intervened in Egypt, forcing Antiochus to withdraw, which led to his subsequent rage against Jerusalem."
    },
    {
      "question": "How was the prophecy regarding the marriage of the King of the North and the King of the South's daughter fulfilled?",
      "answer": "It was fulfilled when Antiochus Theos (North) married Bernice, the daughter of Ptolemy Soter (South). However, as prophesied, she did not 'retain the power of the arm'; she and her son were murdered by Antiochus's former wife, Laodice."
    },
    {
      "question": "What is the 'Abomination that Maketh Desolate' in the context of Daniel 11?",
      "answer": "Historically, this refers to the actions of Antiochus Epiphanes when he polluted the sanctuary, took away the daily sacrifice, set up an idol of Jupiter Olympus in the Temple, and sacrificed swine on God's altar."
    },
    {
      "question": "What does the commentary say about the death of Antiochus Epiphanes?",
      "answer": "The commentary states that God sent a plague upon him—a severe bowel disease where he began to rot while alive. In his final moments of pain, he acknowledged that it is meet to be subject unto God."
    }
  ],
  "structuredData": [
    {
      "@context": "https://schema.org",
      "@type": "Article",
      "headline": "God of Jewish Destiny: Prophetic Wars of the North and South",
      "description": "Explore the detailed historical fulfillment of prophecy concerning Alexander the Great, the Seleucids, the Ptolemies, and the vile Antiochus Epiphanes.",
      "author": {
        "@type": "Person",
        "name": "Lewis P. Hussell"
      },
      "about": [
        {
          "@type": "Person",
          "name": "Antiochus Epiphanes",
          "description": "The vile person and King of the North who desecrated the Temple.",
          "sameAs": "https://en.wikipedia.org/wiki/Antiochus_IV_Epiphanes"
        },
        {
          "@type": "Person",
          "name": "Alexander the Great",
          "description": "The mighty king whose kingdom was divided toward the four winds.",
          "sameAs": "https://en.wikipedia.org/wiki/Alexander_the_Great"
        },
        {
          "@type": "Organization",
          "name": "Seleucidae",
          "description": "The Kings of the North (Syria).",
          "sameAs": "https://en.wikipedia.org/wiki/Seleucid_Empire"
        },
        {
          "@type": "Organization",
          "name": "Ptolemies",
          "description": "The Kings of the South (Egypt).",
          "sameAs": "https://en.wikipedia.org/wiki/Ptolemaic_Kingdom"
        },
        {
          "@type": "Place",
          "name": "Jerusalem",
          "description": "The glorious land and site of the Temple desecration.",
          "sameAs": "https://en.wikipedia.org/wiki/Jerusalem"
        },
        {
          "@type": "CreativeWork",
          "name": "Daniel"
        },
        {
          "@type": "CreativeWork",
          "name": "Chapter 11"
        }
      ],
      "keywords": "Daniel 11 historical fulfillment, King of the North vs King of the South, Antiochus Epiphanes prophecy, Seleucid and Ptolemaic wars Daniel, Alexander the Great prophecy Daniel 11, Laodice and Bernice prophecy, Abomination of Desolation Antiochus Epiphanes"
    },
    {
      "@context": "https://schema.org",
      "@type": "FAQPage",
      "mainEntity": [
        {
          "@type": "Question",
          "name": "Who is the 'vile person' mentioned in Daniel 11:21?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The 'vile person' refers to Antiochus Epiphanes (Antiochus IV), who obtained the kingdom not by right of birth but by flatteries and deceit, and became one of the most vicious persecutors of the Jews."
          }
        },
        {
          "@type": "Question",
          "name": "What is the meaning of the 'ships of Chittim' in verse 30?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The 'ships of Chittim' refer to the Roman fleet and ambassadors (specifically Popilius) who intervened in Egypt, forcing Antiochus to withdraw, which led to his subsequent rage against Jerusalem."
          }
        },
        {
          "@type": "Question",
          "name": "How was the prophecy regarding the marriage of the King of the North and the King of the South's daughter fulfilled?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "It was fulfilled when Antiochus Theos (North) married Bernice, the daughter of Ptolemy Soter (South). However, as prophesied, she did not 'retain the power of the arm'; she and her son were murdered by Antiochus's former wife, Laodice."
          }
        },
        {
          "@type": "Question",
          "name": "What is the 'Abomination that Maketh Desolate' in the context of Daniel 11?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "Historically, this refers to the actions of Antiochus Epiphanes when he polluted the sanctuary, took away the daily sacrifice, set up an idol of Jupiter Olympus in the Temple, and sacrificed swine on God's altar."
          }
        },
        {
          "@type": "Question",
          "name": "What does the commentary say about the death of Antiochus Epiphanes?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The commentary states that God sent a plague upon him—a severe bowel disease where he began to rot while alive. In his final moments of pain, he acknowledged that it is meet to be subject unto God."
          }
        }
      ]
    },
    {
      "@context": "https://schema.org",
      "@type": "BreadcrumbList",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://4thewordofgod.com/"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Commentaries",
          "item": "https://4thewordofgod.com/commentaries/"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Daniel",
          "item": "https://4thewordofgod.com/commentaries/daniel"
        },
        {
          "@type": "ListItem",
          "position": 4,
          "name": "Chapter 11",
          "item": "https://4thewordofgod.com/commentaries/daniel/11"
        }
      ]
    }
  ],
  "metaDescription": "Explore the detailed historical fulfillment of prophecy concerning Alexander the Great, the Seleucids, the Ptolemies, and the vile Antiochus Epiphanes.",
  "keywords": [
    "Daniel 11 historical fulfillment",
    "King of the North vs King of the South",
    "Antiochus Epiphanes prophecy",
    "Seleucid and Ptolemaic wars Daniel",
    "Alexander the Great prophecy Daniel 11",
    "Laodice and Bernice prophecy",
    "Abomination of Desolation Antiochus Epiphanes"
  ],
  "previous_chapter": "daniel_10",
  "next_chapter": "daniel_12"
}