{
  "book_name": "Revelation",
  "chapter_number": "03",
  "title": "Warnings to Sardis, Philadelphia, and the Lukewarm Laodicea",
  "content": "<p>Sardis–The impregnable, situate upon a nearly inaccessible hill, its people were proud arrogant, over-confident. They were sure that no one could scale its perpendicular sides. Only one point of access. A very narrow neck at the south and this could be fortified very easily. But the enemy came in B.C. 549 and B.C. 218 and took Sardis. One unobserved, unguarded weak point, a crack in the wall. The chance of a thousand for a night attack. But the enemy came. Skillful mountain climbers scaled the slopes and dealt the crushing blow.</p><p>Today all that remains is a cemetery. Many of our great churches of the past are now living monuments. This church had no doctrinal problems—no mention of persecution or opposition. All it had was reputation without reality, form without force. Both times in history the city had been captured because sentries had gone to sleep and failed on their jobs, likewise, when God's sentries gets complacent the church is invaded by enemies. One writer called them a decent people with a dying witness and a decaying ministry. It is good to guard our heritage from Campbell but not embalm it. We must infuse spirit and life into a church.</p><h2>Restoring Spiritual Life to a Dead Reputation</h2><h3>Revelation 3:1</h3><blockquote class=\"primary-scripture\">You have a reputation of being alive, but you are dead.</blockquote><p>This church was a corps in a religious cloak. They had lost interest and enthusiasm.</p><h3>Revelation 3:2</h3><blockquote class=\"primary-scripture\">Wake up! Strengthen what remains and is about to die, for I have not found your deeds complete in the sight of my God.</blockquote><p>It enjoyed peace–the peace of a cemetery. Dead professors–profession is one thing, character is another.</p><p>Then he told this parable: A man had a fig tree, planted in his vineyard, and he went to look for fruit on it, but did not find any. So he said to the man who took care of the vineyard, For three years now I've been coming to look for fruit on this fig tree and haven't found any. Cut it down! Why should it use up the soil?' Sir, the man replied, 'leave it alone for one more year, and I'll dig around it and fertilize it. If it bears fruit next year, fine! If not, then cut it down. (Luke 13:6-9)</p><p>They had sunk into spiritual stupor and are now called upon to shake off slothfulness and fan the dying sparks.</p><p>For it is light that makes everything visible. This is why it is said: Wake up, O sleeper, rise from the dead, and Christ will shine on you. (Eph. 5:14)</p><p>And do this, understanding the present time. The hour has come for you to wake up from your slumber, because our salvation is nearer now than when we first believed. (Rom. 13:11)</p><h3>Revelation 3:3</h3><blockquote class=\"primary-scripture\">Remember, therefore, what you have received and heard; obey it, and repent. But if you do not wake up, I will come like a thief, and you will not know at what time I will come to you.</blockquote><p>Jesus calls upon them to remember the happy days of the past. The best way to prevent spiritual declension is to remember the happy days of when we first knew Jesus. We need to hold fast like a drowning man holds fast to the rope thrown to him.</p><h3>Revelation 3:4</h3><blockquote class=\"primary-scripture\">Yet you have a few people in Sardis who have not soiled their clothes. They will walk with me, dressed in white, for they are worthy.</blockquote><p>A few names in Sardis which have not defiled their garments. FEW! True too many places. Faith, love, genuine and sincere were lacking.</p><p>I delight greatly in the Lord; my soul rejoices in my God. For he has clothed me with garments of salvation and arrayed me in a robe of righteousness, as a bridegroom adorns his head like a priest, and as a bride adorns herself with her jewels. (Isa. 61:10)</p><p>Some put on the Christian uniform and fight for the world.</p><h3>Revelation 3:5</h3><blockquote class=\"primary-scripture\">He who overcomes will, like them, be dressed in white. I will never blot out his name from the book of life, but will acknowledge his name before my Father and his angels.</blockquote><p>Not blot out his name. While the lamp holds out to burn the vilest sinner may return. When church members die he removes their names from the book of life.</p><h3>Revelation 3:6</h3><blockquote class=\"primary-scripture\">He who has an ear, let him hear what the Spirit says to the churches.</blockquote><p>This life giving message is enough to revive a dead church.</p><p>Philadelphia has been called a church with an opportunity. Today about 10,000 people live there. This city was situate in a valley on a very important road. It derived its name from Attalus II, 159-138 B.C., whose loyalty to his brother Eumenes won him the epithet \"brother lover.\" It was founded with the intention of being a center for the spread of the Greek language and manners in Lydia and Phrygia. Hence from the beginning it was a missionary city and very successful in its purpose. It was located 20 miles from Sardis.</p><h2>The Divine Promise of Open Doors</h2><h3>Revelation 3:7</h3><blockquote class=\"primary-scripture\">To the angel of the church in Philadelphia write: These are the words of him who is holy and true, who holds the key of David. What he opens no one can shut, and what he shuts no one can open.</blockquote><p>You disowned the Holy and Righteous One and asked that a murderer be released to you. (Acts 3:14)</p><p>Such a high priest meets our need—one who is holy, blameless, pure, set apart from sinners, exalted above the heavens. (Heb 7:26)</p><p>He committed no sin, and no deceit was found in his mouth. (I Pet 2:22)</p><p><strong>He that is true.</strong></p><ul><li>We know also that the Son of God has come and has given us understanding, so that we may know him who is true. And we are in him who is true–even in his Son Jesus Christ. He is the true God and eternal life. (I John 5:20)</li><li>Jesus said to them, I tell you the truth, it is not Moses who has given you the bread from heaven, but it is my Father who gives you the true bread from heaven. (John 6:32)</li><li>Jesus answered, I am the way and the truth and the life. No one comes to the Father except through me. (John 14:6)</li><li>I am the true vine, and my Father is the gardener. (John 15:1)</li></ul><p><strong>Key of David.</strong></p><ul><li>I will place on his shoulder the key to the house of David; what he opens no one can shut, and what he shuts no one can open. (Isa. 22:22)</li><li>He will be great and will be called the Son of the Most High. The Lord God will give him the throne of his father David. (Luke 1:32)</li></ul><p>Such characteristics were a guarantee that his pronouncements would be true.</p><h3>Revelation 3:8</h3><blockquote class=\"primary-scripture\">I know your deeds. See, I have placed before you an open door that no one can shut. I know that you have little strength, yet you have kept my word and have not denied my name.</blockquote><p>\"I know thy works\" (KJV). Only Jesus truly knows our works and efforts and labors and difficulties.</p><p>Because a great door for effective work has opened to me, and there are many who oppose me. (I Cor 16:9)</p><p>Now when I went to Troas to preach the gospel of Christ and found that the Lord had opened a door for me. (Col. 4:3) And pray for us, too, that God may open a door for our message, so that we may proclaim the mystery of Christ, for which I am in chains. (2 Cor 2:12)</p><p>No one has the power to prevent you from rendering service. <strong>Little strength:</strong> This may mean that they were small compared to the pagan populace. They are complimented for resisting temptation and keeping his word.</p><h3>Revelation 3:9</h3><blockquote class=\"primary-scripture\">I will make those who are of the synagogue of Satan, who claim to be Jews though they are not, but are liars–I will make them come and fall down at your feet and acknowledge that I have loved you.</blockquote><p><strong>Synagogue of Satan:</strong> see comments 2:9. I will make them to come and worship before thy feet: This would be a fulfillment of Isaiah:</p><p>Therefore this is what the Lord, who redeemed Abraham, says to the house of Jacob: \"No longer will Jacob be ashamed; no longer will their faces grow pale. When they see among them their children, the work of my hands, they will keep my name holy; they will acknowledge the holiness of the Holy One of Jacob, and will stand in awe of the God of Israel. (Isa. 29:22,23)</p><p>The sons of your oppressors will come bowing before you; all who despise you will bow down at your feet and will call you the City of the Lord, Zion of the Holy One of Israel. (Isa 60:14)</p><h3>Revelation 3:10</h3><blockquote class=\"primary-scripture\">Since you have kept my command to endure patiently, I will also keep you from the hour of trial that is going to come upon the whole world to test those who live on the earth.</blockquote><p>To him who is able to keep you from falling and to present you before his glorious presence without fault and with great joy. (Jude 24)</p><p>We see that divine protection and human exertion go hand in hand. I will also keep you from the hour of trial:</p><ul><li>If you fully obey the Lord your God and carefully follow all his commands I give you today, the Lord your God will set you high above all the nations on earth. (Deut. 28:2)</li><li>All these blessings will come upon you and accompany you if you obey the Lord your God: (Deut. 28:1)</li><li>The Lord will grant that the enemies who rise up against you will be defeated before you. They will come at you from one direction but flee from you in seven. (Deut. 28:7)</li><li>The Lord will open the heavens, the storehouse of his bounty, to send rain on your land in season and to bless all the work of your hands. You will lend to many nations but will borrow from none. (Deut. 28:12)</li><li>If you listen carefully to what he says and do all that I say, I will be an enemy to your enemies and will oppose those who oppose you. (Ex. 23:22)</li><li>The Lord will make you the head, not the tail. If you pay attention to the commands of the Lord your God that I give you this day and carefully follow them, you will always be at the top, never at the bottom. (Deut. 28:13)</li></ul><p>If this is so, then the Lord knows how to rescue godly men from trials and to hold the unrighteous for the day of judgment, while continuing their punishment. (2 Pet. 2:9)</p><p>The period when temptation endangers your soul, Jesus will give you grace to sustain you.</p><h3>Revelation 3:11</h3><blockquote class=\"primary-scripture\">I am coming soon. Hold on to what you have, so that no one will take your crown.</blockquote><p>When Jesus comes He will raise the dead.</p><ul><li>Do not be amazed at this, for a time is coming when all who are in their graves will hear his voice and come out–those who have done good will rise to live, and those who have done evil will rise to be condemned. (John 5:28,29)</li><li>There is a judge for the one who rejects me and does not accept my words; that very word which I spoke will condemn him at the last day. (John 12:48)</li><li>And I have the same hope in God as these men, that there will be a resurrection of both the righteous and the wicked. (Acts 24:15)</li></ul><p>He will Judge the world.</p><ul><li>In the past God overlooked such ignorance, but now he commands all people everywhere to repent. For he has set a day when he will judge the world with justice by the man he has appointed. He has given proof of this to all men by raising him from the dead. (Acts 17:30,31)</li><li>You, then, why do you judge your brother? Or why do you look down on your brother? For we will all stand before God's judgment seat. It is written: As surely as I live, says the Lord, 'every knee will bow before me; every tongue will confess to God. So then, each of us will give an account of himself to God. (Rom. 14:10-12)</li><li>When the Son of Man comes in his glory, and all the angels with him, he will sit on his throne in heavenly glory. All the nations will be gathered before him, and he will separate the people one from another as a shepherd separates the sheep from the goats. (Mt. 25:31,32)</li></ul><p>He will give us a new body.</p><ul><li>But our citizenship is in heaven. And we eagerly await a Savior from there, the Lord Jesus Christ, who, by the power that enables him to bring everything under his control, will transform our lowly bodies so that they will be like his glorious body. (Phil. 3:20-21)</li></ul><p>He will sentence the wicked.</p><ul><li>And give relief to you who are troubled, and to us as well. This will happen when the Lord Jesus is revealed from heaven in blazing fire with his powerful angels. He will punish those who do not know God and do not obey the gospel of our Lord Jesus. They will be punished with everlasting destruction and shut out from the presence of the Lord and from the majesty of his power. (2 Th. 1:7-9)</li></ul><p><strong>So that no one will take your crown.</strong> Let no man take thy crown. cf. 2:10. Fear, unbelief and delay has caused many churches to neglect its God-given opportunities.</p><h3>Revelation 3:12</h3><blockquote class=\"primary-scripture\">Him who overcomes I will make a pillar in the temple of my God. Never again will he leave it. I will write on him the name of my God and the name of the city of my God, the new Jerusalem, which is coming down out of heaven from my God; and I will also write on him my new name.</blockquote><p>Overcometh is a favorite word of Jesus. When you feel crushed, defeated and downcast Jesus calls upon you to surmount, and subdue and conquer and overthrow your enemy. Dear reader if your soul has wandered into sin you may overcome the fetters that hold you. If you have been in the lowlands of strife and despair Jesus calls upon you today to overcome. If you are in dread sway you can overcome today. If you are bruised and fainting, footsore and weary, Jesus calls upon you to overcome. If your days are dark and fears possess you then Jesus says overcome. (I John 2:13,14; 4:4; 5:4,5).</p><p>Peter Marshall said, \"It is better to fail in a cause that will ultimately succeed than to succeed in a cause that will ultimately fail.\" I will make a pillar in the temple of my God.</p><ul><li>He erected the pillars in the front of the temple, one to the south and one to the north. The one to the south he named Jakin and the one to the north Boaz. (2 Chron. 3:17)</li><li>Today I have made you a fortified city, an iron pillar and a bronze wall to stand against the whole land–against the kings of Judah, its officials, its priests and the people of the land. (Jer 1:18)</li><li>James, Peter and John, those reputed to be pillars, gave me and Barnabas the right hand of fellowship when they recognized the grace given to me. They agreed that we should go to the Gentiles, and they to the Jews. (Gal. 2:9)</li></ul><p>Jesus promises to make them strong leaders and that they will be justly honored. Dear reader please trust in the promises.</p><h3>Revelation 3:13</h3><blockquote class=\"primary-scripture\">He who has an ear, let him hear what the Spirit says to the churches.</blockquote><p>Jesus begs us to hear his humble pleas. If you will hear him he will heal your wounds, help your unbelief, he will intercede for you if you will cast your heavy burden upon him.</p><p>Laodicea has been called the complacent church. It was located 40 miles south west of Philadelphia. Hot springs here emitting lukewarm water. A figure which they understood. Here grew up a famous school of medicine. Among other things it produced a remedy for weak eyes. Laodicea was famous for wealth. Home of millionaires. It had theaters, stadiums, gymnasiums, baths, etc. When partly wrecked by an earthquake in A.D. 61. they refused government aid. Even the church possessed this proud defiant, conceited attitude.</p><h2>Overcoming Lukewarmness in the Spiritual Life</h2><h3>Revelation 3:14</h3><blockquote class=\"primary-scripture\">To the angel of the church in Laodicea write: These are the words of the Amen, the faithful and true witness, the ruler of God's creation.</blockquote><p><strong>The Amen:</strong> The word Amen occurs 150 times and it translated 50 times \"Amen\" and 100 times \"verily.\" Thayer says that at the beginning of a discourse it means \"Surely, of a truth, truly.\" He says a repetition of a word as John alone uses it, has the force of a superlative, \"Most assuredly.\" And at the close of a sentence means, \"So be it, so be it, may it be fulfilled.\" The faithful and true witness. We can put complete reliance in Jesus. The ruler of God's creation.</p><p>The beginning of the creation of God:</p><ul><li>Through him all things were made; without him nothing was made that has been made. (John 1:3)</li><li>and to make plain to everyone the administration of this mystery, which for ages past was kept hidden in God, who created all things. (Eph. 3:9)</li><li>For by him all things were created: things in heaven and on earth, visible and invisible, whether thrones or powers or rulers or authorities; all things were created by him and for him. (Col. 1:16)</li></ul><h3>Revelation 3:15</h3><blockquote class=\"primary-scripture\">I know your deeds, that you are neither cold nor hot. I wish you were either one or the other!</blockquote><p>\"I know thy works\" (KJV): See comments on 2:9. \"Thou art neither cold nor hot.\" This church was filled with self conceit and self deceit. The Lord does not want us to indifferent. <strong>Hot</strong> means full of zeal and enthusiasm while <strong>cold</strong> means complacent and full of apathy.</p><h3>Revelation 3:16</h3><blockquote class=\"primary-scripture\">So, because you are lukewarm–neither hot nor cold–I am about to spit you out of my mouth.</blockquote><p>The ancient city and church have passed away. It has been spit out.</p><h3>Revelation 3:17</h3><blockquote class=\"primary-scripture\">You say, 'I am rich; I have acquired wealth and do not need a thing.' But you do not realize that you are wretched, pitiful, poor, blind and naked.</blockquote><p>They were blinded by their riches.</p><h3>Revelation 3:18</h3><blockquote class=\"primary-scripture\">I counsel you to buy from me gold refined in the fire, so you can become rich; and white clothes to wear, so you can cover your shameful nakedness; and salve to put on your eyes, so you can see.</blockquote><p><strong>Gold tried in the fire.</strong> They needed tried faith.</p><ul><li>These have come so that your faith–of greater worth than gold, which perishes even though refined by fire–may be proved genuine and may result in praise, glory and honor when Jesus Christ is revealed. (I Pet. 1:17)</li></ul><p><strong>White clothes.</strong></p><ul><li>I answered, Sir, you know. And he said, These are they who have come out of the great tribulation; they have washed their robes and made them white in the blood of the Lamb. (Rev. 7:14)</li><li>Young men, in the same way be submissive to those who are older. All of you, clothe yourselves with humility toward one another, because, God opposes the proud but gives grace to the humble. (I Pet 5:5)</li></ul><p>They needed the garments of righteousness.</p><ul><li>I delight greatly in the Lord; my soul rejoices in my God. For he has clothed me with garments of salvation and arrayed me in a robe of righteousness, as a bridegroom adorns his head like a priest, and as a bride adorns herself with her jewels. (Isa 61:10)</li></ul><p><strong>And salve to put on your eyes, so you can see.</strong> Anoint your eyes. This city manufactured eye salve so Jesus tells them they better buy some for themselves. Eye salve caused the eyes to smart and brought a flood of tears and washed away the obstruction. Oh! how they needed it.</p><ul><li>But if anyone does not have them, he is nearsighted and blind, and has forgotten that he has been cleansed from his past sins. (II Pet. 1:9)</li></ul><h3>Revelation 3:19</h3><blockquote class=\"primary-scripture\">Those whom I love I rebuke and discipline. So be earnest, and repent.</blockquote><p>Oh! That is why he writes–because he loves them. The emphasis is on the pronoun \"I.\" Jesus says shake off your complacency and repent.</p><h3>Revelation 3:20</h3><blockquote class=\"primary-scripture\">Here I am! I stand at the door and knock. If anyone hears my voice and opens the door, I will come in and eat with him, and he with me.</blockquote><p>Knocking represents two things:</p><ol><li>The desire of admittance.</li><li>The right of him who dwells within.</li></ol><p>If Christ is on the outside there is something wrong on the inside. When is Christ on the outside of a church?</p><ul><li>When in its fellowship respectability is thought more of than spiritual fervor.</li><li>When talent is thought more of than spiritual power.</li><li>When wealth and social position is recognized and growth in grace is not.</li><li>When a church boasts of its contributions instead of its faithful.</li></ul><h3>Revelation 3:21</h3><blockquote class=\"primary-scripture\">To him who overcomes, I will give the right to sit with me on my throne, just as I overcame and sat down with my Father on his throne.</blockquote><p><strong>To him that overcometh.</strong> Dear reader are you overcoming daily with the Spirit's sword? Are you overcoming your struggles and temptations, your tribulations and woes? Have you overcome your clouds of doubt? Jesus will give you power to conquer–He will set you free. Have you overcome where your wayward feet have lead you. If your spirit is oppressed, if fetters of sin bind you, if the lowlands of strife has latched on to you then be assured that you can overcome. The joy of salvation and all that it entails can be yours. Let Jesus into your life. Open the door today. \"I will give the right to sit with me on my throne.\"</p><p>And God raised us up with Christ and seated us with him in the heavenly realms in Christ Jesus. (Eph 2:6)</p><h3>Revelation 3:22</h3><blockquote class=\"primary-scripture\">He who has an ear, let him hear what the Spirit says to the churches.</blockquote><p>This is the same admonition that he has given to all of the churches</p>",
  "faq": [
    {
      "question": "What is the primary spiritual diagnosis of the church in Sardis according to the commentary?",
      "answer": "Sardis is described as having 'reputation without reality' and 'form without force.' Although they had a reputation for being alive and had no mentioned doctrinal problems or persecution, they were spiritually dead, likened to a corpse in a religious cloak."
    },
    {
      "question": "What does the 'Key of David' signify in the letter to Philadelphia?",
      "answer": "The Key of David represents the authority of Jesus as the one who is holy and true. It guarantees that when He opens a door, no one can shut it, and when He shuts a door, no one can open it, as prophesied in Isaiah 22:22."
    },
    {
      "question": "How does the commentary define the terms 'hot' and 'cold' in the letter to Laodicea?",
      "answer": "According to the text, 'hot' means to be full of zeal and enthusiasm, while 'cold' means to be complacent and full of apathy. The Lord prefers either state over being lukewarm, which is a state of indifference."
    },
    {
      "question": "What are the indications that Christ is on the 'outside' of a church as described in the commentary on Laodicea?",
      "answer": "Christ is considered on the outside when: 1) Respectability is valued over spiritual fervor; 2) Talent is valued over spiritual power; 3) Wealth and social position are recognized over growth in grace; and 4) A church boasts of its contributions rather than its faithful members."
    }
  ],
  "structuredData": [
    {
      "@context": "https://schema.org",
      "@type": "Article",
      "headline": "Spiritual Life, Open Doors, and the Cure for Lukewarmness",
      "description": "Discover the cure for spiritual apathy in Sardis, the promise of the open door in Philadelphia, and the remedy for the lukewarm heart in Laodicea.",
      "author": {
        "@type": "Person",
        "name": "Lewis P. Hussell"
      },
      "about": [
        {
          "@type": "Place",
          "name": "Sardis",
          "description": "A city described as having a reputation for life but being spiritually dead.",
          "sameAs": "https://en.wikipedia.org/wiki/Sardis"
        },
        {
          "@type": "Place",
          "name": "Philadelphia",
          "description": "A missionary city founded to spread Greek language, described as the church with an open door.",
          "sameAs": "https://en.wikipedia.org/wiki/Alaşehir"
        },
        {
          "@type": "Place",
          "name": "Laodicea",
          "description": "A wealthy city known for its medical school and eye salve, representing the complacent, lukewarm church.",
          "sameAs": "https://en.wikipedia.org/wiki/Laodicea_on_the_Lycus"
        },
        {
          "@type": "Thing",
          "name": "Key of David",
          "description": "A symbol of authority held by Jesus, meaning what He opens no one can shut.",
          "sameAs": "https://en.wikipedia.org/wiki/Key_of_David"
        },
        {
          "@type": "Thing",
          "name": "Book of Life",
          "description": "The record from which Jesus promises not to blot out the names of those who overcome.",
          "sameAs": "https://en.wikipedia.org/wiki/Book_of_Life"
        },
        {
          "@type": "CreativeWork",
          "name": "Revelation"
        },
        {
          "@type": "CreativeWork",
          "name": "Chapter 3"
        }
      ],
      "keywords": "Reputation without reality Sardis, When God's sentries get complacent, The key of David and open doors, Divine protection and human exertion, When Christ is on the outside of a church, The cure for lukewarmness Laodicea, Spiritual blindness and manufactured eye salve, Dying witness and a decaying ministry"
    },
    {
      "@context": "https://schema.org",
      "@type": "FAQPage",
      "mainEntity": [
        {
          "@type": "Question",
          "name": "What is the primary spiritual diagnosis of the church in Sardis according to the commentary?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "Sardis is described as having 'reputation without reality' and 'form without force.' Although they had a reputation for being alive and had no mentioned doctrinal problems or persecution, they were spiritually dead, likened to a corpse in a religious cloak."
          }
        },
        {
          "@type": "Question",
          "name": "What does the 'Key of David' signify in the letter to Philadelphia?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The Key of David represents the authority of Jesus as the one who is holy and true. It guarantees that when He opens a door, no one can shut it, and when He shuts a door, no one can open it, as prophesied in Isaiah 22:22."
          }
        },
        {
          "@type": "Question",
          "name": "How does the commentary define the terms 'hot' and 'cold' in the letter to Laodicea?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "According to the text, 'hot' means to be full of zeal and enthusiasm, while 'cold' means to be complacent and full of apathy. The Lord prefers either state over being lukewarm, which is a state of indifference."
          }
        },
        {
          "@type": "Question",
          "name": "What are the indications that Christ is on the 'outside' of a church as described in the commentary on Laodicea?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "Christ is considered on the outside when: 1) Respectability is valued over spiritual fervor; 2) Talent is valued over spiritual power; 3) Wealth and social position are recognized over growth in grace; and 4) A church boasts of its contributions rather than its faithful members."
          }
        }
      ]
    },
    {
      "@context": "https://schema.org",
      "@type": "BreadcrumbList",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://4thewordofgod.com/"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Commentaries",
          "item": "https://4thewordofgod.com/commentaries/"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Revelation",
          "item": "https://4thewordofgod.com/commentaries/revelation"
        },
        {
          "@type": "ListItem",
          "position": 4,
          "name": "Chapter 3",
          "item": "https://4thewordofgod.com/commentaries/revelation/3"
        }
      ]
    }
  ],
  "metaDescription": "Discover the cure for spiritual apathy in Sardis, the promise of the open door in Philadelphia, and the remedy for the lukewarm heart in Laodicea.",
  "keywords": [
    "Reputation without reality Sardis",
    "When God's sentries get complacent",
    "The key of David and open doors",
    "Divine protection and human exertion",
    "When Christ is on the outside of a church",
    "The cure for lukewarmness Laodicea",
    "Spiritual blindness and manufactured eye salve",
    "Dying witness and a decaying ministry"
  ],
  "previous_chapter": "revelation_02",
  "next_chapter": "revelation_04"
}