{
  "book_name": "Revelation",
  "chapter_number": "09",
  "title": "The Fallen Star: Prophecy of Mohammed and the Abyss",
  "content": "<p>There is little doubt that this chapter depicts the rise of <strong>Mohammed</strong>. The prophet sees a falling star: Mohammed was a fallen star. He who was destined to rule was set aside. He came with a smoke screen of deception like blowing smoke from an abyss. He came with a vast army of workers spreading over the eastern part of the empire. Their work of torment lasted <strong>one hundred and fifty years</strong>. His torment was worse than the sting of a scorpion. They were all on horseback. This mighty movement had its origin in Arabia. They had long beards, long hair, yellow turbans, and horse tails for banners. Every symbol in this chapter points to Arabia. By the eighth century, they controlled Egypt, Greece, Eastern Europe, Spain, Arabia, Syria, Portugal, and Africa. He used his &ldquo;key&rdquo; the <strong>Koran</strong>, which has no code of morals, to justify licentiousness, murder, and robbery.</p><p>Mohammed boldly claimed that he had ascended into the seventh heaven, and there before the effulgent majesty of the Almighty where he is informed that he is being sent with the sword to compel all the people in the world to cast away their religion and accept the Koran. The Koran says: &ldquo;A night spent in arms is more precious in the sight of God than months of fasting and prayer. Whosoever dies in battle, his sins are forgiven. In the Day of Judgment, his wounds shall be resplendent as vermilion, and odoriferous as musk. In the Mussulman&rsquo;s paradise, seventy-two damsels of sparkling beauty shall minister to the most humble of the faithful.&rdquo; The Turkish Empire has been the upholder of Mohammedism the last twelve hundred years. It was a penalty of death to profess Christianity in that empire till the treaty of Ryswick, 1844 AD, when the united powers of Christendom forced on the Turks the Act of Toleration. This treaty they have been flagrantly violating.</p><h2>Unveiling the Abyss: Mohammed, the Koran, and Prophecy</h2><h3>Revelation 9:1-2</h3><blockquote class=\"primary-scripture\">The fifth angel sounded his trumpet, and I saw a star that had fallen from the sky to the earth. The star was given the key to the shaft of the Abyss.</blockquote><p>A star fell from heaven must mean that a person of renown fell from his position. As I have before shown, a <strong>STAR</strong> is a person of high rank. In Genesis 37:9,10 Reuben, Simeon, Levi, Judah, Zebulun, Issachar, Dan, Gad, Asher, Naphtali; and Benjamin are called stars. We speak of great actors as stars. Great players in sports are stars. Let's look in history and see if we can identify a fallen star that fell from to the earth.</p><p>As I continue the historical interpretation we look to the year 612-762 and to the Mohammedan movement. <strong>Mohammed</strong> was indeed a fallen star. He was of the princely house of the Koreish&ndash;the ruling family of Mecca. At birth, his grandfather was ruling. Soon thereafter his father died. Then his grandfather died. The boy destined to rule was set aside. Given the key to the shaft of the Abyss. Mohammed began his work with a book called the <strong>Koran</strong> (Key of the shaft of the Abyss) without this so-called revelation, he could not succeed in his devilish work. He began his work in Arabia, which is 1800 by 900 miles. It is also noteworthy to point out that he began his work in the east the same year that Boniface II became pope. (This is the first pope, despite any claims of the Catholic Church). Sergus a Nestorian Monk is reputed to have wrote the Koran. The reader should note also that their flag has a star and a crescent on it.</p><blockquote class=\"primary-scripture\">When he opened the Abyss, smoke rose from it like the smoke from a gigantic furnace. The sun and sky were darkened by the smoke from the Abyss.</blockquote><p>Out of this pit of deception rose a hellish work that we will describe in our comments. <strong>Smoke</strong>&ndash;Mohamed threw up a smoke screen of false doctrine claiming to be a Prophet and to have received the Koran at Mecca. This smoke screen blinded the vision of the Arab world. They were forced to comply with this ruthless leader. It was a religion of the sword. Sun and sky were darkened by the smoke. The minds of men are so confused that they cannot see clearly.</p><h3>Revelation 9:3</h3><blockquote class=\"primary-scripture\">And out of the smoke locusts came down upon the earth and were given power like that of scorpions of the earth.</blockquote><p>A vast army of evil workers is to emerge upon the earth. The scorpion is the <strong>national symbol</strong> of the Ishmaelites. This arch deceiver was born at Mecca, a city of Arabia, famous for nothing. Mohammed's father died when he was only two years old. All the wealth of his father devolved to his uncles. Six years after the death of his father, his mother died. His grandfather, Abd' almotalleb died the following year. Abu Taleb, his uncle, took him under his protection. He lived sixteen years with him being trained in the employment of a merchant. They traded to Syria, Persia, and Egypt, India, Ethopia, and other southern regions of the globe.</p><p>At the age of twenty-five, a circumstance happened in Mecca, peculiarly favorable to the advancement of his projected scheme. A merchant of considerable wealth and influence dying in the city, his widow, to whom he left all of his possessions carried on his trade. She gave him discharge of her services. For the next three years he became acquainted both with Jews and Christians, whose religious opinions he would examine with as much attention as privacy would allow.</p><p>At twenty-eight he had gained entire victory over the widow's (Khadijah) heart and she could no longer resist. She gave him her heart and hand at the age of forty. At the age of twenty-eight, he took up his almost daily residence in a solitary cave, nigh to the city of Mecca, where he pretended to be favored with visions from the Almighty. He told his wife that Jehovah employed the angel Gabriel to bring him down the Koran, which was to contain the doctrines and precepts that heaven designed for his countrymen. She decided he was deranged and that his revelations were fabricated.</p><p>At this time there was a monk, Sergus, residing in his house. He was privy to the impostor's design, and greatly assisted him in bringing it to maturity as he became a convert of Mohammed. That very year the tyrant, Phocas (Roman Emperor), granted liberty to the Bishop of Rome, to assume the title of universal pastor. At the time when the Roman Catholic Church was climbing to the summit of its impious dignity in the north, a monster was forging the chains of delusion for the south.</p><p>At the age of forty, after completing the period of his probation in the cell, Mohammed assumed the title: Apostle of God. At this time, he tried his success with the public. For four years, the converts to his new religion were only nine in number. At forty-four, he put forth the leading ideas of his discourses, which were:</p><ul><li>God is one</li><li>He himself was the prophet of God, sent to declare his will to men</li><li>That they who affirm the Almighty to have sons or daughters, are chargeable with impiety, and ought to be detested.</li></ul><p>It is unquestionable that his design was to inveigh against the doctrine of the Trinity by one part of this assertion, and to condemn the idolatry of his countrymen by the other. His fellow countrymen were strongly addicted to the worship of three female deities, known by the names of Allat, Menat, and Al Uzza, whom they impiously denominated the daughters of God. As was expected, the ridicule and opposition he met with from his hearers put his counterfeit patience to many severe trials. People did not hesitate to pronounce him a sorcerer. They openly called him a liar, and viewed everything he uttered as impertinent and fabulous. For the next thirteen years he remained at Mecca.</p><p>Perceiving that there was little probability of advancing his religion by persuasion, he and his followers flee to Medina. This city is about two hundred seventy miles from Mecca. He lived there ten years before he died. Mohammed had a deep rooted enmity against the Jews, and made war upon all those adjacent tribes who professed that religion. The whole life of Mohammed after his flight to Medina, was one continued scene of butchery and rapine. He, with his associated and followers, plundered every caravan of it valuable commodities. It would be an almost endless task to give even a catalogue of his numerous wars. This imposter reduced city after city to his religion by the power of the sword. Lust and ambition were the two powerful motives by which he was actuated. For ten years, his life exhibited nothing but highway robbery, plunder, and bloodshed, in which he exceeded even Alexander the Great in atrocity. The religion of Mohammed infects and enslaves more of the globe than six times all of Europe together. In his unbounded lusts, it is clear that he had no less than fifteen wives. By admitting the inspiration of the Old and New Testament and the divine mission of Moses and Jesus Christ, he thereby stole insensibly on the affections of Jews and Christians. But he insinuated that God only designed his mission to be dominate. He was a master at snaring people and the Arch Deceiver of Mankind. We label him <strong>Abaddon</strong>.</p><h3>Revelation 9:4</h3><blockquote class=\"primary-scripture\">They were told not to harm the grass of the earth or any plant or tree, but only those people who did not have the seal of God on their foreheads.</blockquote><p>They were told to &ldquo;Cut down no palm tree, nor burn fields of corn, cut no fruit trees.&rdquo; (Gibbon 5 p. 309). They were commanded to kill no Christians. He gave the people three choices: 1) The Koran, 2) Slavery, 3) Cleave head of priest unless they become Mohammedans. (Gibbon 5 p. 189) &ldquo;And I would have you know that the fighting for religion is an act of obedience to God.&rdquo; (Gibbon 5 p 309)</p><h3>Revelation 9:5</h3><blockquote class=\"primary-scripture\">They were not given power to kill them, but only to torture them for five months. And the agony they suffered was like that of the sting of a scorpion when it strikes a man.</blockquote><p>Christians were styled infidels and dogs&ndash;insulted and treated shamefully. They were given options: the Koran, tribute, or the sword. They were prohibited to build new churches or sound the bells in the old ones. They were forced to admit scoffing Mohammedans into their assemblies. Those returning to the faith were given the penalty of death. The insults, injuries, oppressions, etc. are indescribable. In just ten years, from 634 to 644 A.D., the Saracens captured 3060 cities, destroyed 4,000 churches, and erected 1400 mosques. We hear but faintly the sounding of the woe trumpet. The Mohammedans took Damascus in 634, Jerusalem in 637, Egypt in 638, and westward to the banks of the Atlantic. They crossed into the borders of Europe in 675, crossed the Hellingspont and besieged Constantinople but were driven back. In 711 they crossed the straights of Gibralter into western Europe and conquered Spain. Their Dominion now consisted of: Asia, Africa, and Southwestern Europe. It was a penalty of death to profess Christianity in that empire till the treaty of Ryswick, 1844 AD, when the powers of Christianity forced on the Turks the Act of Toleration. This treaty has been flagrantly violated to this day.</p><p><strong>Five months</strong>, can be interpreted by applying the rule of <em>a day for a year</em>, which is a theory taken from Ezekiel: &ldquo;After you have finished this, lie down again, this time on your right side, and bear the sin of the house of Judah. I have assigned you 40 days, a day for each year.&rdquo; (Ezekiel 4:6).</p><p>Five months would therefore equal <strong>l50 years</strong>. Their movement lasted from 612 to 762 A.D. Exactly 150 years. The word of God is always right! Sting of a scorpion: this insect is bred in the Arabian sands. When it injects poison into the victim he sinks into insensibility&ndash;but does not die. The approaching paralysis and the terrible pain and agony makes the sufferer pray for death. Anyone captured by the Mohammedans would suffer as severely as if a scorpion had stung him.</p><h3>Revelation 9:6</h3><blockquote class=\"primary-scripture\">During those days men will seek death, but will not find it; they will long to die, but death will elude them.</blockquote><p>So horrible were the atrocities committed by the followers of Mohammed. Freedom of religion was denied. Men would rather die than live under these conditions.</p><p><em>Wherever I banish them, all the survivors of this evil nation will prefer death to life, declares the Lord Almighty.</em> (Jeremiah 8:3)</p><p>&ldquo;Ye Christian dogs, you know your option; the Koran, the tribute, or the sword. We are a people whose delight is in war rather than in peace: and we despise your pitiful alms, since we shall be speedily masters of your wealth, your families, and your persons.&rdquo; (Gibbon 5 p 315)</p><h3>Revelation 9:7-9</h3><blockquote class=\"primary-scripture\">The locusts looked like horses prepared for battle. On their heads they wore something like crowns of gold, and their faces resembled human faces.</blockquote><p>Arabia is the natural home of the horse. There were no foot-soldiers in the army of Mohammed in 632. The Arabians wore yellow turbans and from a distance it would look like crowns of gold. Their faces resembled human faces: this refers to the patriarchal beards.</p><p><em>The noise of a carefree crowd was around her; Sabeans [Or drunkards] were brought from the desert along with men from the rabble, and they put bracelets on the arms of the woman and her sister and beautiful crowns on their heads.</em> (Ezekiel 23:42)</p><blockquote class=\"primary-scripture\">Their hair was like women's hair, and their teeth were like lions' teeth.</blockquote><p>The Arabians wore long hair like women. The lions also had their home in the deserts of Arabia. This symbol denotes ability to devour.</p><blockquote class=\"primary-scripture\">They had breastplates like breastplates of iron, and the sound of their wings was like the thundering of many horses and chariots rushing into battle.</blockquote><p>In the Koran we read &ldquo;God hath given you coats of mail to defend you in your wars&rdquo; (Koran 11-104). The armor substance that is behind the face of the locust looks like plates of iron that appear on war-horses.</p><h3>Revelation 9:10-11</h3><blockquote class=\"primary-scripture\">They had tails and stings like scorpions, and in their tails they had power to torment people for five months.</blockquote><p>A horse&rsquo;s tail is an emblem of Turkish power. Instead of a flag, a horses tail is seen flying in the breeze. A Pacha of three tails is a very great officer. These officers were over their captives and the torment was like that of a scorpion. Their power was from 612-762 a period of five prophetic months. I list here the eight precepts of Mohammedism. (Turkish Tyranny, p. 181).</p><ol><li>They are surely infidels who say, &ldquo;Verily God is Christ the son of Mary.&rdquo; (Koran ch.5) p. 127.</li><li>O believers take not the Jews or Christians for friends. (Koran Ch. 5, p. 125)</li><li>War is enjoined by you against the infidels (Ch 2, p. 76).</li><li>Fight against them until there be no temptation to idolatry and the religion be Gods. (Ch 2, p. 7).</li><li>Fight against the friends of Satan. (Ch 4).</li><li>Kill the Idolaters wherever ye shall find them. (Ch 9).</li><li>Wherever you encounter the unbelievers strike off their heads, until you have made a great slaughter among them. (ch 4, p 390)</li><li>Ye are forbidden to take a wife or free women who are married, except those women whom ye possess as slaves.</li></ol><blockquote class=\"primary-scripture\">They had as king over them the angel of the Abyss, whose name in Hebrew is Abaddon, and in Greek, Apollyon.</blockquote><p>&ldquo;The siege of Constantinople by the Turks attracts our first attention to the person and character of the great destroyer.&rdquo; (Gibbon&rsquo;s, 6, p 417) Jesus means Savior. <strong>Abaddon</strong> means destroyer! It well describes the mission of Mohammed.</p><p>Note that real locust have no king: &ldquo;Locusts have no king, yet they advance together in ranks.&rdquo; (Prov. 30:27 ) Haley's Handbook says, &ldquo;The hardest blows ever to hit Christianity have been Mohammedism from without and Papal Usurpation from within.&rdquo;</p><p>In the Seventh century A.D., Mohammedanism swept the Eastern World like a tidal wave, and Blotted out Christianity in Southwest Asia and North Africa: the Euphrates and Nile Valleys: the Eastern and Southern Borders of the Mediterranean: lands of the Bible Story: lands in which the Bible originated and grew: lands in which God's Revelation of Himself to Mankind was nurtured and brought to completion: land in which God formed and trained the nation Israel, for two thousand years, to pave the way for the coming of Christ; lands hallowed forever as the scene of Christ's Life and Death and Resurrection and His Redemptive Work for Mankind: lands which were the Cradle of Christianity, and which were for 600 years Christian: the Original Christian World: in these lands, by one fell blow of the Mohammedanism Sword, CHRISTIANITY WAS BLOTTED OUT, and Mohammedanism was Established. And they HAVE BEEN MOHAMMEDAN EVER SINCE.&rdquo;</p><p>Mohammed, with the sword in one hand and the Koran in the other, erected his throne on the ruins of Christianity and of Rome. Gibbon 5 p. 207</p><p>&ldquo;The sword,&rdquo; says Mohammed, &ldquo;Is the key of heaven and of hell: a drop of blood shed in the cause of God, a night spent in arms, is of more avail than two months of fasting or prayer: whosoever falls in battle, his sins are forgiven.&rdquo; Gibbon 5 p.257</p><p>The following will illustrate how they made converts by the sword. At the battle of Bosra the Governor was given the terms.</p><p>After Chaled had imposed the terms of servitude and tribute, the apostate or convert avowed in the assembly of the people his meritorious treason: &ldquo;I renounce your society,&rdquo; said Romanus, &ldquo;both in this world and the world to come. And I deny him that was crucified, and whosoever worships him. And I choose God for my Lord, Islam for my faith, Mecca for my temple, the Moslems for my brethren, and Mohammed for my prophet; who was sent to lead us into the right way, and to exalt the true religion in spite of those who join partners with God.&rdquo; Gibbon 5, p.312</p><h3>Revelation 9:12-14</h3><blockquote class=\"primary-scripture\">The first woe is past; two other woes are yet to come.</blockquote><p>Dear reader, there is more lamentation and grief to come.</p><blockquote class=\"primary-scripture\">The sixth angel sounded his trumpet, and I heard a voice coming from the horns [That is, projections] of the golden altar that is before God.</blockquote><p>From the golden altar of incense.</p><blockquote class=\"primary-scripture\">It said to the sixth angel who had the trumpet, &quot;Release the four angels who are bound at the great river Euphrates.&quot;</blockquote><p>The Seer sets another scene before us. We must look for something at the Euphrates river. This river is 1780 miles long and flows into the Persian Gulf. I believe that the <strong>Ottoman Empire</strong> under Malek Shaw meets the requirements of the text. Consider that it was divided among his four sons at his death. It was divided into four parts: 1) Persia, 2) Syria, 3) Asia Minor, and 4) India. (See Gibbon, 4, p. 169.) &ldquo;Yet their progress was bounded by the Euphrates.&rdquo; (Gibbon 6, p. 419) &ldquo;Accompanied by his four brothers, he passed the Euphrates: the Turkish camp was soon seated in the neighborhood of Kutaieh in Phrygia; and his flying cavalry laid waste the country as far as the Hellingspont and the Black Sea.&rdquo; (Gibbon, 6, p. 24) They marched out of Baghdad in 1057, crossed the river and the next century their conquest extended to the Hellingspont, and embraced all Turkey. Then came the mighty crusades. For a while, they beat back the Moslem power and recovered a portion of Turkey, between Europe and Asia. The contest lasted for two centuries. Europe weary of its fruitless struggle withdrew. The Turks reorganized and passed over into Europe. The eastern empire was shorn of all its territories and reduced to its city of Constantople.</p><p>In 1453 two hundred thousand Turks with cannons, battered down the walls. One hundred thousand of its citizens were slain upon her ramparts. The interval was 396 years. This rapacious, licentious, bloodthirsty, brutal power educated in their religion to believe that all unbelievers (they call anyone who is not a Mohammedan an unbeliever or infidel) were fit for death. Each Pasha is an absolute Lord in his own province. Their rule was intolerable.</p><h3>Revelation 9:15</h3><blockquote class=\"primary-scripture\">And the four angels who had been kept ready for this very hour and day and month and year were released to kill a third of mankind.</blockquote><p>Our Julian year equals 365 days and 6 hours. On the year day principle of Ezekiel 4:6, it would be as follows:</p><ul><li>A Year = 365 1/4 Days = 365 Years + 1/4</li><li>A Month = 30 Days = 30 Years.</li><li>A Day = 1 Year.</li><li>TOTAL 396 Years.</li><li>1/4 of a prophetic day or year (left out above) = 91 1/4 days.</li><li>An hour = 1/12 of a prophetic day or year = 30 1/3 days.</li><li>TOTAL 396 years 121 + days</li></ul><p>January 18th. 1057 to May 29th 1453 = 396 years 131 days.</p><p>To kill a third: Refer to chapter 8:7, where my comments consider a third. The Roman Empire was divided into three parts, namely the Greeks, the Saracens, and the Franks (Latins). This trumpet sounds forth on the Greek part of the Empire.</p><h3>Revelation 9:16-19</h3><blockquote class=\"primary-scripture\">The number of the mounted troops was two hundred million. I heard their number.</blockquote><p>Not a foot soldier. (See Gibbon 4, pp.159, 161) &ldquo;The myriads of Turkish horse overspread a frontier of six hundred miles from Tauris to Arzeroum, and the blood of one hundred and thirty thousand Christians was a grateful sacrifice to the Arabian prophet.&rdquo; (Gibbon 6, p. 12)</p><blockquote class=\"primary-scripture\">The horses and riders I saw in my vision looked like this: Their breastplates were fiery red, dark blue, and yellow as sulfur. The heads of the horses resembled the heads of lions, and out of their mouths came fire, smoke and sulfur.</blockquote><p>This was the color of the Turkish uniform until reorganization a generation ago. The heads of the horses resembled the heads of lions. Take a close look at a flying cavalry with guns shooting from the horses&rsquo; heads and their manes flying in the breeze, does this not resemble a lion&rsquo;s head? Out of their mouths came fire, smoke and sulfur. When a lion pounces on its prey he utters a deafening roar. When these Turks attacked and fired their muskets a deafening roar ensued. <strong>Gunpowder</strong> was used first by the Turks. I will quote from the history of that time in regard to the first use of artillery.</p><p>&ldquo;Among the implements of destruction, he studied with peculiar care the recent and tremendous discovery of the Latins; and his artillery surpassed whatever had yet appeared in the world... On the assurance a foundry was established at Adrianople: the metal was prepared; and at the end of three months Urban produced a piece of brass ordnance of stupendous and almost incredible magnitude; a measure of twelve palms is assigned to the bore; and the stone bullet weighed above six hundred pounds.&rdquo; Gibbon 6, p. 426</p><p>&ldquo;For the conveyance of this destructive engine, a frame or carriage of thirty wagons was linked together and drawn along by a team of sixty oxen: two hundred men on both sides were stationed to poise and support the rolling weight; two hundred and fifty workmen marched before to smooth the way and repair the bridges; and near two months were employed in a laborious journey of one hundred and fifty miles.&rdquo; Gibbon 6, p. 427</p><p>&ldquo;The great cannon of Mohammed has been separately noticed; an important and visible object in the history of the times: but that enormous engine was flanked by two fellows almost of equal magnitude: the long order of the Turkish artillery was pointed against the walls; fourteen batteries thundered at once on the most accessible places; and of one of these it is ambiguously expressed that it was mounted with one hundred and thirty guns, or that it discharged one hundred and thirty bullets. Yet in the power and activity of the sultan we may discern the infancy of the new science. Under a master who counted the moments the great cannon could be loaded and fired no more than seven times in one day.&rdquo; Gibbon 6, p. 435</p><blockquote class=\"primary-scripture\">A third of mankind was killed by the three plagues of fire, smoke and sulfur that came out of their mouths.</blockquote><p>Refer to chapter 8:7, where my comments consider a third.</p><blockquote class=\"primary-scripture\">The power of the horses was in their mouths and in their tails; for their tails were like snakes, having heads with which they inflict injury.</blockquote><p>A horses tail was the emblem of the Turkish power. Instead of a flag a horses tail is seen flying in the breeze. A Pacha of three tails is a very great officer. The officers inflicted injury of their captives.</p><p>&ldquo;Above sixty thousand of this devoted people were transported from the city to the camp and fleet; exchanged or sold according to the caprice or interest of their masters, and dispersed in remote servitude through the provinces of the Ottoman empire.&rdquo; Gibbon 6, p. 449</p><h3>Revelation 9:20-21</h3><blockquote class=\"primary-scripture\">The rest of mankind that were not killed by these plagues still did not repent of the work of their hands; they did not stop worshiping demons, and idols of gold, silver, bronze, stone and wood&ndash;idols that cannot see or hear or walk. Nor did they repent of their murders, their magic arts, their sexual immorality or their thefts.</blockquote><p>The papal church has from the beginning been engaged in Saint worship. To this hour she has not repented of her Idol worship, demon worship, saint worship, and murders. In the papal church is found the blood of saints and prophets. Estimates vary as high as 50 million. Sorceries: No group on earth has practiced more tricks to deceive, from talking statues to apparitions. For further reading about their un-repented sins, particularly sexual immorality, refer to a book by Chiniquy, &ldquo;The Priest, The woman and the confessional,&rdquo; and a book by McLoughlin, &ldquo;Crime and Immorality in the Catholic Church.&rdquo;</p><p>I saw a Roman Catholic priest walking around with beads, images, crucifixes, and other symbols of idolatry. He had a silver image of our Savior on the cross. His religion is in a dead Christ. All of this is idolatry.</p>",
  "faq": [
    {
      "question": "Who is the 'fallen star' in this chapter?",
      "answer": "The commentary identifies the fallen star as Mohammed, a member of the princely house of Koreish who was set aside from ruling but rose with a 'smoke screen of deception.'"
    },
    {
      "question": "What is the prophetic meaning of the 'five months' mentioned in verse 5?",
      "answer": "Using the 'day for a year' principle from Ezekiel 4:6, five months equals 150 years, corresponding to the movement's duration from 612 to 762 A.D."
    },
    {
      "question": "How does the commentary interpret the 'fire, smoke, and sulfur' from the horses' mouths?",
      "answer": "This is interpreted as the use of gunpowder and artillery by the Turks, specifically noting the great cannons used during the siege of Constantinople."
    },
    {
      "question": "Who are the 'four angels' at the River Euphrates?",
      "answer": "They represent the four divisions of the Ottoman Empire under Malek Shaw: Persia, Syria, Asia Minor, and India."
    }
  ],
  "structuredData": [
    {
      "@context": "https://schema.org",
      "@type": "Article",
      "headline": "Mohammed, the Koran, and the Prophetic Abyss",
      "description": "This commentary identifies the fallen star as Mohammed and the smoke from the Abyss as the deception of the Koran, unleashing a 150-year torment upon the earth.",
      "author": {
        "@type": "Person",
        "name": "Lewis P. Hussell"
      },
      "about": [
        {
          "@type": "Person",
          "name": "Mohammed",
          "description": "The 'fallen star' and prophet of Islam who founded the religion in Arabia.",
          "sameAs": "https://en.wikipedia.org/wiki/Muhammad"
        },
        {
          "@type": "Thing",
          "name": "The Koran",
          "description": "Described as the 'Key of the shaft of the Abyss' used to justify the movement's actions.",
          "sameAs": "https://en.wikipedia.org/wiki/Quran"
        },
        {
          "@type": "Thing",
          "name": "Abaddon",
          "description": "The 'Destroyer' and king of the locusts, identified in the text as Mohammed.",
          "sameAs": "https://en.wikipedia.org/wiki/Abaddon"
        },
        {
          "@type": "Place",
          "name": "Ottoman Empire",
          "description": "The power identified with the sixth trumpet and the river Euphrates.",
          "sameAs": "https://en.wikipedia.org/wiki/Ottoman_Empire"
        },
        {
          "@type": "CreativeWork",
          "name": "Revelation"
        },
        {
          "@type": "CreativeWork",
          "name": "Chapter 9"
        }
      ],
      "keywords": "Revelation 9 historical interpretation, Mohammed fallen star Revelation, Koran key to the Abyss, Revelation 150 years prophecy, Abaddon as Mohammed, Revelation 9 Ottoman Empire, Gunpowder in Revelation prophecy, Saracens as locusts Revelation"
    },
    {
      "@context": "https://schema.org",
      "@type": "FAQPage",
      "mainEntity": [
        {
          "@type": "Question",
          "name": "Who is the 'fallen star' in this chapter?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The commentary identifies the fallen star as Mohammed, a member of the princely house of Koreish who was set aside from ruling but rose with a 'smoke screen of deception.'"
          }
        },
        {
          "@type": "Question",
          "name": "What is the prophetic meaning of the 'five months' mentioned in verse 5?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "Using the 'day for a year' principle from Ezekiel 4:6, five months equals 150 years, corresponding to the movement's duration from 612 to 762 A.D."
          }
        },
        {
          "@type": "Question",
          "name": "How does the commentary interpret the 'fire, smoke, and sulfur' from the horses' mouths?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "This is interpreted as the use of gunpowder and artillery by the Turks, specifically noting the great cannons used during the siege of Constantinople."
          }
        },
        {
          "@type": "Question",
          "name": "Who are the 'four angels' at the River Euphrates?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "They represent the four divisions of the Ottoman Empire under Malek Shaw: Persia, Syria, Asia Minor, and India."
          }
        }
      ]
    },
    {
      "@context": "https://schema.org",
      "@type": "BreadcrumbList",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://4thewordofgod.com/"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Commentaries",
          "item": "https://4thewordofgod.com/commentaries/"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Revelation",
          "item": "https://4thewordofgod.com/commentaries/revelation"
        },
        {
          "@type": "ListItem",
          "position": 4,
          "name": "Chapter 9",
          "item": "https://4thewordofgod.com/commentaries/revelation/9"
        }
      ]
    }
  ],
  "metaDescription": "This commentary identifies the fallen star as Mohammed and the smoke from the Abyss as the deception of the Koran, unleashing a 150-year torment upon the earth.",
  "keywords": [
    "Revelation 9 historical interpretation",
    "Mohammed fallen star Revelation",
    "Koran key to the Abyss",
    "Revelation 150 years prophecy",
    "Abaddon as Mohammed",
    "Revelation 9 Ottoman Empire",
    "Gunpowder in Revelation prophecy",
    "Saracens as locusts Revelation"
  ],
  "previous_chapter": "revelation_08",
  "next_chapter": "revelation_10"
}